{
  "speakers": {
    "spk_0": "Luciano",
    "spk_1": "Eoin"
  },
  "segments": [
    {
      "speakerLabel": "spk_0",
      "start": 0,
      "end": 4.5600000000000005,
      "text": " Hello everyone, Luciano here and we have a unique episode for you today."
    },
    {
      "speakerLabel": "spk_0",
      "start": 4.5600000000000005,
      "end": 10.64,
      "text": " I am currently at reInvent in Vegas and I've been here since all the week and we wanted to have the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 10.64,
      "end": 15.84,
      "text": " chance to share the experience with you all and we're going to talk just about what did I do,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 15.84,
      "end": 20.48,
      "text": " what did I learn, people I met, different announcements that we have seen and we maybe"
    },
    {
      "speakerLabel": "spk_0",
      "start": 20.48,
      "end": 26.32,
      "text": " want to comment on a little bit. So I hope this is going to be an interesting episode and maybe"
    },
    {
      "speakerLabel": "spk_0",
      "start": 26.32,
      "end": 31.2,
      "text": " something that is going to inspire you to look more at reInvent and maybe we'll see you here"
    },
    {
      "speakerLabel": "spk_0",
      "start": 31.2,
      "end": 36.08,
      "text": " next time, next year and we can chat together about all the different things that happen at"
    },
    {
      "speakerLabel": "spk_0",
      "start": 36.08,
      "end": 41.04,
      "text": " reInvent. My name is Luciano and I'm joined by Eoin for another episode of AWS Bites."
    },
    {
      "speakerLabel": "spk_0",
      "start": 49.04,
      "end": 54.64,
      "text": " AWS Bites is brought to you by fourTheorem, the ultimate AWS partner for modern applications on"
    },
    {
      "speakerLabel": "spk_0",
      "start": 54.64,
      "end": 59.84,
      "text": " AWS. We can help you to become successful with AWS and if you're interested check us out at"
    },
    {
      "speakerLabel": "spk_0",
      "start": 59.84,
      "end": 66,
      "text": " fourTheorem.com."
    },
    {
      "speakerLabel": "spk_1",
      "start": 66,
      "end": 72.88,
      "text": " Hey Luciano, how's it going? So I'm curious to know how are you getting on over there? What is reInvent 2023 like?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 72.88,
      "end": 79.52,
      "text": " Yeah, I think it's just crazy. So many people, so many activities, so many things to do. So it has been my first one so I'm totally anew but this I'm"
    },
    {
      "speakerLabel": "spk_0",
      "start": 79.52,
      "end": 85.28,
      "text": " totally improvising and trying to get the best of it but honestly I'm just getting by and trying to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 85.28,
      "end": 91.11999999999999,
      "text": " do whatever happens every day without trying to plan it too much because it's challenging even to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 91.11999999999999,
      "end": 96.56,
      "text": " try to come up with a plan. I heard that there are at least 60,000 people which should give you like"
    },
    {
      "speakerLabel": "spk_0",
      "start": 96.56,
      "end": 102.8,
      "text": " the scale of how busy it is. So yeah and it's just interesting even just the logistics of it is like"
    },
    {
      "speakerLabel": "spk_0",
      "start": 102.8,
      "end": 109.2,
      "text": " spread across multiple hotels like these big casinos and you really need to plan like when"
    },
    {
      "speakerLabel": "spk_0",
      "start": 109.2,
      "end": 113.84,
      "text": " you want to go from one to the other. Of course there is transportation but like it takes time"
    },
    {
      "speakerLabel": "spk_0",
      "start": 113.84,
      "end": 119.84,
      "text": " even to walk from one room to the next one if you're trying to attend different talks. So far"
    },
    {
      "speakerLabel": "spk_0",
      "start": 119.84,
      "end": 125.67999999999999,
      "text": " absolutely positive experience. I am amazed of on how many people I met and how many things I've"
    },
    {
      "speakerLabel": "spk_0",
      "start": 125.67999999999999,
      "end": 130.48,
      "text": " learned and new connections or also meeting people that have been connected with before but only"
    },
    {
      "speakerLabel": "spk_0",
      "start": 130.48,
      "end": 137.2,
      "text": " online and I finally had the chance to meet many of them in person. So that alone I think pays that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 137.2,
      "end": 142.23999999999998,
      "text": " they experience big time."
    },
    {
      "speakerLabel": "spk_1",
      "start": 142.23999999999998,
      "end": 146.23999999999998,
      "text": " It sounds like meeting people is just more of an advantage than attending the talks. I guess you can watch those back on YouTube later whatever you've missed but since you"
    },
    {
      "speakerLabel": "spk_1",
      "start": 146.23999999999998,
      "end": 151.6,
      "text": " mentioned it's your first re-invent. If myself, anybody else wants to go over there for the first"
    },
    {
      "speakerLabel": "spk_1",
      "start": 151.6,
      "end": 156.56,
      "text": " time do you think you've made any rookie mistakes so far that you wouldn't do again?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 156.56,
      "end": 163.92000000000002,
      "text": " Yeah probably made many at this point but yeah the main one is probably trying to plan to attend talks but not"
    },
    {
      "speakerLabel": "spk_0",
      "start": 163.92000000000002,
      "end": 170.08,
      "text": " realize again how far away things can be. For instance yesterday I wanted to attend the power"
    },
    {
      "speakerLabel": "spk_0",
      "start": 170.08,
      "end": 177.28,
      "text": " tools workshop and I had to go from the Venetian which is where I'm staying to Mandalay Bay which"
    },
    {
      "speakerLabel": "spk_0",
      "start": 177.28,
      "end": 182.32,
      "text": " if you just look on Google Maps doesn't seem too far away and there are buses so I left like one"
    },
    {
      "speakerLabel": "spk_0",
      "start": 182.32,
      "end": 188.4,
      "text": " hour early with the bus from the Venetian and it got stuck in traffic and it took slightly more"
    },
    {
      "speakerLabel": "spk_0",
      "start": 188.4,
      "end": 194.56,
      "text": " than one hour so when I got there and I found the room it was probably like five ten minutes late so"
    },
    {
      "speakerLabel": "spk_0",
      "start": 194.56,
      "end": 199.92,
      "text": " not too too late but the room was already packed and they just didn't let me in so it was a bit of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 199.92,
      "end": 204.32,
      "text": " a shame that I spent like more than one hour trying to get there to attend the workshop and then"
    },
    {
      "speakerLabel": "spk_0",
      "start": 204.32,
      "end": 210.16,
      "text": " I couldn't attend it. I was still able to meet the power tools team and have a nice chat after it"
    },
    {
      "speakerLabel": "spk_0",
      "start": 210.16,
      "end": 214.32,
      "text": " so it was totally worth it to go anyway but yeah it was a bit of a rookie mistake I should have"
    },
    {
      "speakerLabel": "spk_0",
      "start": 214.32,
      "end": 219.04,
      "text": " planned that a little bit better and maybe go there a little bit earlier so I think that kind"
    },
    {
      "speakerLabel": "spk_0",
      "start": 219.04,
      "end": 222.56,
      "text": " of stuff can happen and sometimes there are so many talks so you might not realize when you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 222.56,
      "end": 227.04,
      "text": " create your own agenda that maybe one after the other is just not feasible because you're not"
    },
    {
      "speakerLabel": "spk_0",
      "start": 227.04,
      "end": 231.84,
      "text": " going to have enough time to to move from one place to the next one so someday definitely to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 231.84,
      "end": 237.6,
      "text": " keep in mind and next year maybe try to have just a very few talks you want to attend and make sure"
    },
    {
      "speakerLabel": "spk_0",
      "start": 237.6,
      "end": 242.23999999999998,
      "text": " you have enough space to move from wherever you are to the to the venue where they're doing the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 242.23999999999998,
      "end": 248.4,
      "text": " talk."
    },
    {
      "speakerLabel": "spk_1",
      "start": 248.4,
      "end": 254,
      "text": " Yeah and I guess all the talks are along the strip in Las Vegas right I'm fairly familiar with the layout of it and I know that it seems deceptively short like you would not think but"
    },
    {
      "speakerLabel": "spk_1",
      "start": 254,
      "end": 258.4,
      "text": " it's actually like I don't know how many miles long it is but I'm looking here it looks like it's"
    },
    {
      "speakerLabel": "spk_1",
      "start": 258.4,
      "end": 262.88,
      "text": " almost like two and a half miles to get from the Venetian to Mandalay Bay even though you can"
    },
    {
      "speakerLabel": "spk_1",
      "start": 262.96,
      "end": 270.15999999999997,
      "text": " kind of see Mandalay Bay nearly. Exactly. So yeah it's pretty but still an hour it's crazy for that"
    },
    {
      "speakerLabel": "spk_1",
      "start": 270.15999999999997,
      "end": 274.24,
      "text": " distance isn't it? Yeah the other thing is even if you're walking right you got to go up these steps"
    },
    {
      "speakerLabel": "spk_1",
      "start": 274.24,
      "end": 279.6,
      "text": " and down the steps and through buildings and through casinos so it's it always takes longer."
    },
    {
      "speakerLabel": "spk_0",
      "start": 279.6,
      "end": 283.52,
      "text": " I think the thing that is making it worse this year is that they just had the Formula One"
    },
    {
      "speakerLabel": "spk_0",
      "start": 284.08,
      "end": 288.48,
      "text": " so you can see on the roads they are still cleaning up all the setup that they add so I"
    },
    {
      "speakerLabel": "spk_0",
      "start": 288.48,
      "end": 293.04,
      "text": " think that that's why traffic is a little bit worse than what probably would be in another"
    },
    {
      "speakerLabel": "spk_0",
      "start": 293.04,
      "end": 297.68,
      "text": " time of the year. Yeah watch you don't fall into any manholes that have been displaced. I hope not."
    },
    {
      "speakerLabel": "spk_1",
      "start": 299.36,
      "end": 305.92,
      "text": " Okay so you what have you been up to then you mentioned meeting people. Did you like schedule"
    },
    {
      "speakerLabel": "spk_1",
      "start": 305.92,
      "end": 309.6,
      "text": " a bunch of meetings with people and are you rushing around from place to place? Is it more"
    },
    {
      "speakerLabel": "spk_1",
      "start": 309.6,
      "end": 316.8,
      "text": " kind of ad hoc? And have you managed to get into any good talks so far? Are you kind of at this"
    },
    {
      "speakerLabel": "spk_1",
      "start": 316.8,
      "end": 321.76,
      "text": " stage thinking you've got a couple of days left are you going to just try and abandon talks all"
    },
    {
      "speakerLabel": "spk_1",
      "start": 321.76,
      "end": 326.56,
      "text": " together and just focus more on the social and the networking side?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 326.56,
      "end": 332.24,
      "text": " Yeah I've attended a couple of talks and they can be really interesting but I would say just go to the talks where"
    },
    {
      "speakerLabel": "spk_0",
      "start": 332.24,
      "end": 336.88,
      "text": " you really think you can get value on the face-to-face with the speaker and maybe other"
    },
    {
      "speakerLabel": "spk_0",
      "start": 336.88,
      "end": 341.84000000000003,
      "text": " people that have an interest on the same topic and then you can use the question time to socialize a"
    },
    {
      "speakerLabel": "spk_0",
      "start": 341.84,
      "end": 346.88,
      "text": " little bit because again just the content alone it's something you can consume later on everything"
    },
    {
      "speakerLabel": "spk_0",
      "start": 346.88,
      "end": 353.2,
      "text": " is recorded slides are available so it's not worth it to compromise the opportunity for more"
    },
    {
      "speakerLabel": "spk_0",
      "start": 353.2,
      "end": 360.23999999999995,
      "text": " networking for just going and seeing something you can check out later on your own time and yeah so"
    },
    {
      "speakerLabel": "spk_0",
      "start": 360.23999999999995,
      "end": 365.67999999999995,
      "text": " so be aware of that so I attended one about Lambdas in rust which is a topic that I'm really being"
    },
    {
      "speakerLabel": "spk_0",
      "start": 365.67999999999995,
      "end": 369.44,
      "text": " curious about and been experimenting a bit. I'm surprised you didn't give that one but go on."
    },
    {
      "speakerLabel": "spk_0",
      "start": 369.84,
      "end": 375.76,
      "text": " And yeah it was actually a really good talk by Efi and he is also another serverless hero and"
    },
    {
      "speakerLabel": "spk_0",
      "start": 376.48,
      "end": 381.76,
      "text": " basically he actually described three different ways to use rust in the context of Lambda so not"
    },
    {
      "speakerLabel": "spk_0",
      "start": 381.76,
      "end": 386.96,
      "text": " just building on Lambda runtimes but even just packaging a library written in rust for python"
    },
    {
      "speakerLabel": "spk_0",
      "start": 386.96,
      "end": 391.6,
      "text": " for instance and then just using it in the python runtime or even building custom Lambda extensions"
    },
    {
      "speakerLabel": "spk_0",
      "start": 391.6,
      "end": 396.8,
      "text": " with rust and then using them with other runtimes like java or not js so a bunch of interesting"
    },
    {
      "speakerLabel": "spk_0",
      "start": 397.44,
      "end": 402.16,
      "text": " learnings there and the conversation after it was super interesting it was actually"
    },
    {
      "speakerLabel": "spk_0",
      "start": 402.16,
      "end": 406.32,
      "text": " relatively small crowd which wasn't surprising because it's a very niche topic still"
    },
    {
      "speakerLabel": "spk_0",
      "start": 406.32,
      "end": 410.72,
      "text": " but everyone that was there was like super excited and everyone was trying to share"
    },
    {
      "speakerLabel": "spk_0",
      "start": 410.72,
      "end": 414.96000000000004,
      "text": " all the mistakes and all the lesson learned while trying to do this thing which is still"
    },
    {
      "speakerLabel": "spk_0",
      "start": 414.96000000000004,
      "end": 420.08000000000004,
      "text": " pretty new and not many people are doing so it was quite an engaging session because everyone was"
    },
    {
      "speakerLabel": "spk_0",
      "start": 420.08000000000004,
      "end": 424.8,
      "text": " super excited to try to learn from each other and other than that has been mostly trying to meet"
    },
    {
      "speakerLabel": "spk_0",
      "start": 424.8,
      "end": 430.56,
      "text": " people I wasn't really sure how to schedule all of that again because my first time here I didn't"
    },
    {
      "speakerLabel": "spk_0",
      "start": 430.56,
      "end": 435.2,
      "text": " know what the spaces will look like what everyone agenda is going to look like so I was just"
    },
    {
      "speakerLabel": "spk_0",
      "start": 435.2,
      "end": 441.12,
      "text": " connecting before the event online on slack linkedin twitter and just asking people I'm going"
    },
    {
      "speakerLabel": "spk_0",
      "start": 441.12,
      "end": 445.92,
      "text": " to be there let's exchange maybe phone numbers and then let's try to find some time to spend some"
    },
    {
      "speakerLabel": "spk_0",
      "start": 445.92,
      "end": 451.28000000000003,
      "text": " time together and that has been working out in in a mixed way I think in some cases it's working very"
    },
    {
      "speakerLabel": "spk_0",
      "start": 451.28,
      "end": 456.08,
      "text": " well in other cases I just was unable to meet the people because the schedules didn't really"
    },
    {
      "speakerLabel": "spk_0",
      "start": 456.08,
      "end": 461.67999999999995,
      "text": " match but also there have been a few interesting events organized by AWS for the heroes or the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 461.67999999999995,
      "end": 467.44,
      "text": " community builders so being able to to attend this focused events is generally the best place"
    },
    {
      "speakerLabel": "spk_0",
      "start": 467.44,
      "end": 472.55999999999995,
      "text": " to meet people that more or less have the same interest and people that you might want to talk to and just share opinions. "
    },
    {
      "speakerLabel": "spk_1",
      "start": 477.76,
      "end": 481.76,
      "text": " It's probably good to talk about some announcements since we're talking about re-invent I thought a few of them were pretty interesting there's been quite a lot so far. "
    },
    {
      "speakerLabel": "spk_1",
      "start": 481.76,
      "end": 486.72,
      "text": " I haven't had a chance to really try out any of the new features or services that much."
    },
    {
      "speakerLabel": "spk_1",
      "start": 487.36,
      "end": 491.52,
      "text": " What about you from your position on the ground there, what have you picked up? What are your favorite announcements? We won't go through them all. "
    },
    {
      "speakerLabel": "spk_0",
      "start": 497.52,
      "end": 503.44,
      "text": " Yeah I think I only looked marginally because again here it you can be so busy that all the announcements at least for me become almost like a"
    },
    {
      "speakerLabel": "spk_0",
      "start": 503.52,
      "end": 508.08,
      "text": " second order problem like yes I like to see the headlines but I'm not gonna"
    },
    {
      "speakerLabel": "spk_0",
      "start": 508.08,
      "end": 513.76,
      "text": " deep dive and see exactly what's going on so in that sense one that seems very exciting it's"
    },
    {
      "speakerLabel": "spk_0",
      "start": 513.76,
      "end": 519.12,
      "text": " serverless memcache and it's something that people following the podcast know that we have been"
    },
    {
      "speakerLabel": "spk_0",
      "start": 519.12,
      "end": 524.8,
      "text": " requesting for at least two years I think it was one of our very first episodes where we mentioned"
    },
    {
      "speakerLabel": "spk_0",
      "start": 524.8,
      "end": 530.48,
      "text": " that it would be a nice thing to have for AWS and offer that kind of service so I'm really excited"
    },
    {
      "speakerLabel": "spk_0",
      "start": 530.48,
      "end": 535.6,
      "text": " about that I already heard disappointing opinions that maybe it's not really serverless or as"
    },
    {
      "speakerLabel": "spk_0",
      "start": 535.6,
      "end": 541.6800000000001,
      "text": " serverless as we wanted it to be but it's still a step in the right direction I hope so I think I'm"
    },
    {
      "speakerLabel": "spk_0",
      "start": 541.6800000000001,
      "end": 546.32,
      "text": " going to defer a final opinion while while I have the time to when I have the time to try it out and see really what it looks like to to use it. "
    },
    {
      "speakerLabel": "spk_1",
      "start": 553.44,
      "end": 557.52,
      "text": " It looked pretty good to me as well because the pricing page hadn't been published fully when I"
    },
    {
      "speakerLabel": "spk_1",
      "start": 557.52,
      "end": 562.8,
      "text": " looked at it first. Then when I checked it looks like you pay per gigabyte storage which sounds"
    },
    {
      "speakerLabel": "spk_1",
      "start": 562.8,
      "end": 568.24,
      "text": " fine if you store some data in there but there's a minimum of a gigabyte and that's like 90 dollars a month already. So that's a bit disappointing as you say. "
    },
    {
      "speakerLabel": "spk_0",
      "start": 573.52,
      "end": 580.16,
      "text": " Okay so it doesn't scale to zero at least in terms of pricing. Okay so let's let's put that disappointment aside for a second"
    },
    {
      "speakerLabel": "spk_0",
      "start": 580.16,
      "end": 585.36,
      "text": " the other one that is probably a minimal thing but I think it can be very interesting and can enable"
    },
    {
      "speakerLabel": "spk_0",
      "start": 585.36,
      "end": 592.5600000000001,
      "text": " a bunch of interesting use cases is the API for the free tier services which I think is going to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 592.5600000000001,
      "end": 599.36,
      "text": " allow lots of interesting dashboards and integrations and it might make AWS more accessible"
    },
    {
      "speakerLabel": "spk_0",
      "start": 599.36,
      "end": 605.12,
      "text": " to people like students that might be very concerned about not overspending on AWS so that's"
    },
    {
      "speakerLabel": "spk_0",
      "start": 605.12,
      "end": 609.84,
      "text": " definitely a welcome addition and again something that I want to play with a little bit more before"
    },
    {
      "speakerLabel": "spk_0",
      "start": 609.84,
      "end": 614.72,
      "text": " having a final opinion but it's great to see that there is a little bit of movement in that direction"
    },
    {
      "speakerLabel": "spk_0",
      "start": 614.72,
      "end": 620.24,
      "text": " where it should be easier for people to see what is actually being given for free and not fall into"
    },
    {
      "speakerLabel": "spk_0",
      "start": 620.24,
      "end": 626,
      "text": " any mistake or trap and then have some kind of bill shock at the end of the month. What about you? What did you like so far?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 631.6,
      "end": 638.1600000000001,
      "text": " There are a couple of nice ones in the kind of serverless space like SQS FIFO throughput has had a massive increase and now you can do 70,000 transactions per second so now"
    },
    {
      "speakerLabel": "spk_1",
      "start": 638.7199999999999,
      "end": 644.88,
      "text": " SQS FIFO queues used to be a lot more limited in terms of throughput now with 70,000 transactions"
    },
    {
      "speakerLabel": "spk_1",
      "start": 644.88,
      "end": 652.24,
      "text": " per second you can theoretically put 700,000 messages through it in a second and also with SQS FIFO you"
    },
    {
      "speakerLabel": "spk_1",
      "start": 652.24,
      "end": 658.7199999999999,
      "text": " can now do QA drives for DLQs which was something that was missing before and then on Lambda"
    },
    {
      "speakerLabel": "spk_1",
      "start": 658.7199999999999,
      "end": 663.92,
      "text": " the scalability of Lambda has suddenly had another jump as well so everybody can get a thousand"
    },
    {
      "speakerLabel": "spk_1",
      "start": 664.4799999999999,
      "end": 669.5999999999999,
      "text": " invocations per minute after the burst concurrency we talked a lot about burst concurrency and Lambda"
    },
    {
      "speakerLabel": "spk_1",
      "start": 669.5999999999999,
      "end": 677.28,
      "text": " in a previous episode but like in most accounts that we've used in eu-west-1, we can get 3,000"
    },
    {
      "speakerLabel": "spk_1",
      "start": 677.28,
      "end": 681.52,
      "text": " immediately and then it used to be 500 per minute. Now, that's a thousand per minute, so you can scale"
    },
    {
      "speakerLabel": "spk_1",
      "start": 681.52,
      "end": 688.9599999999999,
      "text": " up really fast. And then on Step Functions, there were two announcements that I'm aware of. One was"
    },
    {
      "speakerLabel": "spk_1",
      "start": 688.96,
      "end": 694.8000000000001,
      "text": " the ability to be able to redrive from a failed state. I think that's a really good one so now"
    },
    {
      "speakerLabel": "spk_1",
      "start": 694.8000000000001,
      "end": 698.8000000000001,
      "text": " you don't have to run the whole function again you can just continue from the failed step. And"
    },
    {
      "speakerLabel": "spk_1",
      "start": 698.8000000000001,
      "end": 703.84,
      "text": " the other thing is something we actually asked for I think when we covered Application Composer"
    },
    {
      "speakerLabel": "spk_1",
      "start": 703.84,
      "end": 710.8000000000001,
      "text": " which is the ability to integrate Step Functions workflow studio into Application Composer now"
    },
    {
      "speakerLabel": "spk_1",
      "start": 710.8,
      "end": 720.64,
      "text": " that's done so they're obviously listening thanks everybody what I think you caught a lot of the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 721.1999999999999,
      "end": 728.88,
      "text": " Adam's Selipsky keynote yesterday now there's a lot of AI as we could have predicted and I think even"
    },
    {
      "speakerLabel": "spk_1",
      "start": 728.88,
      "end": 734.3199999999999,
      "text": " though they're pretty impressive in a lot of ways all of the Amazon Q announcements we could have"
    },
    {
      "speakerLabel": "spk_1",
      "start": 734.4000000000001,
      "end": 740.8000000000001,
      "text": " predicted them as well because it felt like AWS had to have an answer to all the announcements"
    },
    {
      "speakerLabel": "spk_1",
      "start": 740.8000000000001,
      "end": 745.84,
      "text": " from the open AI developer conference from a few weeks ago do you have any thoughts I'm guessing"
    },
    {
      "speakerLabel": "spk_1",
      "start": 745.84,
      "end": 751.9200000000001,
      "text": " you haven't had a chance to try it out but have you heard from anyone is there a mood in Las Vegas on what Amazon Q can do? Is it skeptical or optimistic? "
    },
    {
      "speakerLabel": "spk_0",
      "start": 760.32,
      "end": 767.84,
      "text": "I think I spoke with a few people after the keynote and I maybe it's a bit of a bubble that I'm personally in but most people more I guess on"
    },
    {
      "speakerLabel": "spk_0",
      "start": 767.84,
      "end": 774.08,
      "text": " the developer side are a bit disappointed that there was so much focus on AI alone and they're"
    },
    {
      "speakerLabel": "spk_0",
      "start": 774.08,
      "end": 779.44,
      "text": " looking forward for the keynote from Werner just to see stuff that is probably a little bit closer"
    },
    {
      "speakerLabel": "spk_0",
      "start": 779.44,
      "end": 784.8000000000001,
      "text": " to what developers are looking for so maybe it's just a different audience there in general I think"
    },
    {
      "speakerLabel": "spk_0",
      "start": 784.8000000000001,
      "end": 789.9200000000001,
      "text": " it's it's impressive to see the amount of investment that was put in AI but again it's not surprising"
    },
    {
      "speakerLabel": "spk_0",
      "start": 790.0799999999999,
      "end": 794.4799999999999,
      "text": " that that's the main message that AWS wants to push because that's been the main message probably"
    },
    {
      "speakerLabel": "spk_0",
      "start": 794.4799999999999,
      "end": 800.88,
      "text": " for all 2023 and it only makes sense to come to re-invent with strong announcements in that field."
    },
    {
      "speakerLabel": "spk_1",
      "start": 807.92,
      "end": 814.0799999999999,
      "text": " I've had a very brief period just playing with the Q assistant in the AWS console because it's like a it's almost a bit like Clippy for AWS console it's like, \"I see you're starting an EC2"
    },
    {
      "speakerLabel": "spk_1",
      "start": 814.08,
      "end": 821.2800000000001,
      "text": " instance. I can help you with that!\" I've got mixed results so far but you know we know AWS tends to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 821.2800000000001,
      "end": 824.8000000000001,
      "text": " launch things a little bit early especially like they were it seemed like they were going to have"
    },
    {
      "speakerLabel": "spk_1",
      "start": 824.8000000000001,
      "end": 829.2,
      "text": " to launch this no matter what I would give it time I'm sure it will improve models will improve"
    },
    {
      "speakerLabel": "spk_1",
      "start": 829.2,
      "end": 837.2,
      "text": " anyway but I actually am impressed by the way they've integrated Q into AWS console visual"
    },
    {
      "speakerLabel": "spk_1",
      "start": 837.2,
      "end": 845.36,
      "text": " studio code AWS toolkit loads of other services like connect and quick site it must have been a"
    },
    {
      "speakerLabel": "spk_1",
      "start": 845.36,
      "end": 850.96,
      "text": " massive massive undertaking to get everything ready in time for re-invent so that is impressive"
    },
    {
      "speakerLabel": "spk_1",
      "start": 850.96,
      "end": 855.6800000000001,
      "text": " and there's there's loads more like you can you can start your own chatbot application you can"
    },
    {
      "speakerLabel": "spk_1",
      "start": 855.6800000000001,
      "end": 862.8000000000001,
      "text": " integrate it with your own data sources like Gmail and Dropbox and Aurora, SQL server loads of stuff"
    },
    {
      "speakerLabel": "spk_1",
      "start": 862.8,
      "end": 866.8,
      "text": " and it's it's an alternative which I would probably intuitively trust a lot more than"
    },
    {
      "speakerLabel": "spk_1",
      "start": 866.8,
      "end": 871.04,
      "text": " any of the other offerings out there because I know about AWS security and how it works"
    },
    {
      "speakerLabel": "spk_1",
      "start": 871.5999999999999,
      "end": 875.68,
      "text": " and I would have high confidence in it doing the right thing with my data"
    },
    {
      "speakerLabel": "spk_1",
      "start": 875.68,
      "end": 880.3199999999999,
      "text": " I'd be much more comfortable building like an enterprise knowledge base retrieval augmented"
    },
    {
      "speakerLabel": "spk_1",
      "start": 880.3199999999999,
      "end": 887.8399999999999,
      "text": " system with a bedrock or Q than I would with anything else and there's obviously a lot of focus"
    },
    {
      "speakerLabel": "spk_1",
      "start": 887.84,
      "end": 893.2800000000001,
      "text": " on code transformation as well they announced this Q code transformation that can migrate"
    },
    {
      "speakerLabel": "spk_1",
      "start": 893.2800000000001,
      "end": 902.32,
      "text": " Java 8 applications to Java 17 applications I think in minutes now the Adam's claims were quite"
    },
    {
      "speakerLabel": "spk_1",
      "start": 902.88,
      "end": 907.2800000000001,
      "text": " extreme I think it was something like thousands of applications migrated in minutes I'd love to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 907.2800000000001,
      "end": 912,
      "text": " know how that works and how do you even test them exactly I don't mean that amount of time but"
    },
    {
      "speakerLabel": "spk_1",
      "start": 912,
      "end": 920.24,
      "text": " let's see how it goes. I've started playing around a little bit with the AWS toolkit in VS code so"
    },
    {
      "speakerLabel": "spk_1",
      "start": 921.04,
      "end": 924.72,
      "text": " loads of stuff to play with there I think it's worth giving a try and I'm sure there'll be some"
    },
    {
      "speakerLabel": "spk_1",
      "start": 924.72,
      "end": 930.32,
      "text": " rough edges at the start but as alway.s it'll improve over time so apart from announcements"
    },
    {
      "speakerLabel": "spk_1",
      "start": 930.32,
      "end": 935.84,
      "text": " Maybe some advice, what would you recommend based on what you've seen so far other people to go?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 941.36,
      "end": 946.4,
      "text": " I think in general yes it is a bit of an investment both in terms of time but in terms of cost because of course it's not depending on where you're coming from it might be expensive to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 946.4,
      "end": 953.52,
      "text": " fly here it is expensive to stay here the tickets to the conference are also not cheap so it's"
    },
    {
      "speakerLabel": "spk_0",
      "start": 953.52,
      "end": 957.76,
      "text": " definitely something that you have to see as an investment and make sure that you get back the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 957.76,
      "end": 964.24,
      "text": " right value from it. But I think in general, if you are working in the AWS space it is the place to be"
    },
    {
      "speakerLabel": "spk_0",
      "start": 964.24,
      "end": 969.8399999999999,
      "text": " to get not just the news which is something that you can get from your the comfort of your own home"
    },
    {
      "speakerLabel": "spk_0",
      "start": 969.84,
      "end": 974.4,
      "text": " and just watch all the keynotes and all the announcements from remotely right but more to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 974.4,
      "end": 980.32,
      "text": " meet all the people and exchange opinions exchange contacts solutions build relationship potential"
    },
    {
      "speakerLabel": "spk_0",
      "start": 980.32,
      "end": 985.0400000000001,
      "text": " business opportunities also because you might meet potential partners, you might meet potential"
    },
    {
      "speakerLabel": "spk_0",
      "start": 985.0400000000001,
      "end": 990.08,
      "text": " customers and you might meet people that maybe you want to hire in your own company."
    },
    {
      "speakerLabel": "spk_0",
      "start": 990.08,
      "end": 995.2800000000001,
      "text": " So it's definitely worth for that alone that there is lots of value and I would recommend people looking for"
    },
    {
      "speakerLabel": "spk_0",
      "start": 995.28,
      "end": 999.6,
      "text": " that kind of opportunities to to consider re-invent next year."
    },
    {
      "speakerLabel": "spk_1",
      "start": 999.6,
      "end": 1004.3199999999999,
      "text": " Okay I think you've got a day or two left anything particular you're hoping for before the end that you haven't managed to do"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1004.3199999999999,
      "end": 1011.36,
      "text": " yet?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1011.36,
      "end": 1015.8399999999999,
      "text": " I think I'm just gonna focus on trying to meet a few more people there are other people that really want to meet and I know that they are here around and just haven't bumped into them and I"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1015.8399999999999,
      "end": 1021.52,
      "text": " really hope I can manage to do that and just have a chat and yeah just get that opinion and get to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1021.52,
      "end": 1026.56,
      "text": " know them in person a little bit more. Okay you haven't got people fatigue yet that's good."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1034.32,
      "end": 1038.72,
      "text": " Yeah I'm feeling very extroverted this week which is not my usual thing but it's working out pretty well."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1038.72,
      "end": 1044.24,
      "text": " Look it was good that we got a chance to catch up and share it with everybody. I know I'll be seeing you the day after you come back in person but you'll probably be too jet-lagged"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1044.24,
      "end": 1050.08,
      "text": " to talk about your experience then so it was nice to catch up."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1050.08,
      "end": 1055.52,
      "text": " Absolutely I hope I'm gonna be making some sense when we meet but I have lots of swag to share so be ready for that. "
    },
    {
      "speakerLabel": "spk_0",
      "start": 1055.52,
      "end": 1062.72,
      "text": " All right I think that brings us to the end of this episode I hope you enjoyed it and I hope"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1063.36,
      "end": 1068.48,
      "text": " if you have been to reinvent as well that you'd like to share your experience what are the things"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1068.48,
      "end": 1073.6,
      "text": " that you learn or unexpected things that happen to you I think it's gonna be awesome to just share"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1073.6,
      "end": 1078.3999999999999,
      "text": " all of that stuff and because I am a noob if you have been a noob as well and that was your first"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1078.4,
      "end": 1083.44,
      "text": " time again if there was anything that you didn't expect then you would suggest to other people to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1083.44,
      "end": 1088.24,
      "text": " avoid if they are going next year for the first time please share all of that information in the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1088.24,
      "end": 1093.76,
      "text": " comments and we'll be super happy to see that and share it with other people as well so thank you so"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1093.76,
      "end": 1097.68,
      "text": " much for being with us for another episode and we'll see you on the next one."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1108.4,
      "end": 1113.3600000000001,
      "text": " Bye!"
    }
  ]
}