{
  "speakers": {
    "spk_0": "Luciano",
    "spk_1": "Eoin"
  },
  "segments": [
    {
      "speakerLabel": "spk_0",
      "start": 0,
      "end": 4.88,
      "text": " At fourTheorem, the cloud consulting company where we work, one of the things that we get asked a lot,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 4.88,
      "end": 9.76,
      "text": " both from our potential customers, but also from our peers in the industry is how do we work? And"
    },
    {
      "speakerLabel": "spk_0",
      "start": 9.76,
      "end": 15.200000000000001,
      "text": " it seems like a simple question, but in reality, we can cover a bunch of different topics. Things"
    },
    {
      "speakerLabel": "spk_0",
      "start": 15.200000000000001,
      "end": 20,
      "text": " like what's our unique selling proposition and our target customer base? What the first engagement"
    },
    {
      "speakerLabel": "spk_0",
      "start": 20,
      "end": 24.32,
      "text": " with a potential customer is going to look like? Do we ever say no to potential customers? How do"
    },
    {
      "speakerLabel": "spk_0",
      "start": 24.32,
      "end": 28.96,
      "text": " we gather requirements? Why are software projects somewhat unique? How do we make plans, including"
    },
    {
      "speakerLabel": "spk_0",
      "start": 28.96,
      "end": 33.6,
      "text": " a desired architecture, estimates and success criteria? What do we do when the work starts and"
    },
    {
      "speakerLabel": "spk_0",
      "start": 33.6,
      "end": 37.84,
      "text": " how do we keep iterating over it? And what happens after the delivery? There are so many different"
    },
    {
      "speakerLabel": "spk_0",
      "start": 37.84,
      "end": 42.08,
      "text": " ways of working and methodologies to deliver software and cloud projects. We believe we have"
    },
    {
      "speakerLabel": "spk_0",
      "start": 42.08,
      "end": 46.480000000000004,
      "text": " our own unique way of doing that and today we want to share it with you. Hopefully by the end of this"
    },
    {
      "speakerLabel": "spk_0",
      "start": 46.480000000000004,
      "end": 50.88,
      "text": " episode, you will know what working with a cloud consulting like fourTheorem could look like and you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 50.88,
      "end": 55.28,
      "text": " might learn some strategies to make cloud projects possibly more successful. We will also digress a"
    },
    {
      "speakerLabel": "spk_0",
      "start": 55.28,
      "end": 59.92,
      "text": " little bit on the history of software practices, common misconceptions and what we believe should"
    },
    {
      "speakerLabel": "spk_0",
      "start": 59.92,
      "end": 63.760000000000005,
      "text": " be the right way to build software in the cloud. I hope this is going to be a fun ride. My name is"
    },
    {
      "speakerLabel": "spk_0",
      "start": 63.760000000000005,
      "end": 76.96000000000001,
      "text": " Luciano and I'm here with Eoin for another episode of AWS Bites podcast."
    },
    {
      "speakerLabel": "spk_0",
      "start": 76.96000000000001,
      "end": 81.76,
      "text": " AWS Bites is sponsored by fourTheorem, an AWS partner with plenty of experience delivering cloud projects to production. If you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 81.76,
      "end": 86.80000000000001,
      "text": " want to chat, reach out to us on social media or check out fourtheorem.com. All the links will be in"
    },
    {
      "speakerLabel": "spk_0",
      "start": 86.80000000000001,
      "end": 92.08000000000001,
      "text": " the show notes. So why don't we start by giving a little bit of an introduction to our audience,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 92.08000000000001,
      "end": 96.32000000000001,
      "text": " telling them what fourTheorem is, a little bit of the history, the people and some of our past projects made. "
    },
    {
      "speakerLabel": "spk_1",
      "start": 96.32000000000001,
      "end": 101.52000000000001,
      "text": "fourTheorem started in 2017, actually that's already a good few years."
    },
    {
      "speakerLabel": "spk_1",
      "start": 101.52000000000001,
      "end": 107.12,
      "text": " There are three founders in the company, myself, Peter and Fiona. And I guess the interesting thing about"
    },
    {
      "speakerLabel": "spk_1",
      "start": 107.12,
      "end": 111.28,
      "text": " us as the initial team is that we've all been through a lot of startups in the past,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 111.36,
      "end": 116.08,
      "text": " like our own startups, working in startups, bootstrapping, funding, building new products,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 116.08,
      "end": 120.24000000000001,
      "text": " getting them to market, succeeding and failing. That kind of helps shape, I think, our culture"
    },
    {
      "speakerLabel": "spk_1",
      "start": 120.24000000000001,
      "end": 124.72,
      "text": " and our mission a little bit. One of the founding principles is that we don't want to just become a"
    },
    {
      "speakerLabel": "spk_1",
      "start": 124.72,
      "end": 130.24,
      "text": " body shop. In the consulting world, it's pretty common. There's almost an inevitable gravitational"
    },
    {
      "speakerLabel": "spk_1",
      "start": 130.24,
      "end": 135.68,
      "text": " pull towards just throwing people at problems. And that's customers and consultants kind of"
    },
    {
      "speakerLabel": "spk_1",
      "start": 135.68,
      "end": 140.32,
      "text": " enable this behavior a little bit instinctively because when things get tough, people tend to just"
    },
    {
      "speakerLabel": "spk_1",
      "start": 140.32,
      "end": 144,
      "text": " say, okay, let's add resources. We don't have enough resources to solve our problems. So let's"
    },
    {
      "speakerLabel": "spk_1",
      "start": 144,
      "end": 148.64,
      "text": " just add more people. And this suits the business model of consultancies very well, because they're"
    },
    {
      "speakerLabel": "spk_1",
      "start": 148.64,
      "end": 153.84,
      "text": " just earning money based on time and materials on a day rate. So you just times the number of days"
    },
    {
      "speakerLabel": "spk_1",
      "start": 153.84,
      "end": 158.4,
      "text": " times the number of people, and you end up with a nice revenue at the end of it. But the problem"
    },
    {
      "speakerLabel": "spk_1",
      "start": 158.4,
      "end": 163.6,
      "text": " with that is that it doesn't really solve the core problems in general, the core engineering problems,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 163.6,
      "end": 167.68,
      "text": " cultural problems, etc. And we try to do it a little bit differently. So rather than just"
    },
    {
      "speakerLabel": "spk_1",
      "start": 167.68,
      "end": 172.8,
      "text": " adding people, we try to focus on the minimal number of people almost to do projects and"
    },
    {
      "speakerLabel": "spk_1",
      "start": 172.8,
      "end": 176.16,
      "text": " focusing on the quality of the people and the quality of the work. And so far, we've been able"
    },
    {
      "speakerLabel": "spk_1",
      "start": 176.16,
      "end": 181.76000000000002,
      "text": " to stick to that after almost seven years, six or seven years, which is good going so far, I think."
    },
    {
      "speakerLabel": "spk_1",
      "start": 181.76000000000002,
      "end": 186.72,
      "text": " And so we focus on a small team. We're deeply technical, I would say, but with a focus on"
    },
    {
      "speakerLabel": "spk_1",
      "start": 186.72,
      "end": 192.16,
      "text": " business because of, I guess, our previous startup experience, we optimize for delivering early and"
    },
    {
      "speakerLabel": "spk_1",
      "start": 192.16,
      "end": 197.84,
      "text": " often so continuous improvement where possible, we were bounded with a big focus on AI and data"
    },
    {
      "speakerLabel": "spk_1",
      "start": 197.84,
      "end": 202.88,
      "text": " science. That was one of the reasons myself and Peter wrote the book on, you know, using Amazon"
    },
    {
      "speakerLabel": "spk_1",
      "start": 202.88,
      "end": 207.92,
      "text": " machine learning services in the beginning, just kind of stake a claim to that as a direction of"
    },
    {
      "speakerLabel": "spk_1",
      "start": 207.92,
      "end": 212.8,
      "text": " travel. We're seeing that a lot now these days with Gen AI and other machine learning fields,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 212.8,
      "end": 217.6,
      "text": " data science, modern data architectures, production, those in a really optimal way"
    },
    {
      "speakerLabel": "spk_1",
      "start": 217.6,
      "end": 222.88,
      "text": " was going to be a big differentiator. And the rest is just focusing on more managed services. So"
    },
    {
      "speakerLabel": "spk_1",
      "start": 222.88,
      "end": 227.12,
      "text": " trying to remove a lot of the old school operations and maintenance that legacy systems"
    },
    {
      "speakerLabel": "spk_1",
      "start": 227.12,
      "end": 231.51999999999998,
      "text": " have seen a lot of in the past so that people can do more again with fewer people. We help people"
    },
    {
      "speakerLabel": "spk_1",
      "start": 231.51999999999998,
      "end": 235.76,
      "text": " of all different sizes. One of the nice things about working for fourTheorem, I guess, as an"
    },
    {
      "speakerLabel": "spk_1",
      "start": 235.76,
      "end": 241.12,
      "text": " engineer of any kind, or no matter who you are, is that we work with startups, but also larger"
    },
    {
      "speakerLabel": "spk_1",
      "start": 241.12,
      "end": 246,
      "text": " enterprises. That kind of has a, there's a virtuous cycle within that because when you're working with"
    },
    {
      "speakerLabel": "spk_1",
      "start": 246,
      "end": 250.4,
      "text": " startups, you tend to move very quickly, iterate quickly. And therefore, as an engineer, you learn"
    },
    {
      "speakerLabel": "spk_1",
      "start": 250.4,
      "end": 255.44,
      "text": " quickly and course correct quickly. In enterprises, the appetite for speed of innovation is less"
    },
    {
      "speakerLabel": "spk_1",
      "start": 255.44,
      "end": 260.24,
      "text": " because there's more risk associated with it. So the pace is naturally different. But when people"
    },
    {
      "speakerLabel": "spk_1",
      "start": 260.24,
      "end": 264.16,
      "text": " move from a startup environment into one of our enterprise environments, they bring that innovative"
    },
    {
      "speakerLabel": "spk_1",
      "start": 264.16,
      "end": 269.52,
      "text": " culture, lots of new learnings. And then when you move from an enterprise client onto a smaller"
    },
    {
      "speakerLabel": "spk_1",
      "start": 269.52,
      "end": 275.6,
      "text": " client, like a startup one, you kind of bring that rigor and process and compliance and governance"
    },
    {
      "speakerLabel": "spk_1",
      "start": 275.6,
      "end": 280.64000000000004,
      "text": " and all of that stuff that's more common in the enterprise world. So it kind of benefits our"
    },
    {
      "speakerLabel": "spk_1",
      "start": 280.64000000000004,
      "end": 285.76000000000005,
      "text": " clients in a virtuous cycle kind of way, but also our people. No matter what we're dealing with here,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 285.76000000000005,
      "end": 289.92,
      "text": " big customer, small customer, I think the first engagement is kind of similar. Do you want to take"
    },
    {
      "speakerLabel": "spk_1",
      "start": 289.92,
      "end": 296.16,
      "text": " us through the discovery part when we, okay, we've wooed a new client or we've been another client"
    },
    {
      "speakerLabel": "spk_1",
      "start": 296.16,
      "end": 300.48,
      "text": " has referred a friend of theirs in and we start talking to them for the first time. How does that work?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 300.48,
      "end": 304.32000000000005,
      "text": " Yeah, this kind of meeting is what we generally call a discovery session."
    },
    {
      "speakerLabel": "spk_0",
      "start": 304.96,
      "end": 310.24,
      "text": " And it's, there is no commitment from either parties to proceed with future work. So it's just an"
    },
    {
      "speakerLabel": "spk_0",
      "start": 310.24,
      "end": 315.36,
      "text": " exploration to try to figure out exactly what is the problem that we are discussing and whether we"
    },
    {
      "speakerLabel": "spk_0",
      "start": 315.36,
      "end": 320.88,
      "text": " can help solve that problem or not. It generally requires a mix of people. It could be a mix of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 320.88,
      "end": 325.03999999999996,
      "text": " business people and tech people. It really depends on the company and the type of project. But"
    },
    {
      "speakerLabel": "spk_0",
      "start": 325.03999999999996,
      "end": 328.8,
      "text": " generally speaking, you need people that understand the business and the problem,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 328.8,
      "end": 333.03999999999996,
      "text": " both from a technical perspective, but also from a business perspective. And of course, we are going"
    },
    {
      "speakerLabel": "spk_0",
      "start": 333.04,
      "end": 338.48,
      "text": " to bring our experience as well in that evaluation of the problem. But before doing that, we need to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 338.48,
      "end": 342.96000000000004,
      "text": " understand what the company looks like, what the problem space looks like, what is the project in"
    },
    {
      "speakerLabel": "spk_0",
      "start": 342.96000000000004,
      "end": 348,
      "text": " detail and how accurate is the understanding of the problem itself. Because sometimes companies"
    },
    {
      "speakerLabel": "spk_0",
      "start": 348,
      "end": 353.12,
      "text": " just have a very vague idea and then they haven't really developed a reason for why this idea is"
    },
    {
      "speakerLabel": "spk_0",
      "start": 353.12,
      "end": 357.12,
      "text": " important for the business because they haven't dug deep enough to really understand all the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 357.12,
      "end": 362.32000000000005,
      "text": " nuances of the project. So by asking very specific questions, we can try to figure out exactly what"
    },
    {
      "speakerLabel": "spk_0",
      "start": 362.32,
      "end": 366.96,
      "text": " is the level of understanding of that problem and whether the business really needs to address that problem or not."
    },
    {
      "speakerLabel": "spk_0",
      "start": 366.96,
      "end": 371.52,
      "text": " Or maybe they need to focus on something else. So I guess focusing on the business"
    },
    {
      "speakerLabel": "spk_0",
      "start": 371.52,
      "end": 375.84,
      "text": " challenges is a very important element to this phase of the conversation with the customer,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 375.84,
      "end": 379.76,
      "text": " where we are really trying to understand, do you need it for the business? Is this going to be an"
    },
    {
      "speakerLabel": "spk_0",
      "start": 379.76,
      "end": 384.48,
      "text": " enabler of some kind? Or maybe something you want to do for innovation, but there needs to be a"
    },
    {
      "speakerLabel": "spk_0",
      "start": 384.48,
      "end": 389.68,
      "text": " strong value. If the project is completed, the business is going to have a value pack. "
    },
    {
      "speakerLabel": "spk_0",
      "start": 389.68,
      "end": 394.08,
      "text": "So in a way, there needs to be some kind of investment and a return of investment as part of framing the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 394.08,
      "end": 398.32,
      "text": " conversation around the project. And of course, there will be also very specific technical"
    },
    {
      "speakerLabel": "spk_0",
      "start": 398.32,
      "end": 403.28000000000003,
      "text": " challenges that we will need to understand. For instance, if this is something that the business"
    },
    {
      "speakerLabel": "spk_0",
      "start": 403.28000000000003,
      "end": 408.8,
      "text": " is developing to compete with other competitors in the same industry, what the other competitors"
    },
    {
      "speakerLabel": "spk_0",
      "start": 408.8,
      "end": 413.44,
      "text": " are doing is also very interesting. What kind of characteristics their solution has? Do we need to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 413.44,
      "end": 417.44,
      "text": " be better? Do we need to be the same? Do we need to have something maybe similar but slightly"
    },
    {
      "speakerLabel": "spk_0",
      "start": 417.44,
      "end": 422.88,
      "text": " different? Maybe it needs to be more performant or simpler. So all these kind of details will"
    },
    {
      "speakerLabel": "spk_0",
      "start": 422.88,
      "end": 427.92,
      "text": " inform the type of architecture and will frame also from a technical perspective, what the problem"
    },
    {
      "speakerLabel": "spk_0",
      "start": 427.92,
      "end": 432.72,
      "text": " and the solution will look like. And also it's very important to understand, is there a tech"
    },
    {
      "speakerLabel": "spk_0",
      "start": 432.72,
      "end": 436.32,
      "text": " team? And this is actually something very interesting because when we work with startups,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 436.32,
      "end": 441.2,
      "text": " often there isn't even a tech team or if there is, it's very small. Sometimes it's just one person."
    },
    {
      "speakerLabel": "spk_0",
      "start": 441.2,
      "end": 446.08,
      "text": " Sometimes it's even the founder themselves are doing a little bit of business and a little bit"
    },
    {
      "speakerLabel": "spk_0",
      "start": 446.08,
      "end": 450,
      "text": " of tech and they just need more support. And other times they don't have a tech team at all."
    },
    {
      "speakerLabel": "spk_0",
      "start": 450,
      "end": 454.4,
      "text": " So we will become their tech team if we decide to help them. While when we work with bigger"
    },
    {
      "speakerLabel": "spk_0",
      "start": 454.4,
      "end": 458.8,
      "text": " enterprises, of course, often they have their own tech team. And it's important to understand"
    },
    {
      "speakerLabel": "spk_0",
      "start": 458.8,
      "end": 462.96,
      "text": " exactly what that tech team looks like because our engagement is going to be very different"
    },
    {
      "speakerLabel": "spk_0",
      "start": 462.96,
      "end": 467.68,
      "text": " depending if we are going to become an extension of an existing team or if we are going to become"
    },
    {
      "speakerLabel": "spk_0",
      "start": 467.68,
      "end": 473.03999999999996,
      "text": " that kind of interim team that is going to develop maybe an MVP to get the company to the point where"
    },
    {
      "speakerLabel": "spk_0",
      "start": 473.04,
      "end": 477.44,
      "text": " they have a point where they can basically keep growing the business and it makes sense to start"
    },
    {
      "speakerLabel": "spk_0",
      "start": 477.44,
      "end": 481.76000000000005,
      "text": " to invest in creating their own internal tech team. And then another interesting question that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 481.76000000000005,
      "end": 488.88,
      "text": " often comes up because our expertise and I guess our fame a little bit comes from being AWS experts."
    },
    {
      "speakerLabel": "spk_0",
      "start": 488.88,
      "end": 495.44,
      "text": " So sometimes not all the problems are problems that you should solve with AWS. So also evaluating,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 495.44,
      "end": 500.8,
      "text": " even if we are brought in as AWS experts, does that problem really require AWS?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 500.8,
      "end": 505.68,
      "text": " I think it's a very fair question to ask and assess very honestly. Don't just try to put AWS in there"
    },
    {
      "speakerLabel": "spk_0",
      "start": 505.68,
      "end": 510.40000000000003,
      "text": " just because you are the expert on it, but make sure that it's something that is really needed"
    },
    {
      "speakerLabel": "spk_0",
      "start": 510.40000000000003,
      "end": 514.24,
      "text": " that is going to make the difference for the success of that project. So basically,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 514.96,
      "end": 519.52,
      "text": " at this point, we want to come out of this meeting with two possible outcomes. It's generally like an"
    },
    {
      "speakerLabel": "spk_0",
      "start": 519.52,
      "end": 524.16,
      "text": " alpha day, so it's not super intense. And the idea is that at the end, we have a quite good"
    },
    {
      "speakerLabel": "spk_0",
      "start": 524.16,
      "end": 528.32,
      "text": " understanding of what's the problem space, the people involved, what everyone expects as success"
    },
    {
      "speakerLabel": "spk_0",
      "start": 528.32,
      "end": 532.88,
      "text": " criteria. So we might decide that we can help and that's kind of a positive outcome or that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 532.88,
      "end": 537.5200000000001,
      "text": " maybe we are not the right fit for that particular company and problem. And at that point, we just"
    },
    {
      "speakerLabel": "spk_0",
      "start": 537.5200000000001,
      "end": 541.7600000000001,
      "text": " say, okay, this is not going to work. Hopefully, you got some value anyway with all this conversation"
    },
    {
      "speakerLabel": "spk_0",
      "start": 541.7600000000001,
      "end": 545.5200000000001,
      "text": " and try to describe it and nail down the requirements of the project. But if we decide"
    },
    {
      "speakerLabel": "spk_0",
      "start": 545.5200000000001,
      "end": 550.72,
      "text": " to start to help the company, what we are going to do is create a proposal. And that proposal is"
    },
    {
      "speakerLabel": "spk_0",
      "start": 550.72,
      "end": 554.5600000000001,
      "text": " effectively a document that says this is our understanding of the problem and this is how we"
    },
    {
      "speakerLabel": "spk_0",
      "start": 554.56,
      "end": 560.4,
      "text": " can help you out to develop that solution further. And there were also other interesting"
    },
    {
      "speakerLabel": "spk_0",
      "start": 560.4,
      "end": 566.3199999999999,
      "text": " cases that happened to us in the past where we decided not to be a good fit for that company"
    },
    {
      "speakerLabel": "spk_0",
      "start": 566.3199999999999,
      "end": 571.68,
      "text": " because we didn't really believe on the structure, on the framing of that particular project."
    },
    {
      "speakerLabel": "spk_0",
      "start": 571.68,
      "end": 575.76,
      "text": " Sometimes we realized that a founder is really early in the implementation. Maybe they need to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 575.76,
      "end": 580.3199999999999,
      "text": " do a little bit more market research. So even though we could build a product for them, that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 580.32,
      "end": 585.36,
      "text": " product is still likely to fail just because there isn't enough research."
    },
    {
      "speakerLabel": "spk_0",
      "start": 585.36,
      "end": 590.32,
      "text": " So we feel like it's... We are obliged to say, well, make sure you really understand the problem sets before you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 590.32,
      "end": 594.8000000000001,
      "text": " invest money into this project and then come back to us later and we can reassess together whether"
    },
    {
      "speakerLabel": "spk_0",
      "start": 594.8000000000001,
      "end": 599.36,
      "text": " we feel we are going to be more likely to be successful after all of that. So I think it's"
    },
    {
      "speakerLabel": "spk_0",
      "start": 599.36,
      "end": 603.44,
      "text": " also important to call out that you need to be a little bit honest that way as a consultant,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 603.44,
      "end": 607.84,
      "text": " because we feel that's part of our job. If we have that expertise where we can give a useful"
    },
    {
      "speakerLabel": "spk_0",
      "start": 607.84,
      "end": 612.32,
      "text": " piece of advice to our potential customers, even though that means losing business in the short"
    },
    {
      "speakerLabel": "spk_0",
      "start": 612.32,
      "end": 617.2800000000001,
      "text": " term, I think that can be much more valuable in the longer term. Now, I guess another question"
    },
    {
      "speakerLabel": "spk_0",
      "start": 617.2800000000001,
      "end": 622.24,
      "text": " that comes very often when we have this kind of conversation and maybe when we present a plan to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 622.24,
      "end": 627.84,
      "text": " our potential customers is this looks very different from what I expected. I was expecting"
    },
    {
      "speakerLabel": "spk_0",
      "start": 627.84,
      "end": 633.12,
      "text": " maybe, I don't know, lots of planning and then maybe a very clear roadmap going forward."
    },
    {
      "speakerLabel": "spk_0",
      "start": 633.12,
      "end": 637.44,
      "text": " And then you give me a very precise deadline where everything is done. But then when we present our"
    },
    {
      "speakerLabel": "spk_0",
      "start": 637.44,
      "end": 642,
      "text": " plan, it might look very different from that expectation. So I think it's worth spending a"
    },
    {
      "speakerLabel": "spk_0",
      "start": 642,
      "end": 647.36,
      "text": " little bit of time discussing our opinion and how do we perceive the history of software development"
    },
    {
      "speakerLabel": "spk_0",
      "start": 647.36,
      "end": 651.44,
      "text": " and why we think that there is a large misconception, especially from people that are"
    },
    {
      "speakerLabel": "spk_0",
      "start": 651.44,
      "end": 655.7600000000001,
      "text": " not really into the software industry or now software should be built."
    },
    {
      "speakerLabel": "spk_1",
      "start": 655.7600000000001,
      "end": 660.6400000000001,
      "text": " It's probably worth reminding everybody from time to time about how software projects are fundamentally different in"
    },
    {
      "speakerLabel": "spk_1",
      "start": 660.6400000000001,
      "end": 665.0400000000001,
      "text": " a few different ways to other projects. And that could be a non-technical founder, but also a"
    },
    {
      "speakerLabel": "spk_1",
      "start": 665.04,
      "end": 670.4,
      "text": " business leader in any company. But I think we also forget and we often have a false sense of"
    },
    {
      "speakerLabel": "spk_1",
      "start": 670.4,
      "end": 676.16,
      "text": " security around times and deadlines and budget. We kind of forget that software is a relatively"
    },
    {
      "speakerLabel": "spk_1",
      "start": 676.16,
      "end": 681.1999999999999,
      "text": " new field with only about 70 years of history and a lot of change has happened in that time."
    },
    {
      "speakerLabel": "spk_1",
      "start": 681.1999999999999,
      "end": 686.7199999999999,
      "text": " There's a bit of a bad reputation around software as well because of lots of horror stories around"
    },
    {
      "speakerLabel": "spk_1",
      "start": 686.7199999999999,
      "end": 694.24,
      "text": " scope creep, bad estimates, delays, significant cost or time overruns, quality expectations,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 694.24,
      "end": 700.16,
      "text": " being poor and then from a team perspective, burnout, death march projects. So those things"
    },
    {
      "speakerLabel": "spk_1",
      "start": 700.16,
      "end": 705.76,
      "text": " are quite common, right? It is common, let's face it, for software projects to ultimately fail and"
    },
    {
      "speakerLabel": "spk_1",
      "start": 705.76,
      "end": 710.96,
      "text": " we want to avoid that. So we have a strategy to make sure that we do avoid that. And we just think"
    },
    {
      "speakerLabel": "spk_1",
      "start": 710.96,
      "end": 715.12,
      "text": " that it all comes down to the fact that software projects are inherently just more complicated,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 715.12,
      "end": 719.6,
      "text": " more complex than people might think, especially when you compare it to maybe more of a traditional"
    },
    {
      "speakerLabel": "spk_1",
      "start": 719.6800000000001,
      "end": 725.6800000000001,
      "text": " engineering field like construction engineering or mechanical engineering. So I think one of the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 725.6800000000001,
      "end": 730.64,
      "text": " analogies we've been using recently is if you compare what it takes to build a mobile website"
    },
    {
      "speakerLabel": "spk_1",
      "start": 730.64,
      "end": 735.12,
      "text": " versus what it takes to engineer a coffee grinder. And if you can imagine more of a mechanical"
    },
    {
      "speakerLabel": "spk_1",
      "start": 735.12,
      "end": 740.5600000000001,
      "text": " engineering example and let's look at it from a few different angles. So in terms of specification,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 740.5600000000001,
      "end": 745.0400000000001,
      "text": " if you're building a device like a coffee grinder, generally you have a clear set of functions. You"
    },
    {
      "speakerLabel": "spk_1",
      "start": 745.0400000000001,
      "end": 748.64,
      "text": " want to grind coffee to various sizes. The requirements are pretty clear and they don't"
    },
    {
      "speakerLabel": "spk_1",
      "start": 748.64,
      "end": 752.72,
      "text": " usually change once the design is finished. Whereas with software, like you're building a"
    },
    {
      "speakerLabel": "spk_1",
      "start": 752.72,
      "end": 757.1999999999999,
      "text": " mobile web website, even a simple one, the requirements are always dynamic. It needs to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 757.1999999999999,
      "end": 761.68,
      "text": " adapt to a variety of different user needs and expectations, and those change rapidly."
    },
    {
      "speakerLabel": "spk_1",
      "start": 761.68,
      "end": 766.08,
      "text": " User expectations are always changing and user behavior is changing. You might need to update"
    },
    {
      "speakerLabel": "spk_1",
      "start": 766.08,
      "end": 770.96,
      "text": " the website frequently to meet new user demands and expectations, or even just to stay ahead of"
    },
    {
      "speakerLabel": "spk_1",
      "start": 770.96,
      "end": 775.52,
      "text": " competitors. The process of understanding requirements, communicating them clearly,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 775.52,
      "end": 781.4399999999999,
      "text": " and making them a reality in software is really complex. And it's actually one of the major areas"
    },
    {
      "speakerLabel": "spk_1",
      "start": 781.4399999999999,
      "end": 787.6,
      "text": " where potentially great projects can falter at the very beginning. And when you get your first"
    },
    {
      "speakerLabel": "spk_1",
      "start": 787.6,
      "end": 791.76,
      "text": " delivery, then looking at the environment in which these two products operate, you know,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 791.76,
      "end": 795.52,
      "text": " coffee grinder will work in a kitchen and it'll have a stable power supply. The environment is"
    },
    {
      "speakerLabel": "spk_1",
      "start": 795.52,
      "end": 799.68,
      "text": " generally controlled and predictable. Once you ship software, it must function across lots of"
    },
    {
      "speakerLabel": "spk_1",
      "start": 799.68,
      "end": 804.8,
      "text": " different devices, smartphones, tablets, PCs, and different screen sizes, operating systems,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 804.8,
      "end": 809.5999999999999,
      "text": " browsers, which all constantly change, specs change, they have continuous updates. So it's"
    },
    {
      "speakerLabel": "spk_1",
      "start": 809.5999999999999,
      "end": 813.76,
      "text": " a very different context from that point of view. And then users, when they use a coffee grinder,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 813.76,
      "end": 817.3599999999999,
      "text": " generally they put in the beans, press the button, empty it out, hopefully they clean it once in a"
    },
    {
      "speakerLabel": "spk_1",
      "start": 817.3599999999999,
      "end": 824,
      "text": " while. With software like a mobile website, it has to function across, I suppose, contexts where"
    },
    {
      "speakerLabel": "spk_1",
      "start": 824,
      "end": 828.88,
      "text": " you didn't anticipate. Users do unexpected things all the time. Simple things like they put a"
    },
    {
      "speakerLabel": "spk_1",
      "start": 828.88,
      "end": 832.3199999999999,
      "text": " special character in the first name field that you didn't think of and didn't expect. And then"
    },
    {
      "speakerLabel": "spk_1",
      "start": 832.32,
      "end": 836.88,
      "text": " at the other end of the scale, you have malicious users, actors who are trying to damage the system,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 836.88,
      "end": 841.6800000000001,
      "text": " steal data, hack the system. There's so many variables in terms of user actions."
    },
    {
      "speakerLabel": "spk_1",
      "start": 841.6800000000001,
      "end": 846.48,
      "text": " And I think as well, the constraints are quite different. With your physical device, the design and"
    },
    {
      "speakerLabel": "spk_1",
      "start": 846.48,
      "end": 850.24,
      "text": " functionality, ultimately the constraints come down to the laws of physics, which I think are"
    },
    {
      "speakerLabel": "spk_1",
      "start": 850.24,
      "end": 854.88,
      "text": " generally well understood and reasonably stable over time. In software, you're building a mobile"
    },
    {
      "speakerLabel": "spk_1",
      "start": 854.88,
      "end": 860.08,
      "text": " website, the constraints are constantly evolving, technologies are evolving, practices are changing,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 860.08,
      "end": 864.48,
      "text": " user behaviors are changing. What's cool and trendy today might be obsolete in just a couple"
    },
    {
      "speakerLabel": "spk_1",
      "start": 864.48,
      "end": 869.44,
      "text": " of years. Security context is changing very frequently. So you need to constantly stay up to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 869.44,
      "end": 874.8000000000001,
      "text": " date, stay secure and adapt. And that's why software projects are always kind of living, breathing things."
    },
    {
      "speakerLabel": "spk_1",
      "start": 874.8000000000001,
      "end": 878.96,
      "text": " They're never really complete. If you leave software, we talked about this, I think in the last"
    },
    {
      "speakerLabel": "spk_1",
      "start": 878.96,
      "end": 882.96,
      "text": " episode or the previous one, you can't just leave software alone and expect it to come back to it in"
    },
    {
      "speakerLabel": "spk_1",
      "start": 882.96,
      "end": 886.96,
      "text": " two years and for everything to work because the whole environment, the technology landscape has"
    },
    {
      "speakerLabel": "spk_1",
      "start": 886.96,
      "end": 890.96,
      "text": " changed. So it's a living, breathing thing. You need a high performing team of domain experts,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 890.96,
      "end": 896.1600000000001,
      "text": " software engineers working together to tackle this, right? And to address the different nature"
    },
    {
      "speakerLabel": "spk_1",
      "start": 896.1600000000001,
      "end": 900.5600000000001,
      "text": " of software projects, to distill it all into prioritized tasks and deliver on the tasks in a"
    },
    {
      "speakerLabel": "spk_1",
      "start": 900.5600000000001,
      "end": 906,
      "text": " predictable way. So this is, I suppose, worth reminding ourselves because when we talk about"
    },
    {
      "speakerLabel": "spk_1",
      "start": 906,
      "end": 910.96,
      "text": " how we do things and our process and everything, it's really to address the extraordinary,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 910.96,
      "end": 915.0400000000001,
      "text": " exponentially growing number of variables that you have to deal with in software projects that"
    },
    {
      "speakerLabel": "spk_1",
      "start": 915.04,
      "end": 920.64,
      "text": " you don't have in other environments where you can use engineering principles, deterministic"
    },
    {
      "speakerLabel": "spk_1",
      "start": 920.64,
      "end": 925.36,
      "text": " calculations, and then come up with a Gantt chart and be reasonably confident that you'll meet the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 925.36,
      "end": 931.4399999999999,
      "text": " delivery. Software has to be much more adaptable and much more agile. How do we then manage software"
    },
    {
      "speakerLabel": "spk_1",
      "start": 931.4399999999999,
      "end": 936.7199999999999,
      "text": " projects? Do you want to share some of our process?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 936.7199999999999,
      "end": 941.28,
      "text": " Yeah, I think speaking of the Gantt chart example, another thing that comes to mind is the waterfall approach, which is generally the idea that you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 941.28,
      "end": 945.36,
      "text": " have a specification, you do some kind of analysis, from that you do some kind of design,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 945.36,
      "end": 949.76,
      "text": " then you move to an implementation phase, then you have some kind of ready product that you just"
    },
    {
      "speakerLabel": "spk_0",
      "start": 949.76,
      "end": 954,
      "text": " need to test a little bit before you can confidently release and you're done. So it's"
    },
    {
      "speakerLabel": "spk_0",
      "start": 954,
      "end": 958.8,
      "text": " like step by step from beginning to end, it's kind of a straight process and it's called waterfall"
    },
    {
      "speakerLabel": "spk_0",
      "start": 958.8,
      "end": 963.6,
      "text": " because generally it's represented with this kind of diagram where things are moving down to the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 963.6,
      "end": 968.4,
      "text": " completion phase. And this approach is really interesting because I think there is this"
    },
    {
      "speakerLabel": "spk_0",
      "start": 968.4,
      "end": 973.52,
      "text": " misconception that most people believe this is how anything is built, including software,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 973.52,
      "end": 977.92,
      "text": " but you could argue that this model is not really something you can use. In reality,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 977.92,
      "end": 981.6,
      "text": " it's kind of a conceptual model to understand what are different phases of a project,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 981.6,
      "end": 986.24,
      "text": " but this is not really how you move things from zero to completion. It's not like one single"
    },
    {
      "speakerLabel": "spk_0",
      "start": 986.24,
      "end": 991.76,
      "text": " iteration and the phases are very distinct. And even if you think about building physical"
    },
    {
      "speakerLabel": "spk_0",
      "start": 991.76,
      "end": 996.64,
      "text": " products, if you start to compare this model with the agile methodologies that we are going to talk"
    },
    {
      "speakerLabel": "spk_0",
      "start": 996.72,
      "end": 1000.88,
      "text": " a little bit more about in the second part of this episode, you can see that the agile"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1000.88,
      "end": 1004.88,
      "text": " methodologies actually started in more traditional manufacturers, not something that was invented in"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1004.88,
      "end": 1010.16,
      "text": " software, it's something that actually came out from Toyota. So even in traditional manufacturing,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1010.16,
      "end": 1015.68,
      "text": " there is a clear need that you need to have a more dynamic process where you can adapt to change,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1015.68,
      "end": 1021.2,
      "text": " you can adapt to things you didn't expect, you can adapt to new requirements and try to minimize"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1021.2,
      "end": 1025.76,
      "text": " waste at every step of the process. So it is really interesting to see how even in traditional"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1025.76,
      "end": 1030.96,
      "text": " manufacturing, this kind of conceptual model, it's good to understand the basics of the different"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1030.96,
      "end": 1035.28,
      "text": " phases of a project, but it's not realistic. This is not really how you move a project forward."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1035.28,
      "end": 1040,
      "text": " So I think it's very important for us to try to demystify, especially with some customers that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1040,
      "end": 1044.48,
      "text": " maybe are not so experienced with the way of building projects or software projects specifically,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1044.48,
      "end": 1050,
      "text": " that we need to take a different approach and an approach that needs to be more agile. So what do"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1050,
      "end": 1056.72,
      "text": " we mean now by agile? It's not really easy to define what agile is. There are many different"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1056.72,
      "end": 1062.48,
      "text": " definitions, many different interpretations of different methodologies. And I think ultimately"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1062.48,
      "end": 1066.64,
      "text": " everyone has a slightly different way of doing agile. So it's kind of a set of principles,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1066.64,
      "end": 1070.96,
      "text": " and then eventually everyone comes up with their own framework for taking some of these principles"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1070.96,
      "end": 1077.44,
      "text": " and adapting to their way of working. So our idea of agile is building things in small iterations"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1077.44,
      "end": 1081.76,
      "text": " and have frequent chances to reassess the scope and the landscape. And if there is something that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1081.76,
      "end": 1087.52,
      "text": " changed, you have the time to course correct things. It's never too late to do a change"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1087.52,
      "end": 1091.44,
      "text": " because you are trying to reassess things frequently enough that even if you took"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1091.44,
      "end": 1096.0800000000002,
      "text": " the wrong turn somewhere, you are still in time to come back and try a different approach."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1096.96,
      "end": 1100,
      "text": " And this is one of the main reasons why the waterfall approach doesn't work,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1100,
      "end": 1104.8,
      "text": " because if you spent a huge amount of time building a project and invested tons of money,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1104.8,
      "end": 1109.2,
      "text": " and then you come at the end phase, and when you are there, everything changed in the landscape,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1109.2,
      "end": 1114,
      "text": " you're understanding of the problem, what the customers would expect, you just wasted tons of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1114,
      "end": 1118.3999999999999,
      "text": " money and tons of time. And going back basically means let's start from scratch and let's redesign"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1118.3999999999999,
      "end": 1123.44,
      "text": " again. And then let's hope that next time things don't move as fast as they do, as they did. But"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1123.44,
      "end": 1127.04,
      "text": " we know that most likely they're going to move again. So the only way really is to find a process"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1127.04,
      "end": 1131.36,
      "text": " that's flexible enough that allows you to understand what's going on, understand if you are"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1131.36,
      "end": 1136,
      "text": " on the right path, and if you need to change something, have the time to do that as soon as"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1136,
      "end": 1142,
      "text": " possible. So the way that you can do that is using a process that is divided in small chunks of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1142.8,
      "end": 1147.52,
      "text": " iterations, and we generally call them sprints. A sprint can be a period that can vary between"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1147.52,
      "end": 1152.24,
      "text": " one week and four weeks, typically. And again, this is just arbitrary amounts of times, you just need"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1152.24,
      "end": 1157.84,
      "text": " to pick one size. And ideally, it should be small enough that gives you frequent chances to reassess,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1157.84,
      "end": 1163.9199999999998,
      "text": " but also big enough that gives you enough time to have a small objective in mind that you can"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1163.9199999999998,
      "end": 1167.9199999999998,
      "text": " complete during that timeframe. So it doesn't make sense to have a sprint of one hour because"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1167.9199999999998,
      "end": 1172,
      "text": " realistically you're not going to have time to do anything meaningful in one hour. But if you start"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1172,
      "end": 1175.76,
      "text": " to think, for instance, about two weeks, you can probably achieve something useful for the business"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1175.76,
      "end": 1182.8799999999999,
      "text": " in two weeks. I think the other side effect of this approach is that it reduces the risk of experimentation. "
    },
    {
      "speakerLabel": "spk_0",
      "start": 1182.8799999999999,
      "end": 1187.12,
      "text": " Because if you are trying to do something and you're not really sure"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1187.12,
      "end": 1192.1599999999999,
      "text": " whether a possible solution is actually going to be the right one, it is less risky to actually try"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1192.1599999999999,
      "end": 1197.28,
      "text": " it out. Just say, okay, we are going to spend one sprint maybe trying the solution. It might not work,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1197.28,
      "end": 1202.7199999999998,
      "text": " but the worst outcome that can happen is that it doesn't work and we learned new stuff. And now we"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1202.7199999999998,
      "end": 1206.9599999999998,
      "text": " spend two weeks and we can consider those two weeks of learning, even if the product didn't"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1206.9599999999998,
      "end": 1212.2399999999998,
      "text": " really evolve. But our understanding of the problem space evolved and the next sprint, we can actually"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1212.2399999999998,
      "end": 1216.7199999999998,
      "text": " use our time even better. And probably ultimately that's going to allow us to be even more efficient"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1216.72,
      "end": 1221.44,
      "text": " in the long term because we had the chance to try a number of different things and we understood"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1221.44,
      "end": 1225.52,
      "text": " much better what works and what doesn't work. So I think it's also important to mention that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1225.52,
      "end": 1230.08,
      "text": " this process to work needs everyone to be involved and to understand the project."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1230.08,
      "end": 1234.32,
      "text": " It's not just something that technical people do in isolation. It's something that requires all the different"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1234.32,
      "end": 1239.04,
      "text": " stakeholders to really understand the process and be fully involved in all the different phases of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1239.04,
      "end": 1244,
      "text": " the process. For instance, it's very important that everyone understands things are flexible"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1244,
      "end": 1248.24,
      "text": " and iterative. We don't have all the answers straight away. We will find out the answers as"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1248.24,
      "end": 1252.56,
      "text": " we go and we will figure out what are the most important questions to ask at every single step."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1252.56,
      "end": 1257.6,
      "text": " And there is a mindset of continuous improvement in that sense, again, because you are knowledge"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1257.6,
      "end": 1262.08,
      "text": " that you are starting from a stage and you are trying to get better and better as you go doing"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1262.08,
      "end": 1266.16,
      "text": " this kind of an iterative approach. It requires great communication skills."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1266.16,
      "end": 1273.84,
      "text": " This is actually one of the common problems that we generally see that if people are not sharing all their learning,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1274.24,
      "end": 1279.04,
      "text": " they cannot communicate effectively, what are the challenges, what are the expectations,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1279.04,
      "end": 1282.8,
      "text": " that's where you start to see problems and this process breaks down a little bit."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1282.8,
      "end": 1288.24,
      "text": " So it's very important to make sure that everyone is confident in terms of discussing how they"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1288.24,
      "end": 1293.04,
      "text": " understand the project, what is their progress, if they have any blocker and what are their"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1293.04,
      "end": 1297.28,
      "text": " expectations maybe at the end of a sprint. And this is something you need to keep doing as much"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1297.28,
      "end": 1300.8799999999999,
      "text": " as possible. And sometimes other communicating is probably a little bit better than under"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1300.88,
      "end": 1305.2800000000002,
      "text": " communicating in that sense. And you can have tools that can help you in that sense."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1305.2800000000002,
      "end": 1310.96,
      "text": " For instance, you can have tools that will help you to make sure that there is space during a"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1310.96,
      "end": 1315.44,
      "text": " sprint to have this kind of useful conversations. Sometimes we talk about retrospectives, which is"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1315.44,
      "end": 1319.0400000000002,
      "text": " something that you can do at the end of a sprint to try to have an open conversation of what you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1319.0400000000002,
      "end": 1323.68,
      "text": " think went well and what you think didn't go so well and maybe you want to try to improve in the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1323.68,
      "end": 1328.72,
      "text": " next sprint. Or you can have, for instance, tools that try to measure the output, for instance,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1328.72,
      "end": 1333.52,
      "text": " in terms of the quality of what you deliver, in terms of how many tasks did you actually"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1333.52,
      "end": 1338.08,
      "text": " complete compared to the ones that you wanted to complete during the sprint. And all of that stuff,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1338.08,
      "end": 1343.84,
      "text": " it doesn't mean that you deliver poorly. It means that maybe your understanding of the problem space"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1343.84,
      "end": 1347.84,
      "text": " wasn't as accurate as you thought. And then in the next sprint, you can take everything"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1347.84,
      "end": 1352.16,
      "text": " into consideration to try to plan a little bit better for the next sprint. Now, talking about"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1352.16,
      "end": 1357.1200000000001,
      "text": " measuring the output of a project, I think there is a common complaint in the industry"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1357.12,
      "end": 1362.2399999999998,
      "text": " that developers are not really productive. And there are a number of studies that often come up"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1362.2399999999998,
      "end": 1367.76,
      "text": " and they all make very interesting claims, like a developer, a developer doesn't write more than"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1367.76,
      "end": 1373.84,
      "text": " 100 lines of code per day, or it doesn't spend a certain number of hours coding per day. So I guess"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1373.84,
      "end": 1377.36,
      "text": " what do you think about that? Is it really important to measure the output of developers"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1377.36,
      "end": 1382.8,
      "text": " that way? Or is there more that developers do in their daily job?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1382.8,
      "end": 1388.3999999999999,
      "text": " Well, when you learn that code is not just a measure of productivity, but it's also like an, it's an asset, right? When you build"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1388.3999999999999,
      "end": 1394,
      "text": " a product, you want the work that your team are creating to be an asset that's valuable and"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1394,
      "end": 1398.08,
      "text": " growing. But at the same time, code is a liability. I think we hear this expression quite a lot,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1398.08,
      "end": 1401.52,
      "text": " which means that every time you have a line of code, it's something you must maintain into the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1401.52,
      "end": 1405.76,
      "text": " future, every line. And every line of code is a line that can have a bug. So what you want to do"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1405.76,
      "end": 1410.96,
      "text": " is get the balance right, maximizing the benefit in terms of business outcome, by minimizing the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1410.96,
      "end": 1415.28,
      "text": " amount of code it takes to create that. And there's lots of ways we do that. We talked about"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1415.28,
      "end": 1420.88,
      "text": " one of our principles being leveraging experts like AWS as partners to manage our infrastructure,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1420.88,
      "end": 1425.44,
      "text": " so that we have to write less code. And this is a constant journey, trying to remove the code you"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1425.44,
      "end": 1430.32,
      "text": " have and offload things that aren't really specific to your business. We talk about this"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1430.32,
      "end": 1435.28,
      "text": " quite a lot. So let's think about software development. And we've seen some studies that say"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1435.28,
      "end": 1439.52,
      "text": " an average software developer, if you have an eight hour working day, they're spending anything"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1439.52,
      "end": 1444.8,
      "text": " from one hour to four hours coding. And it might seem like you're unproductive. But when you look"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1444.8,
      "end": 1449.92,
      "text": " at what the function of a software developer is, it doesn't seem so bad at all. Because a software"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1449.92,
      "end": 1454.4,
      "text": " developer, you don't generally want to be coding all the time. It's a bit of a red flag if they are,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1454.4,
      "end": 1459.68,
      "text": " because it probably means they're a little bit isolated from the larger mission."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1459.68,
      "end": 1464.24,
      "text": " If we look at the all of the activities of a developer, they need to understand the customer and the business"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1464.24,
      "end": 1468.08,
      "text": " need, they need to be constantly honing their skills, because the landscape is changing quickly."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1468.08,
      "end": 1471.9199999999998,
      "text": " So they need to be learning the right tools to do the job and ensuring that the approach is optimal."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1471.9199999999998,
      "end": 1476.32,
      "text": " No matter how experienced a developer you are, learning is a daily part of the job,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1476.32,
      "end": 1481.36,
      "text": " that's never going to change. Then you have things like analyzing bugs and constraints in existing"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1481.36,
      "end": 1486.08,
      "text": " systems, often systems that were implemented by others who aren't available anymore. And this is"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1486.08,
      "end": 1491.12,
      "text": " a really advanced skill almost in software development, which is understanding software"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1491.12,
      "end": 1495.9199999999998,
      "text": " that you don't have full control over. It's a lot easier to start from scratch with a blank canvas"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1495.92,
      "end": 1499.68,
      "text": " all the time. A lot of companies out there that will do that, but there aren't a lot that will"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1499.68,
      "end": 1503.92,
      "text": " kind of understand the value in your existing systems that are already working pretty well"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1503.92,
      "end": 1509.2,
      "text": " and generating revenue. Then you have things like updating stakeholders, communicating with them so"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1509.2,
      "end": 1513.92,
      "text": " that everybody's on the same page, sharing your learnings and ideas with peers, learning from your"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1513.92,
      "end": 1520,
      "text": " peers, collaborating with maybe QA staff, user experience, designers, project managers, and lots"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1520,
      "end": 1524.16,
      "text": " of others. Then you have just other collaborative activities like creating, reviewing, and updating"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1524.16,
      "end": 1529.0400000000002,
      "text": " documentation. This is pretty important if you don't want lots of problems in the future,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1529.0400000000002,
      "end": 1534.48,
      "text": " peer reviewing code, and then writing and even rewriting code tests infrastructure. So the coding"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1534.48,
      "end": 1537.92,
      "text": " part almost comes last on the list once you've got everything else right. That's the way it"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1537.92,
      "end": 1542,
      "text": " should be, getting the balance right between the focused implementation time, you know, this kind"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1542,
      "end": 1547.28,
      "text": " of stereotypical view of a developer, headphones on, furiously coding away. That's important,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1547.28,
      "end": 1551.68,
      "text": " right? But it only makes sense if you have the right context to set, the mission is clear,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1551.68,
      "end": 1556.48,
      "text": " and you've communicated with everybody else, because otherwise you could be in isolation,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1556.48,
      "end": 1560.96,
      "text": " furiously coding in the completely wrong direction, something that will have to be rewritten or thrown"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1560.96,
      "end": 1566.0800000000002,
      "text": " away later. That's not good. So the other thing is too many meetings, interruptions can kill momentum."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1566.0800000000002,
      "end": 1569.68,
      "text": " So you have to be conscious about these things and try and get the balance right between focus time"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1569.68,
      "end": 1573.8400000000001,
      "text": " and collaboration. Do a little communication will lead to a lot of misunderstandings, rework,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1573.8400000000001,
      "end": 1578.88,
      "text": " huge amounts of waste. So overall, I would say the amount of code produced, it's not a good measure"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1578.88,
      "end": 1584.48,
      "text": " of productivity at all. That's a mistake. And it can lead to over engineering and creation of large"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1584.48,
      "end": 1588.96,
      "text": " amounts of technical debt. I think, generally, developers understand the concept of technical"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1588.96,
      "end": 1593.68,
      "text": " debt for other stakeholders, it's a little bit less tangible. And I think it can be thought about"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1593.68,
      "end": 1598.72,
      "text": " as any other kind of debt, really, if you imagine that on your journey to developing a system of"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1598.72,
      "end": 1603.68,
      "text": " value, every time you might need to make a trade off between getting something done quickly, like"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1603.68,
      "end": 1608.24,
      "text": " getting it implemented today, versus getting it done, right, maybe you have to wait for some"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1608.24,
      "end": 1613.04,
      "text": " external dependency, maybe you have to do some extra research, or you just have to put a lot of"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1613.04,
      "end": 1617.76,
      "text": " rework into the system in order to get it done right in a way that's really stable for the future."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1617.76,
      "end": 1621.84,
      "text": " Sometimes you have to make a trade off and say, okay, let's just take some sort of shortcut today,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1621.84,
      "end": 1625.84,
      "text": " that's essentially borrowing some technical debt, you're borrowing some future time,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1626.72,
      "end": 1631.6,
      "text": " really for the for right now to get something done. And a degree of debt is inevitable, technical debt"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1631.6,
      "end": 1636.4,
      "text": " is inevitable. But if you accumulate it without paying it off, just like any other kind of debt,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1636.4,
      "end": 1641.2,
      "text": " you will eventually become technically bankrupt, essentially, you'll end up with a system that is"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1641.2,
      "end": 1646.0800000000002,
      "text": " unmaintainable, you can't add features to, you're constantly fighting bugs on, and that will have"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1646.0800000000002,
      "end": 1651.92,
      "text": " enormous cost and productivity impacts down the line."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1651.92,
      "end": 1655.68,
      "text": " Maybe we before we go on to our sprints, and all that process, we can summarize all this by saying that effective software development comes"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1655.68,
      "end": 1660.64,
      "text": " from having skilled experts and domain experts from a technical perspective, and a domain"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1660.64,
      "end": 1664.88,
      "text": " perspective, a whole team approach where everybody is working together, you have clear mission and"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1664.88,
      "end": 1669.7600000000002,
      "text": " success criteria. And you can get metrics from those criteria, then you've got your requirements,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1669.7600000000002,
      "end": 1673.92,
      "text": " well defined, broken down into small pieces that can be delivered in fast iterations. And then"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1673.92,
      "end": 1679.1200000000001,
      "text": " you've got clear communication feedback mechanisms without any gatekeeping or silos between the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1679.1200000000001,
      "end": 1683.7600000000002,
      "text": " customer and those tasked with delivering the product. Lastly, I think permission to fail,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1683.7600000000002,
      "end": 1688.72,
      "text": " learn and improve is really critical. You can't have agile processes with continuous improvement,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1688.72,
      "end": 1693.2,
      "text": " unless you have a very dynamic organization that has a permission to fail, learn from those"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1693.2,
      "end": 1697.1200000000001,
      "text": " failures and improve. And that's where you really get the best outcomes. So with that in mind,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1697.1200000000001,
      "end": 1703.28,
      "text": " Ixiano, what does the first real day one working with the customers, sprint zero look like?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1703.28,
      "end": 1707.52,
      "text": " Yeah, we actually call the first, the very first iteration sprint zero, just because it's a little"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1707.52,
      "end": 1712.56,
      "text": " bit special than what we will be doing for the rest of the project. And it's just because the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1712.56,
      "end": 1717.76,
      "text": " first phase requires a little bit more preparation than the other phases where you already have a"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1717.76,
      "end": 1722.32,
      "text": " momentum and you have a little bit more clear planning of what's going to happen, and you keep"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1722.32,
      "end": 1727.84,
      "text": " iterating that way. So with sprint zero, we basically, it's something that we do for a shorter"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1727.84,
      "end": 1731.84,
      "text": " period of time. We generally prefer a sprint of two weeks, but for sprint zero, we generally go"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1731.84,
      "end": 1736.24,
      "text": " for just one week. And again, it's just because it's a preparation for then the more regular"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1736.24,
      "end": 1742.48,
      "text": " sprints. And it's kind of a workshop and then we prefer to do it in person where we try to go"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1742.48,
      "end": 1748.24,
      "text": " through all the available documentation, what is the output of the delivery. And in terms of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1748.24,
      "end": 1753.36,
      "text": " activities, there are a few things that we try to do. It will be kind of a full time"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1754.48,
      "end": 1759.04,
      "text": " series of days, and we have different project stakeholders. There could be domain experts,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1759.04,
      "end": 1764.08,
      "text": " architect developers, UX, UI experts, really depends on the type of product that we're"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1764.08,
      "end": 1768.32,
      "text": " building and the type of people involved in that project. But again, whoever has a perspective and"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1768.32,
      "end": 1772.8,
      "text": " an expectation on that project needs to be involved in this phase because they're going"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1772.8,
      "end": 1776.8,
      "text": " to have to define exactly what is their expectation, what is their success criteria."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1776.8,
      "end": 1781.52,
      "text": " And we need to figure out how to align everyone with that particular expectation in mind."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1781.52,
      "end": 1786.1599999999999,
      "text": " So mission and objectives are at some point mutually agreed. Everyone is say,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1786.1599999999999,
      "end": 1790.8,
      "text": " okay, this is what we want to achieve. And this is how we think we should be proceeding for the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1790.8,
      "end": 1798.6399999999999,
      "text": " next sprints. So that basically helps us to create a product backlog where we try to define all the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1798.6399999999999,
      "end": 1803.2,
      "text": " features that we need to build. And those features are not just in a random pile where anyone can"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1803.2,
      "end": 1807.52,
      "text": " just pick one, but it's very important to try to prioritize the ones that you want to do first,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1807.52,
      "end": 1812,
      "text": " because generally they are the ones that are either going to enable other things or deliver"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1812,
      "end": 1816.48,
      "text": " the most value straight away. So it's very important that you focus a bit of time trying"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1816.48,
      "end": 1820.8,
      "text": " to prioritize what is really important for the business, because that's going to drive the next"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1820.8,
      "end": 1825.2,
      "text": " phases. So you definitely want to finish first the things with the most value or the things that are"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1825.2,
      "end": 1829.44,
      "text": " going to block more value for the future. The other thing that we need to do is if there is any"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1829.44,
      "end": 1835.1200000000001,
      "text": " dependency on existing systems or legacy software that is used in the company, that needs to be"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1835.1200000000001,
      "end": 1839.52,
      "text": " totally analyzed and documented, because this is generally where you can find surprises, where you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1839.52,
      "end": 1843.8400000000001,
      "text": " can find blockers. And if you need to create some kind of integration, you really need to understand"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1843.8400000000001,
      "end": 1847.28,
      "text": " what that integration could look like and how much work there is involved in creating that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1847.28,
      "end": 1852.24,
      "text": " integration. Sometimes you need access to systems like that. You need access to documentation and"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1852.24,
      "end": 1856.24,
      "text": " might not be an immediate thing to get that access. Maybe you need to go through a process"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1856.24,
      "end": 1860.32,
      "text": " where you need to request access, where you need to request access to documentation. So it's really"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1860.32,
      "end": 1864.64,
      "text": " important to identify this kind of dependencies straight away and make sure you try to unblock"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1864.64,
      "end": 1868.88,
      "text": " them as soon as possible, very early on in the process. At this point, we should have a clear"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1868.88,
      "end": 1874.56,
      "text": " enough idea to be able to design a first architecture. And we generally try to do that at two"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1874.56,
      "end": 1879.2,
      "text": " levels. One level is very high level. It's kind of a logical architecture. Like what do we expect the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1879.2,
      "end": 1883.36,
      "text": " systems to do and how they are integrated with each other? The other one is a lot more detailed,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1883.36,
      "end": 1888.4799999999998,
      "text": " what we call it physical level, where we actually describe what the implementation of the systems"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1888.4799999999998,
      "end": 1893.6,
      "text": " could look like. Are we going to use, for instance, DynamoDB or a SQL database and which other systems"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1893.6,
      "end": 1897.84,
      "text": " are going to connect to that database? Maybe we need multiple databases. So it's really trying to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1897.84,
      "end": 1902.4799999999998,
      "text": " nail down also the technologies that you're going to be using for implementing this architecture."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1902.4799999999998,
      "end": 1907.84,
      "text": " And that leads to having a good technical vision for the engineering team. And you might also have"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1907.84,
      "end": 1911.76,
      "text": " wireframes if you are working, for instance, with designers. So it's really important to try to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1911.76,
      "end": 1916.72,
      "text": " combine not just the architecture, but also what the product should look like. So it's really good"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1916.72,
      "end": 1921.92,
      "text": " when you can work with a team of people that can take care of designing wireframes and really define"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1921.92,
      "end": 1926.32,
      "text": " what the user experience should look like. So that's definitely part of the delivery in that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1926.32,
      "end": 1932.56,
      "text": " sense. And we will agree on some KPIs. So metrics that are going to help us to assess, are we being"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1932.56,
      "end": 1937.44,
      "text": " successful in this implementation? Is this product really delivering the value that we imagined at"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1937.44,
      "end": 1943.1200000000001,
      "text": " the beginning to customers or users in general? We also got to mention if there are risks or if"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1943.1200000000001,
      "end": 1948.24,
      "text": " there are things that we need to do to reduce risk and all of this stuff is logged and it's something"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1948.24,
      "end": 1954,
      "text": " we can reuse later on in the following sprints as a something to double check. Like, are we really"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1954,
      "end": 1958.3200000000002,
      "text": " seeing this risk? Are we doing something to mitigate the risk? Or maybe this risk is not really"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1958.3200000000002,
      "end": 1962.24,
      "text": " that worrying after all, because we figured out or we learned something else during the sprints that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1962.24,
      "end": 1967.04,
      "text": " can help us to be more confident that we can avoid certain risks. But it's really important to have"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1967.04,
      "end": 1971.84,
      "text": " a list of those risks because you always need to make sure you are assessing against them."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1971.84,
      "end": 1976.08,
      "text": " And finally, once we have all of this, so we have a clear understanding, we have an architecture,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1976.08,
      "end": 1982.08,
      "text": " we have a list of tasks, there is the $1 million question, which is how long is this going to take?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1982.6399999999999,
      "end": 1987.84,
      "text": " Everyone wants to know that. And of course, you can never have a precise answer, especially with"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1987.84,
      "end": 1992.6399999999999,
      "text": " an agile approach. You try not to have a super accurate answer because you are always learning."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1992.6399999999999,
      "end": 1996.72,
      "text": " And as you learn more, you can be more accurate, but you need to have some kind of estimate anyway,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1996.72,
      "end": 2000.16,
      "text": " because you cannot just tell the customer, we don't know this is going to take potentially"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2000.16,
      "end": 2005.52,
      "text": " forever. No, you need to be able to provide some value in a specific timeframe. So what we do is"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2005.52,
      "end": 2010.72,
      "text": " we generally assign a size to all the tasks. And we call this exercise T-shirt sizing, because we"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2010.72,
      "end": 2016.48,
      "text": " give a small, medium, large, extra large kind of sizing. And then we have a very simplistic model"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2016.48,
      "end": 2020.88,
      "text": " that allows us to see, depending on the size of cards and number of people involved and how easy"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2020.88,
      "end": 2025.44,
      "text": " it is to parallelize certain tasks, how much more or less that project is going to take. And it's"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2025.44,
      "end": 2030.4,
      "text": " just a ballpark figure that you have as a feeling to see, are we talking about weeks? Are we talking"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2030.4,
      "end": 2035.68,
      "text": " about months or years? And of course, the longer it is, the more you need to make an effort to try"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2035.68,
      "end": 2039.8400000000001,
      "text": " to reduce the scope so that you can come up with something valuable in a shorter amount of time."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2039.8400000000001,
      "end": 2043.52,
      "text": " It's not uncommon to see that a project might take, I don't know, two years after you do all"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2043.52,
      "end": 2048.2400000000002,
      "text": " of this research. And that's when you have to go back and see, okay, this is not a realistic project"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2048.2400000000002,
      "end": 2053.04,
      "text": " that we can be successful in. We need to reduce the scope. We need to trim down, focus maybe on"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2053.04,
      "end": 2057.36,
      "text": " a smaller area, try to deliver that one first, reassess everything. And then eventually maybe"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2057.36,
      "end": 2060.64,
      "text": " you come up with like, this might be a three months worth of project. And at that point,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2060.64,
      "end": 2065.44,
      "text": " you have the risk a lot, the success of that investment, because you are much more likely"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2065.44,
      "end": 2070,
      "text": " to come up after those three months with something valuable rather than investing years into something"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2070,
      "end": 2075.52,
      "text": " that might not turn out to be so important after the three years. So what happens next? At this"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2075.52,
      "end": 2080.16,
      "text": " point, we are ready to roll. How do we continue?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2080.16,
      "end": 2084.64,
      "text": " When people think about this approach to software development, it sounds fuzzier and maybe less of a commitment. Maybe it's just more of like a"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2084.64,
      "end": 2090.16,
      "text": " cop out from the developers, because you're not committing to a rigid timeline. In fact, to do it"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2090.16,
      "end": 2094.48,
      "text": " right, it all it means is that you're doing more planning, you're just spreading it over time,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2094.48,
      "end": 2098.72,
      "text": " and you're constantly planning. Now there's that old saying that says, plans are useless, but"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2098.72,
      "end": 2104.7999999999997,
      "text": " planning is critical. And that's what this really is about. Rather than say, okay, here's a plan"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2104.8,
      "end": 2110.1600000000003,
      "text": " that gives us very fixed scope in a fixed period is we time box our milestones. So we say, okay,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2110.1600000000003,
      "end": 2115.04,
      "text": " well, here's what we're trying to achieve. But let's make an initial time box. And for a new"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2115.04,
      "end": 2120.8,
      "text": " customer, first greenfield project, or actually any type of customer, we try to limit the duration"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2120.8,
      "end": 2124.7200000000003,
      "text": " of the first engagement to like six to eight weeks, so maybe three or four sprints. And that"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2124.7200000000003,
      "end": 2130.2400000000002,
      "text": " gives us and the customer enough time to see a lot of value. And it's generally a good enough"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2130.2400000000002,
      "end": 2134.32,
      "text": " amount of time to set the foundation and deliver something that's really valuable from a business"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2134.4,
      "end": 2138.7200000000003,
      "text": " perspective to production that you can iterate on from that point. And it seems like a short"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2138.7200000000003,
      "end": 2141.92,
      "text": " amount of time to a lot of people. But if you're really focused and you've got a very high"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2141.92,
      "end": 2146.32,
      "text": " performing lean team, you can do a lot in that amount of time. After that, sprint zero, which"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2146.32,
      "end": 2150.48,
      "text": " is critical foundation, you generally have a good idea of what that value is. So you can kick off"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2150.48,
      "end": 2155.84,
      "text": " your regular sprint, sprint cadence. Sometimes agile teams work in sprints. Sometimes it's more"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2155.84,
      "end": 2162.0800000000004,
      "text": " kind of Kanban kind of continuous taking tasks off. More often than not, we work in two weeks"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2162.08,
      "end": 2167.52,
      "text": " sprints. And the idea of that is you've got, that's the kind of feedback loop in terms of"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2167.52,
      "end": 2172.48,
      "text": " talking to your stakeholders and end users and understanding how to course correct your plan."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2173.2,
      "end": 2178.72,
      "text": " The main activity within these sprints, of course, is coding, development, delivery of prioritized"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2178.72,
      "end": 2183.2799999999997,
      "text": " features and tasks, including all of the best practices like continuous deployment to your"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2183.2799999999997,
      "end": 2187.84,
      "text": " production environment. That's something we put in from the very start so that it doesn't become"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2187.84,
      "end": 2193.2000000000003,
      "text": " a big effort later. It's always good to get all of those production deployment, best practices,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2193.2000000000003,
      "end": 2197.92,
      "text": " observability, quality control in from the very start. It's much cheaper to do it at the very"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2197.92,
      "end": 2202.56,
      "text": " start and then just increment them over time. So it involves programming, the creation of"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2202.56,
      "end": 2207.04,
      "text": " virtual infrastructure in a cloud environment, documentation, tests, all of that. Studies have"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2207.04,
      "end": 2212.4,
      "text": " shown that waiting until the end of a sprint or, you know, monthly or three monthly release cycles"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2212.4,
      "end": 2216.8,
      "text": " to deploy software, that's been shown to slow down high-performing teams. So we follow the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2216.8,
      "end": 2221.44,
      "text": " practice of continuous delivery. So it just becomes a habit that you do without even thinking"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2221.44,
      "end": 2226.5600000000004,
      "text": " about it. That's automated, highly and tested. Once you've got good planning in place,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2227.36,
      "end": 2232.1600000000003,
      "text": " hopefully the items on your backlog, those features, whatever it is, ideally they should"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2232.1600000000003,
      "end": 2236.2400000000002,
      "text": " take between like a half a day or three days to deliver. The reason for that is that if you've"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2236.2400000000002,
      "end": 2241.6800000000003,
      "text": " got unexpected hitches along the way, external blockers, sometimes as a developer, we end up"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2241.68,
      "end": 2247.12,
      "text": " spending a day or two resolving an unanticipated issue. But if your units of work are small enough,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2247.12,
      "end": 2251.6,
      "text": " then the impact is less overall and the time to adapt and of course correct. It doesn't have such"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2251.6,
      "end": 2255.2799999999997,
      "text": " an impact on the overall delivery schedule. Two-week sprints, there's always meetings,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2255.2799999999997,
      "end": 2260.16,
      "text": " of course. Some people live by these meetings, some that when they work well, they're great for"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2260.16,
      "end": 2265.2,
      "text": " everybody and they get a lot of satisfaction. They can become a pain for a lot of developer teams"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2265.2,
      "end": 2270.16,
      "text": " when these meetings are not done well, because they think it's just a bunch of managers distracting"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2270.16,
      "end": 2274.72,
      "text": " you from the work you're supposed to be doing just to talk rubbish. Believe me, I've worked"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2274.72,
      "end": 2278.48,
      "text": " in companies where agile software has been done really well and I've been lucky enough to be in"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2278.48,
      "end": 2282.24,
      "text": " that position. And when it works, it really, really works and makes everybody more productive."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2282.24,
      "end": 2287.12,
      "text": " So we try to get a good balance ration, try to keep the meetings focused and short and not take"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2287.12,
      "end": 2291.3599999999997,
      "text": " too much of people's times. Planning meeting at the start of a sprint with the product owner,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2291.3599999999997,
      "end": 2295.92,
      "text": " the delivery team, that's about reviewing the top of the backlog, checking your priorities,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2295.92,
      "end": 2300.96,
      "text": " adjusting, getting more clarity on specific features and just having a good sense of what"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2300.96,
      "end": 2304.32,
      "text": " you're going to try and achieve over the next couple of weeks. Then you have a daily check-in,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2304.32,
      "end": 2309.36,
      "text": " which is about raising and tackling any blockers, reviewing your work done, and just basically"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2309.36,
      "end": 2314.2400000000002,
      "text": " self-organizing the people who are involved in delivering, self-organizing to get that day's"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2314.2400000000002,
      "end": 2320.32,
      "text": " activity done. And it should not take more than 10 or 15 minutes. If it is, there's a red flag"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2320.32,
      "end": 2324.8,
      "text": " there. It's typical at the end of the sprint then to review. You have a demo with your stakeholders"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2324.8,
      "end": 2330.96,
      "text": " where you showcase everything you've done. You get feedback on it. They say whether it meets the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2330.96,
      "end": 2335.92,
      "text": " needs, fulfills the mission. You look at your KPIs, your checklists, look at your risks and"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2335.92,
      "end": 2342.2400000000002,
      "text": " your actions. Now it's pretty common in like agile methodologies like Scrum to have that end of sprint"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2342.2400000000002,
      "end": 2348.4,
      "text": " demo. What we like to do is actually a weekly demo at least, and also ad hoc demos to stakeholders"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2348.48,
      "end": 2355.2000000000003,
      "text": " even, because I think two weeks to wait to show them the work you did maybe 10 days ago,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2355.2000000000003,
      "end": 2358.64,
      "text": " it's quite a long feedback loop and doesn't give you a chance to course correct quickly enough."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2359.44,
      "end": 2364.88,
      "text": " It also often causes you to rush the demo and maybe do a little bit of a polished demo where"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2364.88,
      "end": 2368.96,
      "text": " you're just trying to show all of the nice things you've built. A demo is much more valuable for"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2368.96,
      "end": 2373.04,
      "text": " everybody where you show the stuff that didn't work as well as the show the stuff that did work."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2373.04,
      "end": 2377.84,
      "text": " It goes back to that transparency principle we talked about at the start that we try to adhere"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2377.84,
      "end": 2382.96,
      "text": " to. It establishes a lot more trust. You can show things a lot more detail and as well it means"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2382.96,
      "end": 2387.52,
      "text": " there's not a lot of pressure for everybody to be there and to be super engaged in the demo at the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2387.52,
      "end": 2392.8,
      "text": " end of every sprint. You can maybe miss one every once in a while and it's not such a big deal."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2392.8,
      "end": 2398.8,
      "text": " So I encourage people to think about more regular and more honest and raw transparent demos as well."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2399.44,
      "end": 2404.32,
      "text": " So getting the value in those meetings measured, checking that you're not wasting time,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2405.04,
      "end": 2409.76,
      "text": " people aren't just phoning it in and checking in and nodding along to the meeting while they keep"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2409.76,
      "end": 2414.2400000000002,
      "text": " coding. That's important because what's the point if that happens? You have to make sure that they're"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2414.2400000000002,
      "end": 2418.7200000000003,
      "text": " valuable and I always think if you're not either contributing value to a meeting or getting value"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2418.7200000000003,
      "end": 2422.6400000000003,
      "text": " from a meeting just don't show up. You're better off doing something else and you're better off"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2422.6400000000003,
      "end": 2427.36,
      "text": " kind of raising it and saying okay how can we make this more valuable for everyone who is there."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2427.36,
      "end": 2430.56,
      "text": " So we've gone through sprint zero. We've gone through the regular sprints. Luciano,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2431.12,
      "end": 2437.2799999999997,
      "text": " should we talk about milestones and releases, things that are less discussed in agile processes?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2441.7599999999998,
      "end": 2447.68,
      "text": " Yeah, I think it's really important to clarify that this process might seem like something that doesn't really have a clear vision but it's actually quite the opposite. Meaning that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2447.68,
      "end": 2453.36,
      "text": " you are only trying to minimize the risk that something changes and you are not ready for it"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2453.36,
      "end": 2458.4,
      "text": " or there is that you misunderstood something and you realize that too late but you are still driven"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2458.4,
      "end": 2463.84,
      "text": " by business needs. And the business will probably need things like get new customers, get specific"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2463.84,
      "end": 2468.7200000000003,
      "text": " feature out that customers are going to be paying for or maybe there is a marketing element to it."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2468.7200000000003,
      "end": 2473.6800000000003,
      "text": " So you'll need to have certain things ready before a marketing campaign can be kicked off or maybe I"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2473.6800000000003,
      "end": 2477.52,
      "text": " don't know you are discussing with investors and you have agreed certain things with investors so"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2477.52,
      "end": 2483.12,
      "text": " you need to meet certain goals or features or number of customers to be able to secure another"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2483.12,
      "end": 2487.52,
      "text": " round of funding. So all these things are something that somehow needs to be taken into account."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2487.52,
      "end": 2492.08,
      "text": " So even though you are following this approach that is very agile, you are still driven by"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2492.08,
      "end": 2496.72,
      "text": " milestones and releases that are very closely tied to what the business needs to effectively"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2496.72,
      "end": 2503.84,
      "text": " survive and be successful. So it's interesting to be able to find a good balance between keeping"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2503.84,
      "end": 2507.84,
      "text": " that vision in terms of business but also keeping a methodology that is flexible enough but it's"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2507.84,
      "end": 2512.96,
      "text": " definitely doable as long as you keep both things in mind. And I think this is very important. This"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2512.96,
      "end": 2517.28,
      "text": " is why it's very important to have both business people and technical people involved in the process"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2517.28,
      "end": 2521.36,
      "text": " and have them to be able to communicate effectively together and understand together what is"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2521.36,
      "end": 2525.52,
      "text": " each other's responsibility and how can they work together rather than working against each other."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2525.52,
      "end": 2531.52,
      "text": " So I think it's interesting that there might be different scenarios. For instance, when you are"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2531.52,
      "end": 2536.1600000000003,
      "text": " creating a new platform for Scratch, what we try to do in those six to eight weeks is generally"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2536.1600000000003,
      "end": 2540.96,
      "text": " come up with an MVP that we have in production. So it's something that we can show to people,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2540.96,
      "end": 2546.32,
      "text": " we can show to customers, we can show to investors and that clearly communicates this is why this"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2546.32,
      "end": 2551.04,
      "text": " project makes sense. And this is why either as a customer you should buy this product or maybe as"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2551.04,
      "end": 2555.52,
      "text": " an investor you should invest in this business to move it to the next phase. So I think it's"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2555.52,
      "end": 2561.6000000000004,
      "text": " very important for us to agree with our customers. This is what we want to deliver and to give them a"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2561.6000000000004,
      "end": 2566.96,
      "text": " chance to make sure that they can get that value straight away. The sooner we do that, I think that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2566.96,
      "end": 2571.6800000000003,
      "text": " the easier it's going to be for our customers to evaluate this kind of partnership and decide what"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2571.68,
      "end": 2576.56,
      "text": " to do next. And what to do next is always an interesting question. There might be different"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2576.56,
      "end": 2582.24,
      "text": " outcomes. Sometimes we realize and our customer realize that even if we did an excellent job,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2582.24,
      "end": 2586.08,
      "text": " the customer might be better off continuing on their own. Maybe they can build their own"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2586.08,
      "end": 2590.72,
      "text": " technical team. Maybe they can just totally onboard something that we built together with"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2590.72,
      "end": 2594.56,
      "text": " them and continue developing it with their own internal team that they might already have."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2594.56,
      "end": 2599.04,
      "text": " So that's totally an option. And when that happens, it doesn't mean that we haven't been successful."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2599.04,
      "end": 2603.04,
      "text": " Actually means that we've been extremely successful and we are going to help the customer"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2603.04,
      "end": 2607.92,
      "text": " to just move on to the next phase and continue building things on their own. In other cases,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2607.92,
      "end": 2612.24,
      "text": " we can still decide to continue the partnership. Maybe the customer decides that they want to build"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2612.24,
      "end": 2616.24,
      "text": " more stuff with us, maybe expand that project, build more features, maybe build the next phase"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2616.24,
      "end": 2620.56,
      "text": " of that project, or even just move us to other projects because in bigger companies, they always"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2620.56,
      "end": 2625.7599999999998,
      "text": " have a number of projects going on at the same time and we might be helpful in other projects"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2625.76,
      "end": 2630.48,
      "text": " as well. Or maybe there are other projects that they want to start as more experimental activities"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2630.48,
      "end": 2635.6800000000003,
      "text": " and we might be the partner that helps them to try to build something new. So in summary, today,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2635.6800000000003,
      "end": 2642.2400000000002,
      "text": " what we did is covering what are our principles, how do we work as a company, and we try to be"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2642.2400000000002,
      "end": 2647.1200000000003,
      "text": " trusted partners for our customers. We don't just want to build hours of engineering time,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2647.1200000000003,
      "end": 2652.0800000000004,
      "text": " but we want to make sure our customers will succeed with their own business goals. And we"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2652.08,
      "end": 2656.48,
      "text": " are the enablers from a technical perspective to make sure that they're going to deliver the best"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2656.48,
      "end": 2660.88,
      "text": " technical stuff that can fulfill that specific business need. We also spoke a little bit about"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2660.88,
      "end": 2665.2,
      "text": " the software world and how there are so many misconceptions on how you should be building"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2665.2,
      "end": 2669.92,
      "text": " software, even though it's not a perfect science and everyone has its own kind of incarnation of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2669.92,
      "end": 2674.08,
      "text": " what good software development looks like. I think it's important to recognize that there are some"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2674.08,
      "end": 2678.16,
      "text": " principles, some guiding principles that are universally recognized and you should be using"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2678.24,
      "end": 2682.8799999999997,
      "text": " them. Then as long as you have a clear process and you can work effectively with your customers,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2682.8799999999997,
      "end": 2687.7599999999998,
      "text": " it's fine to probably have slightly different take on how you actually organize the day to day."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2687.7599999999998,
      "end": 2692,
      "text": " We have our own way that we described today, and hopefully you found that interesting."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2692.64,
      "end": 2697.8399999999997,
      "text": " But we are also, as usual, very curious to hear it from you. Do you use a very similar process when"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2697.8399999999997,
      "end": 2702.96,
      "text": " you work with technology projects? If you are also a consultant, what are we saying? Does it make any"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2702.96,
      "end": 2707.68,
      "text": " sense or do you do something entirely different? I think it's really important to have a healthy"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2707.68,
      "end": 2712.8799999999997,
      "text": " conversation in our circle to compare all the different processes and learn from each other."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2712.8799999999997,
      "end": 2718.16,
      "text": " What does it really work? What doesn't work? How can we grow together and get better at this craft?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2718.16,
      "end": 2723.12,
      "text": " Definitely let us know what you think. Leave us a comment either on YouTube or reach out to us"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2723.12,
      "end": 2727.8399999999997,
      "text": " on socials. All the links will be in the show notes as usual. Thank you very much and we'll"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2727.84,
      "end": 2732.1600000000003,
      "text": " see you in the next episode."
    }
  ]
}