{
  "speakers": {
    "spk_0": "Luciano",
    "spk_1": "Eoin"
  },
  "segments": [
    {
      "speakerLabel": "spk_0",
      "start": 0,
      "end": 6.08,
      "text": " What do people think about AWS when it comes to topics such as infrastructure as code, CI-CD,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 6.08,
      "end": 11.52,
      "text": " serverless containers, NoSQL databases, event-driven architectures, AI and machine learning?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 11.52,
      "end": 16.88,
      "text": " These are some of the topics covered by an AWS yearly survey called AnsWerS, which ran from"
    },
    {
      "speakerLabel": "spk_0",
      "start": 16.88,
      "end": 24.16,
      "text": " January 16 to February 16 this year. The results are finally available on a website called answersforaws.com/2024"
    },
    {
      "speakerLabel": "spk_0",
      "start": 24.16,
      "end": 29.52,
      "text": " and today we want to go over this data and provide some additional opinions."
    },
    {
      "speakerLabel": "spk_0",
      "start": 29.599999999999998,
      "end": 33.76,
      "text": " My name is Luciano and I'm joined by Eoin for another episode of AWS Bites podcast."
    },
    {
      "speakerLabel": "spk_0",
      "start": 42,
      "end": 46.64,
      "text": " AWS Bites is brought to you by fourTheorem, an AWS partner that does cloud stuff really,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 46.64,
      "end": 50.56,
      "text": " really well. If you're curious, check us out at fourtheorem.com."
    },
    {
      "speakerLabel": "spk_0",
      "start": 50.56,
      "end": 56.08,
      "text": " So this survey is run by Peter Sankauskas, I hope I'm pronouncing the surname correctly,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 56.08,
      "end": 60.239999999999995,
      "text": " and it's also built together with the AWS community, so it's kind of a community"
    },
    {
      "speakerLabel": "spk_0",
      "start": 60.96,
      "end": 67.12,
      "text": " endeavor. And Peter is an hero since 2014, a community hero, so he's trying to kind of get"
    },
    {
      "speakerLabel": "spk_0",
      "start": 67.12,
      "end": 73.68,
      "text": " a sense for what people think about AWS, what are areas for improvement, what people do when it"
    },
    {
      "speakerLabel": "spk_0",
      "start": 73.68,
      "end": 78,
      "text": " comes to different topics such as we mentioned infrastructure as code, CI-CD, serverless"
    },
    {
      "speakerLabel": "spk_0",
      "start": 78,
      "end": 83.36,
      "text": " containers. So we are going to have our screen share here, but if you're following on the audio"
    },
    {
      "speakerLabel": "spk_0",
      "start": 83.36,
      "end": 88.48,
      "text": " only podcast, we'll try to describe of course all the data as best as we can, but if you want to see"
    },
    {
      "speakerLabel": "spk_0",
      "start": 88.48,
      "end": 94.48,
      "text": " the full video, the video is also available on YouTube. So Eoin, where do we want to start?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 94.48,
      "end": 99.84,
      "text": " Before we dive into the different areas, maybe we'll just talk about how the data is gathered."
    },
    {
      "speakerLabel": "spk_1",
      "start": 100.4,
      "end": 104.64,
      "text": " I think it's mentioned that this is inspired by the state of JS survey and also the Datadog"
    },
    {
      "speakerLabel": "spk_1",
      "start": 104.64,
      "end": 110.4,
      "text": " state of serverless survey. I know that the Datadog one, as far as I'm aware, uses Datadog data,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 110.80000000000001,
      "end": 115.92,
      "text": " actual customer usage data to compile that report. This one's a little bit different because there's"
    },
    {
      "speakerLabel": "spk_1",
      "start": 115.92,
      "end": 121.52000000000001,
      "text": " a survey and it's essentially spread through word of mouth and network and social media."
    },
    {
      "speakerLabel": "spk_1",
      "start": 121.52000000000001,
      "end": 126.72,
      "text": " So already I think it's very interesting to look at this and see, okay, how does this compare to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 126.72,
      "end": 132.08,
      "text": " my biases and what can I learn new from what other people are doing out there, what's trending,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 132.08,
      "end": 136.56,
      "text": " but also kind of bear in mind that there might be a bit of selection bias here because"
    },
    {
      "speakerLabel": "spk_1",
      "start": 137.2,
      "end": 142.96,
      "text": " there might be a bit of a filter bubble and this might be capturing the voice of maybe a noisy"
    },
    {
      "speakerLabel": "spk_1",
      "start": 142.96,
      "end": 149.12,
      "text": " majority and maybe doesn't capture the full gamut of people building stuff on AWS. So we can bear"
    },
    {
      "speakerLabel": "spk_1",
      "start": 149.12,
      "end": 152.8,
      "text": " that in mind, but it's still going to be interested to dive into it. Are we ready to go into the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 152.8,
      "end": 156.88,
      "text": " topics Luciano, or is there anything else you wanted to say first? No, I think that's fair."
    },
    {
      "speakerLabel": "spk_0",
      "start": 156.88,
      "end": 162,
      "text": " Maybe if we go through the demographics first, maybe another comment I have is that demographic"
    },
    {
      "speakerLabel": "spk_0",
      "start": 162.08,
      "end": 166.4,
      "text": " is a really good section to kind of get a feeling for what the audience looks like,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 166.4,
      "end": 172.16,
      "text": " but we only get percentages. We don't really get like a total number of participants. So again,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 172.16,
      "end": 176.56,
      "text": " this doesn't give us any insights on how statistically relevant this could be. So just"
    },
    {
      "speakerLabel": "spk_0",
      "start": 176.56,
      "end": 181.52,
      "text": " take that as a thing to bear in mind while we go through this. And of course, we're going to try"
    },
    {
      "speakerLabel": "spk_0",
      "start": 181.52,
      "end": 186.48,
      "text": " to provide our own opinions, which are of course biased as well. So let's try to see what we can"
    },
    {
      "speakerLabel": "spk_0",
      "start": 186.48,
      "end": 191.04,
      "text": " learn, but of course this is not going to be representative for all the use cases of AWS."
    },
    {
      "speakerLabel": "spk_1",
      "start": 191.44,
      "end": 196.23999999999998,
      "text": " And right away we can see we've got 80% of respondents are from either North America or"
    },
    {
      "speakerLabel": "spk_1",
      "start": 196.23999999999998,
      "end": 201.2,
      "text": " Europe, roughly in half. So maybe already there's an issue with language, I don't know,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 201.2,
      "end": 205.92,
      "text": " or just region network here, because if it's an English only survey that may skew the results"
    },
    {
      "speakerLabel": "spk_1",
      "start": 205.92,
      "end": 211.51999999999998,
      "text": " and we've got 0% respondents from Antarctica. So that's a pity. I'd love to know what they think"
    },
    {
      "speakerLabel": "spk_1",
      "start": 211.51999999999998,
      "end": 216.56,
      "text": " down there. All right. And age-wise it's interesting, I guess, because it kind of shows"
    },
    {
      "speakerLabel": "spk_1",
      "start": 216.56,
      "end": 221.6,
      "text": " that the age profile for these surveys, I think, is shifting a little bit, right? We have more"
    },
    {
      "speakerLabel": "spk_1",
      "start": 221.6,
      "end": 227.04,
      "text": " people in the kind of middle age bracket. Quite a small number, I would say, in the 19 to 24 year"
    },
    {
      "speakerLabel": "spk_1",
      "start": 227.04,
      "end": 232.08,
      "text": " old range, which is maybe a little bit surprising. I mean, that's what, 2%, 1% and nobody 65 years"
    },
    {
      "speakerLabel": "spk_1",
      "start": 232.08,
      "end": 237.92000000000002,
      "text": " older."
    },
    {
      "speakerLabel": "spk_0",
      "start": 237.92000000000002,
      "end": 242.8,
      "text": " Honestly, I don't know if I'm surprised by that initial number, 1924, because one thing we have mentioned a few times is that AWS doesn't look very friendly to students or people that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 242.8,
      "end": 247.36,
      "text": " are just starting their career just because you can be scared about massive build shocks."
    },
    {
      "speakerLabel": "spk_0",
      "start": 247.36,
      "end": 252,
      "text": " So people tend to stay away from AWS. So maybe that's a reflection of that feeling."
    },
    {
      "speakerLabel": "spk_0",
      "start": 253.04000000000002,
      "end": 258,
      "text": " Yeah, that's a fair point."
    },
    {
      "speakerLabel": "spk_1",
      "start": 258,
      "end": 265.28000000000003,
      "text": " But what it's also saying is that I think that, let's see, we've got like 70% almost of respondents who've had perhaps 15 to 25 years of experience in the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 265.28000000000003,
      "end": 269.92,
      "text": " industry. So that's going to inform the results so much as well. And that's specifically here."
    },
    {
      "speakerLabel": "spk_1",
      "start": 270,
      "end": 274.88,
      "text": " We could see the majority is six to 10 years of experience with AWS alone. So this seems to be"
    },
    {
      "speakerLabel": "spk_1",
      "start": 276.08000000000004,
      "end": 281.2,
      "text": " possibly weighted towards AWS fanatics in some way, or at least people who've been using it"
    },
    {
      "speakerLabel": "spk_1",
      "start": 281.2,
      "end": 286.24,
      "text": " for a long time. It would be nice to hear from people who are less experienced in general,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 286.24,
      "end": 289.52000000000004,
      "text": " because we can't just be building for the people who are already in the community."
    },
    {
      "speakerLabel": "spk_1",
      "start": 290.32,
      "end": 293.6,
      "text": " The next one is company size. So a lot of big companies and they're actually 25%,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 294.48,
      "end": 301.04,
      "text": " but that's quite a broad range. And almost half of the respondents are actually providing software"
    },
    {
      "speakerLabel": "spk_1",
      "start": 301.04,
      "end": 306.48,
      "text": " and internet services or products in some way and professional services as well. So that would be..."
    },
    {
      "speakerLabel": "spk_1",
      "start": 307.36,
      "end": 311.44,
      "text": " I did respond to this survey actually, Luciano, did you answer the call for this survey?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 311.44,
      "end": 316.32000000000005,
      "text": " Yeah. So we're both in here in this 13.1%, I guess. And then financial services is the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 316.32000000000005,
      "end": 319.52000000000004,
      "text": " biggest industry sector, which is definitely interesting."
    },
    {
      "speakerLabel": "spk_1",
      "start": 319.59999999999997,
      "end": 325.84,
      "text": " It's also interesting to see that there is a quite significant slice there of healthcare and..."
    },
    {
      "speakerLabel": "spk_0",
      "start": 325.84,
      "end": 332.71999999999997,
      "text": " What was the other one? Government and education. So I don't know, a bit unexpected if you ask me,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 332.71999999999997,
      "end": 337.03999999999996,
      "text": " but it's interesting. Maybe this has been growing more in the last few years because it might be"
    },
    {
      "speakerLabel": "spk_0",
      "start": 337.03999999999996,
      "end": 340.56,
      "text": " that these are generally industries that are always a little bit behind the curve and trying"
    },
    {
      "speakerLabel": "spk_0",
      "start": 340.56,
      "end": 345.52,
      "text": " to catch up. So promising to see that it's a significant slice that it's almost 5%."
    },
    {
      "speakerLabel": "spk_0",
      "start": 346.47999999999996,
      "end": 350.4,
      "text": " Yeah. I think there's something here."
    },
    {
      "speakerLabel": "spk_1",
      "start": 350.4,
      "end": 355.35999999999996,
      "text": " I think we were kind of surprised still, especially with modern AWS applications, how a lot of enterprise companies have really taken to them in a lot of"
    },
    {
      "speakerLabel": "spk_1",
      "start": 355.35999999999996,
      "end": 359.84,
      "text": " ways. Now there's still a huge number of companies who aren't even on the cloud, aren't just thinking"
    },
    {
      "speakerLabel": "spk_1",
      "start": 359.84,
      "end": 364.4,
      "text": " about moving to the cloud, but we might expect that startups are all over this technology and"
    },
    {
      "speakerLabel": "spk_1",
      "start": 364.4,
      "end": 369.28,
      "text": " everybody else is lagging. But I think financial services showing that they're... I think there's"
    },
    {
      "speakerLabel": "spk_1",
      "start": 369.28,
      "end": 373.28,
      "text": " a lot of cases where they need the scale of the cloud, want to get rid of a lot of infrastructure"
    },
    {
      "speakerLabel": "spk_1",
      "start": 373.28,
      "end": 378.08,
      "text": " maintenance. So it's interesting to see that reflected here. Okay. And then most people"
    },
    {
      "speakerLabel": "spk_1",
      "start": 378.08,
      "end": 382.88,
      "text": " are developers, got some architects. What else? Some business executives as well. Sales and"
    },
    {
      "speakerLabel": "spk_1",
      "start": 382.88,
      "end": 389.35999999999996,
      "text": " marketing even. There are some students as well, but that's the minority looks like, right? 0.5%."
    },
    {
      "speakerLabel": "spk_1",
      "start": 390.79999999999995,
      "end": 394.79999999999995,
      "text": " Yeah. Okay. Yeah. You're right about that. Okay. Let's dive into the areas where we start with"
    },
    {
      "speakerLabel": "spk_1",
      "start": 394.79999999999995,
      "end": 400.96,
      "text": " infrastructure as code. I'm interested in this and we can see in terms of usage, obviously there's"
    },
    {
      "speakerLabel": "spk_1",
      "start": 400.96,
      "end": 405.2,
      "text": " a bit of overlap here because people might be using multiple infrastructure as code platforms"
    },
    {
      "speakerLabel": "spk_1",
      "start": 405.2,
      "end": 410.71999999999997,
      "text": " as we do ourselves. What do you think of this? Yes."
    },
    {
      "speakerLabel": "spk_0",
      "start": 410.71999999999997,
      "end": 415.91999999999996,
      "text": " I honestly was surprised to see that cloud formation are such a big share because generally speaking, I mean, cloud formation works and it's"
    },
    {
      "speakerLabel": "spk_0",
      "start": 415.91999999999996,
      "end": 420.47999999999996,
      "text": " kind of the default AWS tool to do infrastructure as code. But in my experience, when you talk to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 420.47999999999996,
      "end": 427.03999999999996,
      "text": " people at conferences or events, they generally try not to use cloud formation like Verbatim."
    },
    {
      "speakerLabel": "spk_0",
      "start": 427.04,
      "end": 433.04,
      "text": " They generally use something like SAM or they use CDK and maybe they use Terraform and avoid"
    },
    {
      "speakerLabel": "spk_0",
      "start": 433.04,
      "end": 438.08000000000004,
      "text": " cloud formation altogether. So I was a little bit surprised to see that there is an 84.7%"
    },
    {
      "speakerLabel": "spk_0",
      "start": 438.08000000000004,
      "end": 442.32000000000005,
      "text": " of people saying we do use cloud formation. And again, this might be a reflection of people saying,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 442.32000000000005,
      "end": 446.40000000000003,
      "text": " yes, I know that down the line I'm using cloud formation. So they picked that option as well,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 446.40000000000003,
      "end": 450.64000000000004,
      "text": " but I don't know if that means they use confirmation directly or through abstraction"
    },
    {
      "speakerLabel": "spk_0",
      "start": 450.64000000000004,
      "end": 456.96000000000004,
      "text": " layers like CDK or SAM. Yeah. It must be, I'm guessing here we see that 57."
    },
    {
      "speakerLabel": "spk_1",
      "start": 456.96,
      "end": 462.96,
      "text": "3% are using CDK, which is massive for CDK, I think. But I think that that is also reflected in the 84.7% cloud"
    },
    {
      "speakerLabel": "spk_1",
      "start": 462.96,
      "end": 468.71999999999997,
      "text": " formation usage because we don't see SAM or serverless framework or any of the other like"
    },
    {
      "speakerLabel": "spk_1",
      "start": 468.71999999999997,
      "end": 473.76,
      "text": " architect or chalice frameworks here. They're just not there. So I'm assuming that's all coming in"
    },
    {
      "speakerLabel": "spk_1",
      "start": 473.76,
      "end": 481.03999999999996,
      "text": " under cloud formation. What really surprises me here though is that Ansible is 55.2% and also that"
    },
    {
      "speakerLabel": "spk_1",
      "start": 481.03999999999996,
      "end": 485.59999999999997,
      "text": " it's regarded as an infrastructure as code tool rather than configuration management."
    },
    {
      "speakerLabel": "spk_1",
      "start": 485.6,
      "end": 490.16,
      "text": " Yeah."
    },
    {
      "speakerLabel": "spk_0",
      "start": 490.16,
      "end": 494.40000000000003,
      "text": " And to be fair, that might be the case where people are provisioning EC2 instances, maybe through cloud formation, Terraform or whatever. And then they also use Ansible on"
    },
    {
      "speakerLabel": "spk_0",
      "start": 494.40000000000003,
      "end": 499.20000000000005,
      "text": " top of that to actually provision software inside the specific machines that they're provisioning."
    },
    {
      "speakerLabel": "spk_0",
      "start": 499.20000000000005,
      "end": 504.16,
      "text": " So again, it's not that these tools are mutually exclusive. So it's a little bit difficult,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 504.16,
      "end": 509.20000000000005,
      "text": " I guess, to draw any conclusion here. Yeah, for sure."
    },
    {
      "speakerLabel": "spk_1",
      "start": 509.20000000000005,
      "end": 515.36,
      "text": " AppsWorks is also interesting because AppsWorks, as I understand it, is end of life as an AWS service for a chef and puppets. So"
    },
    {
      "speakerLabel": "spk_1",
      "start": 515.36,
      "end": 519.04,
      "text": " there's 16.4% of respondents who will have to migrate to something else at some point."
    },
    {
      "speakerLabel": "spk_0",
      "start": 519.6800000000001,
      "end": 528.72,
      "text": " Maybe Ansible. Terraform is actually top for retention. So I guess this is..."
    },
    {
      "speakerLabel": "spk_1",
      "start": 528.72,
      "end": 533.2,
      "text": " I'm assuming that this is based on previous year's results. Is that your interpretation here?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 533.84,
      "end": 538.5600000000001,
      "text": " I'm not really sure. I don't remember if the questioner was asking you whether you were"
    },
    {
      "speakerLabel": "spk_0",
      "start": 539.28,
      "end": 544.08,
      "text": " still using these tools or if it's just data interpolated from the previous years."
    },
    {
      "speakerLabel": "spk_1",
      "start": 544.08,
      "end": 548.72,
      "text": " Okay. Fair enough. And then Terraform is top for awareness as well. Yeah. Okay. So most people are"
    },
    {
      "speakerLabel": "spk_1",
      "start": 548.72,
      "end": 553.6800000000001,
      "text": " aware of most of them and a lot of people are interested. Most people are interested in CDK."
    },
    {
      "speakerLabel": "spk_1",
      "start": 553.6800000000001,
      "end": 558.64,
      "text": " We're not using it yet. So that is interesting. And then we can see the trend. So Pulumi is"
    },
    {
      "speakerLabel": "spk_1",
      "start": 558.64,
      "end": 562.48,
      "text": " increased on the increase, which is a bit of a surprise. Ansible as well."
    },
    {
      "speakerLabel": "spk_1",
      "start": 562.48,
      "end": 565.76,
      "text": " And cloud formation is going down, right? Which is also interesting."
    },
    {
      "speakerLabel": "spk_0",
      "start": 566.48,
      "end": 572.1600000000001,
      "text": " Relatively, but it's still 35% for interest."
    },
    {
      "speakerLabel": "spk_1",
      "start": 572.16,
      "end": 576.56,
      "text": " Then if we go back to usage, we can see cloud formation has actually increased a little bit in terms of usage. So retention, the calculation is"
    },
    {
      "speakerLabel": "spk_1",
      "start": 576.56,
      "end": 582.7199999999999,
      "text": " actually given here. It's the ratio of used it and would use it again over used it and would or would"
    },
    {
      "speakerLabel": "spk_1",
      "start": 582.7199999999999,
      "end": 589.1999999999999,
      "text": " not. Okay. So it's the percentage of people who used it and would use it again. Okay. I think the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 589.1999999999999,
      "end": 596.48,
      "text": " main takeaway for me here is that CDK is the one that people seem most interested in and have"
    },
    {
      "speakerLabel": "spk_1",
      "start": 596.48,
      "end": 600.0799999999999,
      "text": " adopted really quite significantly. I thought it was a little bit more divisive than this,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 600.8000000000001,
      "end": 607.12,
      "text": " 57%. But the happiness index is actually one that I've heard people comment about the most."
    },
    {
      "speakerLabel": "spk_1",
      "start": 609.2800000000001,
      "end": 614.8000000000001,
      "text": " I'm not sure why this isn't showing up correctly."
    },
    {
      "speakerLabel": "spk_0",
      "start": 614.8000000000001,
      "end": 623.9200000000001,
      "text": " Yeah, I think it was happiness in general on the whole area, not on specific tools. Okay. Right."
    },
    {
      "speakerLabel": "spk_1",
      "start": 624.88,
      "end": 630.56,
      "text": " So what I'm trying to get to is the fact that I believe we heard that most people would not, or a lot of significant number of people"
    },
    {
      "speakerLabel": "spk_1",
      "start": 630.56,
      "end": 635.12,
      "text": " try cloud formation and would like to not use it again. Not surprising."
    },
    {
      "speakerLabel": "spk_1",
      "start": 636,
      "end": 641.92,
      "text": " I saw this earlier. I'd love to dig deep into this a little bit more, but that should be reflected"
    },
    {
      "speakerLabel": "spk_1",
      "start": 641.92,
      "end": 647.4399999999999,
      "text": " in the retention, but I'm not seeing it here. So maybe we'll come back to it. But yeah, I'm always"
    },
    {
      "speakerLabel": "spk_1",
      "start": 647.4399999999999,
      "end": 652.16,
      "text": " interested when I hear that because I know there's a lot of, I think there's a lot of mythology"
    },
    {
      "speakerLabel": "spk_1",
      "start": 652.24,
      "end": 656.24,
      "text": " around as well. Cloud formation definitely needs a lot of improvement, but I also feel that there's"
    },
    {
      "speakerLabel": "spk_1",
      "start": 656.24,
      "end": 661.04,
      "text": " a bit of mythology around there from people who tried it maybe years ago and got rollback"
    },
    {
      "speakerLabel": "spk_1",
      "start": 661.04,
      "end": 666.4,
      "text": " failed errors, got stuck, had to delete everything and vowed to never use cloud formation again."
    },
    {
      "speakerLabel": "spk_1",
      "start": 667.68,
      "end": 670.8,
      "text": " But I think things have improved a lot. And I think if you're serious about AWS,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 670.8,
      "end": 674.4,
      "text": " it's really worthwhile learning. So that's my take on it."
    },
    {
      "speakerLabel": "spk_0",
      "start": 680,
      "end": 686.3199999999999,
      "text": " The other thing, if you scroll at the very bottom is that there is a mention of kind of up and coming tools, which is interesting. And we have there SSD and Wing Lang, which are tools"
    },
    {
      "speakerLabel": "spk_0",
      "start": 686.3199999999999,
      "end": 691.92,
      "text": " that I'm hearing a lot about. So it's interesting to see them there. I haven't heard of Crossplane"
    },
    {
      "speakerLabel": "spk_0",
      "start": 691.92,
      "end": 694.7199999999999,
      "text": " or Troposphere, so I cannot really comment on those."
    },
    {
      "speakerLabel": "spk_0",
      "start": 695.4399999999999,
      "end": 701.8399999999999,
      "text": " Yeah. Wing Lang, we talked about a while back. SSD, we've mentioned in the past."
    },
    {
      "speakerLabel": "spk_1",
      "start": 702.4,
      "end": 707.28,
      "text": " This was, has been built on CDK, but I believe they're moving away from CDK as the underlying"
    },
    {
      "speakerLabel": "spk_1",
      "start": 707.28,
      "end": 711.04,
      "text": " implementation. The Crossplane and Troposphere are things I'll have to check out."
    },
    {
      "speakerLabel": "spk_1",
      "start": 711.92,
      "end": 714.56,
      "text": " All right. Well, we do see ICD. Let's do that."
    },
    {
      "speakerLabel": "spk_1",
      "start": 715.12,
      "end": 717.76,
      "text": " Okay. Do you want to take us through this one Luciano?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 717.76,
      "end": 722.8,
      "text": " Yes. So my reading of this one, I wasn't surprised to see GitHub Actions there at the top,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 722.8,
      "end": 727.52,
      "text": " but I was a bit surprised to see it as the first one because I think it's relatively new. For"
    },
    {
      "speakerLabel": "spk_0",
      "start": 727.52,
      "end": 731.52,
      "text": " instance, the second one is Jenkins and Jenkins has been around since, I don't know, since I can't"
    },
    {
      "speakerLabel": "spk_0",
      "start": 731.52,
      "end": 738.24,
      "text": " remember. So probably at least a decade. And so GitHub Action is much more recent than that. So"
    },
    {
      "speakerLabel": "spk_0",
      "start": 738.24,
      "end": 742.56,
      "text": " it's interesting to see that there is such a competition between the two and they are very"
    },
    {
      "speakerLabel": "spk_0",
      "start": 742.56,
      "end": 748.16,
      "text": " close. Now, also not too surprising because if you ask people, generally they're not very happy"
    },
    {
      "speakerLabel": "spk_0",
      "start": 748.16,
      "end": 752.0799999999999,
      "text": " with Jenkins while generally they're very happy with GitHub Actions. So probably there is going"
    },
    {
      "speakerLabel": "spk_0",
      "start": 752.0799999999999,
      "end": 757.52,
      "text": " to be a gradual migration from Jenkins to other tools. And right now GitHub Action is probably"
    },
    {
      "speakerLabel": "spk_0",
      "start": 757.52,
      "end": 762.48,
      "text": " the biggest contender out there. We also have CodeBuild and CodePipeline in here and CodeDeploy"
    },
    {
      "speakerLabel": "spk_0",
      "start": 762.48,
      "end": 768,
      "text": " as well. So I'm not really sure how the fact that this, I guess, the functionality spread across"
    },
    {
      "speakerLabel": "spk_0",
      "start": 768,
      "end": 773.4399999999999,
      "text": " three different tools, how is this affecting the numbers? And maybe people are only using some of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 773.4399999999999,
      "end": 779.28,
      "text": " the tools and not all of them together. So I guess it's really hard to read into the numbers here and"
    },
    {
      "speakerLabel": "spk_0",
      "start": 779.28,
      "end": 784.8,
      "text": " comparing the AWS offering with other offerings. And also interesting to see that GitLab is the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 784.8,
      "end": 792.64,
      "text": " third one non-AWS service to be there. And then we have CircleCI and that's it. So no other,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 792.64,
      "end": 807.04,
      "text": " I guess, non-AWS CI offerings."
    },
    {
      "speakerLabel": "spk_1",
      "start": 814.8,
      "end": 819.52,
      "text": " See people moving to GitHub Actions because the developer experience and the speed is just"
    },
    {
      "speakerLabel": "spk_1",
      "start": 819.52,
      "end": 824.64,
      "text": " superior in general in my experience. And unfortunately for GitLab and CircleCI,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 825.28,
      "end": 829.68,
      "text": " those, I think we're leading the space before GitHub Actions came along in a lot of ways,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 829.68,
      "end": 834.0799999999999,
      "text": " but I think GitHub Actions is eating their lunch quite significantly at this point."
    },
    {
      "speakerLabel": "spk_1",
      "start": 835.12,
      "end": 840.0799999999999,
      "text": " Jenkins won't die. That's an interesting aspect here. Still 75% usage of Jenkins."
    },
    {
      "speakerLabel": "spk_1",
      "start": 840.4000000000001,
      "end": 841.2,
      "text": " I recently-"
    },
    {
      "speakerLabel": "spk_1",
      "start": 841.2,
      "end": 845.2800000000001,
      "text": " It's that one legacy product Jenkins built that you can't shut off because nobody knows"
    },
    {
      "speakerLabel": "spk_1",
      "start": 845.2800000000001,
      "end": 846.24,
      "text": " how it works."
    },
    {
      "speakerLabel": "spk_1",
      "start": 846.24,
      "end": 851.36,
      "text": " Yeah."
    },
    {
      "speakerLabel": "spk_0",
      "start": 851.36,
      "end": 856.4000000000001,
      "text": " I recently watched an interesting video by Faster than Lime who did quite a thorough review of GitHub Actions and the flows that GitHub Actions has. So it's a little bit critical against"
    },
    {
      "speakerLabel": "spk_0",
      "start": 856.4000000000001,
      "end": 860.96,
      "text": " GitHub Actions, which kind of shows an interesting thing that there is still a lot of room for"
    },
    {
      "speakerLabel": "spk_0",
      "start": 860.96,
      "end": 865.9200000000001,
      "text": " improvement in this space, even though I think everyone I talk to, they think the GitHub Action"
    },
    {
      "speakerLabel": "spk_0",
      "start": 865.92,
      "end": 870.88,
      "text": " is the best thing ever. So this is probably giving all the competitors a little bit of room"
    },
    {
      "speakerLabel": "spk_0",
      "start": 870.88,
      "end": 875.92,
      "text": " for improvement and maybe catching up with GitHub Actions. I think if they can fix some of the flows"
    },
    {
      "speakerLabel": "spk_0",
      "start": 875.92,
      "end": 880.7199999999999,
      "text": " that GitHub Actions currently has, maybe we will see different numbers in the coming year. So maybe"
    },
    {
      "speakerLabel": "spk_0",
      "start": 880.7199999999999,
      "end": 886.9599999999999,
      "text": " there is hope there for CircleCI and GitLab. Okay."
    },
    {
      "speakerLabel": "spk_1",
      "start": 886.9599999999999,
      "end": 892.24,
      "text": " Well, GitHub Action is, people don't move away from it. It looks like 95% retention. GitLab also so popular, but the AWS ones aren't doing"
    },
    {
      "speakerLabel": "spk_1",
      "start": 892.24,
      "end": 897.2,
      "text": " too bad here. And yeah, GitHub Actions is like CDK for infrastructure as code. That's the one"
    },
    {
      "speakerLabel": "spk_1",
      "start": 897.2,
      "end": 901.92,
      "text": " people are most interested in. So what can we see when we look at the trends year on year,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 901.92,
      "end": 906.72,
      "text": " if we look at usage, Jenkins is diving a little bit, but everything else is the same."
    },
    {
      "speakerLabel": "spk_1",
      "start": 908.08,
      "end": 909.36,
      "text": " Yeah. Maybe another thing to..."
    },
    {
      "speakerLabel": "spk_0",
      "start": 909.36,
      "end": 910.24,
      "text": " It's not a lot of movement."
    },
    {
      "speakerLabel": "spk_0",
      "start": 910.24,
      "end": 914.8,
      "text": " Another thing to mention is that once you have a CI CD pipeline set up and it works and it does"
    },
    {
      "speakerLabel": "spk_0",
      "start": 914.8,
      "end": 918.96,
      "text": " all the things you need to do, you really need to have a pretty strong reason to migrate to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 918.96,
      "end": 923.36,
      "text": " something else. So maybe that justifies the retention for pretty much any tools."
    },
    {
      "speakerLabel": "spk_0",
      "start": 924.32,
      "end": 929.0400000000001,
      "text": " And I guess the dangers might be when you build a new project, if you can get to production with"
    },
    {
      "speakerLabel": "spk_0",
      "start": 929.0400000000001,
      "end": 934,
      "text": " all the things you need quicker, then probably you have a reason to adopt another tool."
    },
    {
      "speakerLabel": "spk_1",
      "start": 935.36,
      "end": 939.76,
      "text": " The positivity around GitHub Actions and the lack of negativity is reflected in this positive"
    },
    {
      "speakerLabel": "spk_1",
      "start": 939.76,
      "end": 945.12,
      "text": " negative split chart, Jenkins, poor Jenkins, but they still can't switch it off because it's a 75%"
    },
    {
      "speakerLabel": "spk_1",
      "start": 945.12,
      "end": 952.08,
      "text": " usage. CodeStar, I've never used CodeStar except for when you need to set up a CodeStar connection"
    },
    {
      "speakerLabel": "spk_1",
      "start": 952.08,
      "end": 956.96,
      "text": " for code pipeline. And Proton. That's interesting actually, because Proton we didn't mention yet,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 956.96,
      "end": 963.04,
      "text": " but Proton is kind of last on the list in terms of awareness, usage, retention, everything,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 963.04,
      "end": 966.08,
      "text": " but the people who do use it don't seem to like it very much."
    },
    {
      "speakerLabel": "spk_0",
      "start": 967.68,
      "end": 972.4,
      "text": " Yeah. I cannot comment on that one because I don't have a lot of experience with it."
    },
    {
      "speakerLabel": "spk_0",
      "start": 973.04,
      "end": 977.52,
      "text": " Yeah. It had a lot of hope. Okay. Most people are pretty happy. Yeah."
    },
    {
      "speakerLabel": "spk_1",
      "start": 977.52,
      "end": 985.12,
      "text": " There's very few people who are seriously unhappy with CI CD services. Argo CD build kit. Okay. Okay. We've covered two"
    },
    {
      "speakerLabel": "spk_1",
      "start": 985.12,
      "end": 989.76,
      "text": " topics and I think now to one, which is a special interest to us, which is the serverless space."
    },
    {
      "speakerLabel": "spk_1",
      "start": 990.3199999999999,
      "end": 995.68,
      "text": " And now we get into some of the tools we talked about earlier. The fact that AWS Sam is now top"
    },
    {
      "speakerLabel": "spk_1",
      "start": 995.68,
      "end": 999.76,
      "text": " of the list when it comes to tools and the serverless space in terms of usage, that's"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1000.72,
      "end": 1005.36,
      "text": " also a little bit surprising, I would say. If we go back to the infrastructure as code chart,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1005.36,
      "end": 1011.36,
      "text": " and we looked at CDK's popularity, CDK is actually lower than AWS Sam here. So I don't know"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1011.36,
      "end": 1017.4399999999999,
      "text": " how that can happen, but with serverless framework is also there, thereabouts. So those three are all"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1017.4399999999999,
      "end": 1023.2,
      "text": " around the 50% usage mark. 36% of people are using Amplify. What do you think of that? Does that"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1023.2,
      "end": 1028.32,
      "text": " come as a shock to you? A little bit, to be honest."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1028.32,
      "end": 1033.76,
      "text": " Maybe again, this is my bias in not having been a huge user of Amplify for different reasons, but maybe people that use it, they"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1033.76,
      "end": 1039.52,
      "text": " really like it and makes their life simpler. So we're not using it more, I guess."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1039.52,
      "end": 1045.9199999999998,
      "text": " It would be interesting if you could actually correlate the demographics and the tooling here, because I still"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1045.9199999999998,
      "end": 1050.48,
      "text": " see Amplify as a tool that helps you to get started and prototyping applications when you're early on"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1050.48,
      "end": 1056.08,
      "text": " in your journey learning AWS. Difficult to use it over the longterm. So I wonder which demographic"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1056.08,
      "end": 1060.08,
      "text": " this correlates with. And 12.7% application composer, which is still a pretty new tool."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1061.6799999999998,
      "end": 1067.52,
      "text": " So CDK is top for retention. Serverless framework is top for awareness, so it still has the biggest"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1067.52,
      "end": 1073.6799999999998,
      "text": " brand recognition, it seems. Lambie is one I have never come across. Lambie for Ruby on Rails. Have"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1073.6799999999998,
      "end": 1078.1599999999999,
      "text": " you seen that one before, Luciano?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1078.1599999999999,
      "end": 1085.04,
      "text": " I have seen it, never used it, and I'm surprised that that's such a big awareness, to be honest, which is like 33 point something percent. Yeah."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1085.04,
      "end": 1091.12,
      "text": " Maybe the link to the survey got shared around their Discord or something. Okay. And in terms of interest,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1091.12,
      "end": 1098.72,
      "text": " there's not much to separate these. Everybody's 40 to 50%, 40 to 60% interested in all these tools."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1098.72,
      "end": 1105.44,
      "text": " Now the trend here is that CDK is, well, even though it has, in terms of interest,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1105.44,
      "end": 1110.48,
      "text": " less than the last time, it's actually top now because everything else is so close to it. And"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1110.48,
      "end": 1116,
      "text": " in terms of usage, yeah, AWS Sam usage is on the rise as is CDK, significant jump for CDK."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1116,
      "end": 1120.56,
      "text": " Serverless framework, still in there. It's just been passed out by CDK and Sam at this point."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1121.44,
      "end": 1127.52,
      "text": " Okay. So what do people think of these tools in general? CDK is very positive, would use again 46%."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1129.28,
      "end": 1133.1200000000001,
      "text": " Would not use again 11%. Okay. I'm just remembering how to interpret this chart now."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1133.68,
      "end": 1138.56,
      "text": " So yeah, CDK, very positive. I'm surprised that there aren't more people who've been burned a"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1138.56,
      "end": 1145.84,
      "text": " little bit by CDK and constructs and version incompatibilities and issues with upgrading stacks"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1145.84,
      "end": 1151.28,
      "text": " having changed CDK modules. So it's a little bit surprising. So Sam is very popular, but a little"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1151.28,
      "end": 1157.36,
      "text": " bit more negative. Serverless framework has a bigger chunk of would not use again. 24% of"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1157.36,
      "end": 1163.28,
      "text": " people say they would not use it again, but still more positive than negative. Okay. So many people"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1163.28,
      "end": 1168.3999999999999,
      "text": " are unhappy with the tools used to build serverless applications. Not very positive at all."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1168.4,
      "end": 1173.44,
      "text": " Really 15% with five stars. So I think what we're seeing here is there's a lot more to do."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1174,
      "end": 1178.48,
      "text": " We take four or five stars, that's 50%, but there's still quite a lot of people who think"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1178.48,
      "end": 1182.24,
      "text": " serverless tooling is a bit meh."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1182.8000000000002,
      "end": 1190.3200000000002,
      "text": " And I don't disagree to be honest, because if you take the experience end to end for building a serverless application, I think that there are a"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1190.3200000000002,
      "end": 1195.8400000000001,
      "text": " lot of gaps there to be filled to just give you a more cohesive experience. There isn't like one"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1195.84,
      "end": 1199.76,
      "text": " tool that can do everything for you. You need to jump across different tools. You need to figure"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1199.76,
      "end": 1204.08,
      "text": " out which tool is the best. And then every tool has its own pros and cons, and you need to learn"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1204.08,
      "end": 1209.4399999999998,
      "text": " exactly how to use them, what works, what doesn't work, where are the dangers. So I think that there"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1209.4399999999998,
      "end": 1214,
      "text": " is definitely lots to improve there and hopefully it's going to get better over the next few years."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1214,
      "end": 1217.36,
      "text": " And the developer experience in itself is going to get better as well."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1217.36,
      "end": 1222.6399999999999,
      "text": " Yeah."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1223.1200000000001,
      "end": 1228.16,
      "text": " I suppose this is why we're seeing SSD and Wing Lang and Amped and all these other tools coming out and trying to really change the system because look, people are dissatisfied in general."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1228.16,
      "end": 1233.1200000000001,
      "text": " So I understand that. I agree. And other things not mentioned then are architect,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1233.1200000000001,
      "end": 1237.68,
      "text": " which I would be interested to hear from the architect users because it looks like a really"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1237.68,
      "end": 1242.64,
      "text": " nice developer experience. I know that the use cases it targets are more specific. It"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1242.64,
      "end": 1248.3200000000002,
      "text": " doesn't try to do everything. SST, Wing Lang, serverless.tf. That is-"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1248.3200000000002,
      "end": 1250.64,
      "text": " That's I think Anton. Yeah, exactly."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1250.64,
      "end": 1255.76,
      "text": " Which is terra for modules that are more fine tuned for serverless use cases as far as I know."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1255.76,
      "end": 1259.3600000000001,
      "text": " Okay. Interesting. Yeah. I'd like to hear more about those actually."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1260,
      "end": 1265.68,
      "text": " I wonder what we have to do to reach people so that we can get data for those. Okay. Containers, Luciano, what are you seeing in"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1265.68,
      "end": 1270.88,
      "text": " the container when it comes to trends? This is not my main area of expertise."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1270.88,
      "end": 1276.48,
      "text": " So I'm going to try to give my reading, but feel free to chime in and give me your opinion as well."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1276.48,
      "end": 1282.48,
      "text": " So the main thing we can see here is that ECS is number one in terms of usage with more than 80%"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1283.28,
      "end": 1288.8,
      "text": " followed by Fargate. And again, definitely some overlapping there because Fargate, you can"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1288.8,
      "end": 1294.08,
      "text": " consider it as part of ECS if you want to. I don't know if it's really clear what is the difference"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1294.08,
      "end": 1299.76,
      "text": " there to people participating to the survey. Are we assuming that ECS is only when you provide your"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1299.76,
      "end": 1305.1200000000001,
      "text": " own EC2 instances and create your ECS cluster and Fargate is only the serverless version, or if you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1305.12,
      "end": 1309.9199999999998,
      "text": " use Fargate, you are also using ECS. Yeah, it's very difficult to read into those numbers."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1310.9599999999998,
      "end": 1316.2399999999998,
      "text": " Also, we have Lambda for running containers, but we know that you are not really running containers"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1316.2399999999998,
      "end": 1319.28,
      "text": " in Lambda. So that's another confusing piece of data there because..."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1319.28,
      "end": 1320.1599999999999,
      "text": " It's a recent number."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1320.1599999999999,
      "end": 1325.76,
      "text": " Exactly. I mean, you can package a container image to provide Lambda, all the files that are needed"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1325.76,
      "end": 1330.32,
      "text": " for your runtime, but you're not really running a container in itself. So definitely source of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1330.32,
      "end": 1336.8,
      "text": " confusion there. The interesting one is that EKS is 56%, which is not necessarily a small number,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1336.8,
      "end": 1341.4399999999998,
      "text": " but I was expecting it to be a little bit more just because in bigger enterprises, I've seen"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1341.4399999999998,
      "end": 1346.56,
      "text": " that they tend to prefer Kubernetes as an abstraction layer because generally they might be"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1346.56,
      "end": 1352.24,
      "text": " multi-cloud or they might be a little bit more concerned of portability. So Kubernetes is generally"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1352.24,
      "end": 1358.6399999999999,
      "text": " kind of a more agnostic default that you can pick just to... We're not really committed to the AWS"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1358.64,
      "end": 1361.0400000000002,
      "text": " offering 100%. So it's not bad."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1361.0400000000002,
      "end": 1366.3200000000002,
      "text": " We do have self-managed Kubernetes as well, actually. So this is represented as 40%."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1367.2800000000002,
      "end": 1371.0400000000002,
      "text": " So would you assume that these groups are more or less mutually exclusive,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1371.0400000000002,
      "end": 1374.4,
      "text": " the EKS group and the self-managed, or there's a bit of overlap?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1379.44,
      "end": 1385.3600000000001,
      "text": " I mean, they should be mutually exclusive, but just looking at the numbers, probably people interpret that as overlapping, right? Or maybe people would have bought EKS and self-managed"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1385.3600000000001,
      "end": 1387.68,
      "text": " Kubernetes, so they tend to pick both."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1387.68,
      "end": 1393.28,
      "text": " Okay. 50% on Beanstalk is a surprise to me. Yes, maybe agencies, right? I remember,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1394.0800000000002,
      "end": 1400.72,
      "text": " I mean, initially that was the target use case for Beanstalk. So maybe they still have lots of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1400.72,
      "end": 1404.4,
      "text": " websites and web applications running on Beanstalk."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1404.4,
      "end": 1407.04,
      "text": " And more on LightSail than there are on AppRunner."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1408.24,
      "end": 1410.24,
      "text": " Wow. Which is also interesting, yeah. I"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1410.24,
      "end": 1414.8,
      "text": " think LightSail is also a little bit more... I mean, AppRunner is a little bit more recent"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1414.8,
      "end": 1420.72,
      "text": " than LightSail. So maybe it's just a catching up game. Maybe we'll see that on the retention"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1420.72,
      "end": 1426.08,
      "text": " or awareness chart, like how do they compare. The other interesting thing is that we have read that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1426.08,
      "end": 1430.6399999999999,
      "text": " OpenShift, which is as far as I know, another distribution of Kubernetes. So is that an"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1430.6399999999999,
      "end": 1435.52,
      "text": " overlap with the self-managed Kubernetes or not? Good to know. Yeah."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1435.52,
      "end": 1440.56,
      "text": " Good question. I think people are using Lambda then. Okay. Maybe we can exclude Lambda,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1440.56,
      "end": 1446.48,
      "text": " but people who are using Lambda are still using Lambda. But Farghout, EKS, people are pretty"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1446.48,
      "end": 1453.52,
      "text": " happy with, it seems like. People would use it again. And AppRunner is also popular, but let's"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1453.52,
      "end": 1457.9199999999998,
      "text": " see. If we go to awareness and interest, are we seeing more... People know about AppRunner. More"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1457.9199999999998,
      "end": 1461.84,
      "text": " people know about LightSail than AppRunner. That really surprises me. But look, again, that's my"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1461.84,
      "end": 1468.96,
      "text": " filter bubble. And then interest, yeah, AppRunner is higher. So we can expect AppRunner to grow a"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1468.96,
      "end": 1473.28,
      "text": " bit. I know we're planning to do a deep dive on AppRunner. We've been planning it for a while,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1473.28,
      "end": 1482.32,
      "text": " so stay tuned. Okay. So trend is, let's see, a lot of ECS, 85% of people now instead of 77%"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1483.04,
      "end": 1488.56,
      "text": " last year. Not a huge amount of movement overall. But also EKS is growing."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1488.56,
      "end": 1492.56,
      "text": " So it's not like people are necessarily peaking one over the other. Probably it's just different workloads."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1493.36,
      "end": 1499.6799999999998,
      "text": " Yeah, that makes sense. Okay. Yeah. Okay. So let's look at positive-negative split."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1499.6799999999998,
      "end": 1502.48,
      "text": " Where's the... The negativity is most interesting to talk about, right?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1502.48,
      "end": 1507.44,
      "text": " I think so. Yeah. It's interesting to see Red Hat to be absolutely negative. I mean,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1507.44,
      "end": 1512.08,
      "text": " I never use it, so I cannot comment on... But that's..."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1512.08,
      "end": 1517.44,
      "text": " 64% of people are not interested in it, which is fine because you have to be in a specific space. But only 11% would not use it again."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1517.44,
      "end": 1520.48,
      "text": " That makes more sense. Only 2% would use it again."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1521.04,
      "end": 1525.68,
      "text": " So yeah, maybe they've worked to do their beanstalk. People want to get away from it."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1525.68,
      "end": 1533.92,
      "text": " It looks like 37% would not want to use it again. And self-managed Kubernetes is 28% would not use"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1533.92,
      "end": 1540.32,
      "text": " it again, which is pretty high, versus say EKS, which is 13% would not use it again. So I think"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1540.32,
      "end": 1545.92,
      "text": " ECS, Fargate, there's a lot of love for them in general. EKS also pretty good, but ECS and Fargate"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1545.92,
      "end": 1549.76,
      "text": " seems to be the way things are going. I suppose Fargate as well... I'm just thinking Fargate can"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1549.76,
      "end": 1555.6,
      "text": " be on EKS as well as ECS, can't it? So that could span the two spaces you can have people using"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1555.6,
      "end": 1563.28,
      "text": " Fargate with EKS. Okay, so in general, people are pretty happy with containers, given that there are"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1563.28,
      "end": 1568,
      "text": " how many are there? Many ways are there to run containers. I lost count. AWS 19, was it?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1568,
      "end": 1570.72,
      "text": " We need to ask Cori Queen, what's the latest count?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1570.72,
      "end": 1577.04,
      "text": " Yeah, yeah. Code build doesn't come up here. All right. What have we got to say about NoSQL?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1581.92,
      "end": 1589.04,
      "text": " Yes, that's another area where I don't have a huge amount of knowledge, but it's also pretty broad because in this category here, we have all kinds of databases that are not SQL. So we even"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1589.04,
      "end": 1592.3999999999999,
      "text": " have Redis- All sorts of services that aren't databases maybe?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1592.3999999999999,
      "end": 1598.6399999999999,
      "text": " Through that, yeah."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1598.6399999999999,
      "end": 1604.32,
      "text": " For instance, you have Neptune or Timestream or MemoryDB, which of course you can use them as databases, but they are very specific use cases, I would say. Not like general purpose"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1604.32,
      "end": 1609.84,
      "text": " databases, so to speak. Yeah. Would you agree with Redis being classified as a database?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1616.1599999999999,
      "end": 1619.04,
      "text": " I know that some people use it as a database, but again, there are constraints there which are important to know. I wouldn't call it a general purpose database."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1619.76,
      "end": 1624.24,
      "text": " Yeah, yeah. I'd put it in a separate category, I think in general."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1624.24,
      "end": 1629.9199999999998,
      "text": " OpenSearch is being shoehorned in as a database. And I know a lot of people do use Elasticsearch as a database, but let's look"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1629.92,
      "end": 1635.2,
      "text": " at the data. So 87% for DynamoDB, I'm not surprised because a lot of people are using it just"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1635.2,
      "end": 1639.04,
      "text": " even as a key value store for some small amount of data. You don't have to be all in on it."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1639.04,
      "end": 1644.88,
      "text": " I think Redis is a fantastic product and so useful in so many different scenarios. I'm also not"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1644.88,
      "end": 1650.3200000000002,
      "text": " surprised to see that feature highly. DocumentDB is quite far down the list, isn't it? 38%. But I"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1650.3200000000002,
      "end": 1655.8400000000001,
      "text": " suppose a lot of people using MongoDB might use Atlas or a different hosted solution or self-managed."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1656.08,
      "end": 1661.04,
      "text": " Which is also interesting that it's not here in this list because, I mean, with Atlas you can"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1661.04,
      "end": 1667.6,
      "text": " run it on AWS, right? So it could have been on this list, right? Yeah, exactly. Yeah."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1667.6,
      "end": 1673.12,
      "text": " I guess this is provided by AWS, so maybe that's the difference here. And ElastiCache is the most"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1673.12,
      "end": 1677.04,
      "text": " popular. MemoryDB we haven't tried, but I think it just got such bad press for the pricing."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1678,
      "end": 1680.8,
      "text": " That put a lot of people off. Have you tried QLDB?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1681.68,
      "end": 1688.72,
      "text": " QLDB, no, no. I skipped. Well, yeah, we did see some projects in the blockchain space,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1688.72,
      "end": 1694.8799999999999,
      "text": " but QLDB seems definitely more like a pragmatic solution for a lot of applications that ended up"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1694.8799999999999,
      "end": 1701.04,
      "text": " using blockchain because it's focused on the immutable ledger, but no, I haven't had an"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1701.04,
      "end": 1705.12,
      "text": " opportunity to use it properly. Yeah."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1705.12,
      "end": 1711.6799999999998,
      "text": " The other one that I'm curious about is Neptune because I heard very mixed feelings, so I'm curious to see what is the love and hate kind of chart there."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1711.6799999999998,
      "end": 1717.1999999999998,
      "text": " Okay. All right. Some people are most interested in DynamoDB. Yeah. This is kind of interesting,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1717.1999999999998,
      "end": 1724.6399999999999,
      "text": " but I think because DynamoDB is really the only truly no SQL database from Amazon that they"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1724.6399999999999,
      "end": 1729.9199999999998,
      "text": " provide themselves, it would be nice just to see some more non-AWS solutions in this analysis."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1730.64,
      "end": 1735.6000000000001,
      "text": " Yeah. There's not that much change in trend when it comes to usage. Okay. The positive-negative"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1735.6000000000001,
      "end": 1741.68,
      "text": " split. There's not a huge amount of would not use it again, actually. Open search is the highest,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1741.68,
      "end": 1744.8000000000002,
      "text": " which is not surprised because it's difficult, I think, to use and manage,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1744.8000000000002,
      "end": 1749.52,
      "text": " even though it's incredibly useful."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1749.52,
      "end": 1754.16,
      "text": " I'm surprised that everyone loves DynamoDB because I personally always have mixed feelings when I use DynamoDB. It's really, really good in"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1754.16,
      "end": 1761.1200000000001,
      "text": " certain circumstances. In other circumstances, it might bite you back pretty badly. I don't know."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1762.5600000000002,
      "end": 1768.4,
      "text": " I don't remember exactly which vote did I give to the questions here, but I will probably use"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1768.4,
      "end": 1774.3200000000002,
      "text": " DynamoDB again, of course, but with caution. There you go. Yes. Okay. That's fair enough."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1774.3200000000002,
      "end": 1778.4,
      "text": " And I think that would reflect a lot of people's views because there has been a bit of negativity,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1778.4,
      "end": 1783.76,
      "text": " not around DynamoDB per se, but around a bit of pushback against a single-table design,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1783.92,
      "end": 1789.84,
      "text": " principles recently. I think we saw some ETA discussion on Twitter and I think Alex DeBrie"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1791.36,
      "end": 1795.36,
      "text": " mentioned that he would use it a little bit with more caution and overused it in the past."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1795.92,
      "end": 1800.24,
      "text": " And I think it was interpreted by some people that you should just not use single-table design"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1800.24,
      "end": 1806.24,
      "text": " and Rick Houlihan got involved again. I think it's a topic maybe we should cover in a future episode,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1806.24,
      "end": 1812,
      "text": " this whole idea of single-table design and DynamoDB. But in my view, it was always something"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1812,
      "end": 1815.76,
      "text": " that's very difficult for everybody to grasp, especially for everybody on a team. So it should"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1815.76,
      "end": 1820.72,
      "text": " be used with caution, but DynamoDB itself has so many other applications and uses. I would be"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1820.72,
      "end": 1825.76,
      "text": " positive in general. Absolutely."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1825.76,
      "end": 1830.8,
      "text": " It's just that I don't know if I would consider a totally general purpose database. You need to be careful with the use cases. If you pick a good use case, it's"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1830.8,
      "end": 1836.08,
      "text": " an amazing tool, but for other use cases, it might be very difficult to achieve your goals with"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1836.08,
      "end": 1840.56,
      "text": " DynamoDB, or it might end up being very expensive or you need to write a lot of custom code."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1841.04,
      "end": 1846.48,
      "text": " Yeah. Okay. Generally, most people seem pretty happy and memento."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1846.48,
      "end": 1852,
      "text": " Yeah, it's a little bit strange, right? Because this section is titled ranking of the NoSQL databases provided by AWS,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1853.12,
      "end": 1858.8799999999999,
      "text": " which is fine. And it sticks to services that are on AWS and then others. Other NoSQL databases"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1858.8799999999999,
      "end": 1862.72,
      "text": " provided by AWS, not mentioned above, include memento. But of course, memento is not provided"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1862.72,
      "end": 1868.32,
      "text": " by AWS, it's provided by memento."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1868.32,
      "end": 1874.56,
      "text": " Maybe because some of them are ex-WS engineers, deserves to be that. I don't know. Okay."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1874.56,
      "end": 1878,
      "text": " And NoSQL databases is its own category, but we don't have a category for SQL databases, SQL databases."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1878,
      "end": 1882.1599999999999,
      "text": " Which is also interesting, yes."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1882.1599999999999,
      "end": 1887.6799999999998,
      "text": " Because I'd love to hear people talking about Aurora serverless. Yes. How many people love it, right? And will keep using it."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1888.6399999999999,
      "end": 1894.3999999999999,
      "text": " Yeah. Now we talked about... We had a whole series about event services in AWS. We did one,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1894.4,
      "end": 1900.64,
      "text": " an individual episode on SNS, SQS, EventBridge, Kinesis, Kafka. Anything else did I miss? I think"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1900.64,
      "end": 1905.3600000000001,
      "text": " those are the main ones. And then we did another episode comparing them all. So if those interest"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1905.3600000000001,
      "end": 1908.96,
      "text": " you, feel free to check them out. They're always popular from the back catalog. So Luciano,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1909.76,
      "end": 1913.0400000000002,
      "text": " if you had to guess beforehand what the most popular event service was, what would you have"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1913.0400000000002,
      "end": 1918.48,
      "text": " guessed? I was expecting SQS to be the first one just because, I don't know."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1918.48,
      "end": 1923.92,
      "text": " In my personal experience, it's something that always comes up in almost every architecture. But to be fair,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1923.92,
      "end": 1929.92,
      "text": " SNS also has so many use cases that it's not surprising either to see that. Even just for"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1929.92,
      "end": 1935.52,
      "text": " notifications. Yeah. Yeah. Alarms. And EventBridge is actually a bit surprising because it's still a"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1935.52,
      "end": 1940.72,
      "text": " relatively newer service compared to the other ones. So it is surprising that there's so much"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1940.72,
      "end": 1947.2,
      "text": " share, but to be fair, it is a great service. And it's so easy to start using it that I can see why"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1947.2,
      "end": 1950.56,
      "text": " there might be an uptake even though it's a relatively recent service."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1950.56,
      "end": 1956.24,
      "text": " What's Step Functions doing in here? Yeah. That's a bit unexpected, to be honest."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1956.24,
      "end": 1960.32,
      "text": " Yeah. Maybe they felt they had to put it somewhere. Because in some ways it's the opposite"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1960.32,
      "end": 1964.56,
      "text": " of event driven, isn't it? Even though you can have asynchronous execution patterns in there."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1964.56,
      "end": 1968.8,
      "text": " I'd surprised that only 57.9% of people are using Kinesis. People should make more use of that."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1969.44,
      "end": 1974,
      "text": " And 10% of people are still using the simple workflow service SWF, which is maybe again,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1974,
      "end": 1979.44,
      "text": " it's just use cases they can't turn off. Okay. DynamoDB streams. Yeah. People like,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1979.44,
      "end": 1983.84,
      "text": " I guess for people doing any kind of triggers, change data capture on DynamoDB,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1983.84,
      "end": 1989.6,
      "text": " that's the way to do it or with Kinesis. Yeah."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1989.6,
      "end": 1996.16,
      "text": " Here it's pretty equal the spread of retention. I think, yeah. I think every one of the services has its own specific use cases and"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1996.16,
      "end": 2000.16,
      "text": " it works really well for those use cases. So I guess if you need a queue, you're going to use"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2000.16,
      "end": 2005.44,
      "text": " SQS and you're probably going to stick to it. If you need an event system, you probably use"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2005.44,
      "end": 2010.4,
      "text": " EventBridge and you stick to it. Kinesis is more if you need high throughput, batching,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2010.4,
      "end": 2016.88,
      "text": " that kind of stuff. So it makes sense that every one of them has a high rate of retention awareness"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2016.88,
      "end": 2021.52,
      "text": " and interest. It's probably more making sure that you use the right tool for the right use case."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2022.96,
      "end": 2026.64,
      "text": " Some of these things I'd love to see the raw data. Is it possible, I wonder, to publish"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2026.64,
      "end": 2032,
      "text": " anonymized raw data for this? Is there a risk? Because 10% of people are using SWF,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2032,
      "end": 2039.2,
      "text": " simpler workflow services, which is basically deprecated by AWS for 99% of use cases in favor"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2039.2,
      "end": 2044,
      "text": " of step functions. So 10% are using it, but half of the people are interested in using it."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2046.0800000000002,
      "end": 2048.08,
      "text": " Yeah. That's a bit unexpected."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2048.08,
      "end": 2054,
      "text": " A deprecated service. All right. Any major change here? More people are using step functions."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2054,
      "end": 2058.8,
      "text": " DynamoDB Streams is a new entry on this list. It obviously wasn't in the survey last year."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2059.6,
      "end": 2065.36,
      "text": " And EventBridge is on the increase, but every... Yeah. Adoption of event-driven services seems to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2065.36,
      "end": 2072.16,
      "text": " be up everywhere. Nothing has gone down. Okay. So where's the positivity? SQS and SNS are"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2072.16,
      "end": 2077.36,
      "text": " positive. It's hard to fault them, really. I think they're just... They're the simple services that"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2077.36,
      "end": 2082,
      "text": " live up to their name along with S3. They're just fantastic services. Everything you want from a"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2082,
      "end": 2086.24,
      "text": " serverless service in those things. I think they just work and there's very little complexity to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2086.24,
      "end": 2091.36,
      "text": " them. Yeah. Kafka. I suppose Kafka is a bit more of a complex beast, even with MSK. Even with MSK"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2091.36,
      "end": 2097.28,
      "text": " serverless, we reviewed it, we talked about it, we've used it, and there's still quite a lot to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2097.28,
      "end": 2102.24,
      "text": " manage and monitor there. Incredibly powerful, but I can understand why people would be turned off if"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2102.24,
      "end": 2107.52,
      "text": " they've used it and didn't really get a great experience without putting in the effort to learn"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2107.6,
      "end": 2113.04,
      "text": " it fully. All right. Yeah. People are mostly happy. I don't know if these happiness charts are"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2113.04,
      "end": 2118.16,
      "text": " telling us too much. So our last category is AI and ML, Luciano. Yes. Let's run through it."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2118.88,
      "end": 2124.16,
      "text": " Yeah. And it's interesting that the first one is OpenAI, which is not even AWS, but that's fair."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2124.16,
      "end": 2131.2,
      "text": " Not every category is only AWS-specific services. Then we have SageMaker, which is 35%,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2132.16,
      "end": 2138.64,
      "text": " Recognition34, Textract, again, close to 34, Bedrock, which is interesting to see that almost"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2138.64,
      "end": 2145.68,
      "text": " as 30% being a very new service. And yeah, then Poly, Comprehend, Transcribe, Translate,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2145.68,
      "end": 2151.52,
      "text": " Personalize, Inference, Forecast, and Amazon Augmented AI, which I don't think I've come"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2151.52,
      "end": 2157.04,
      "text": " across it before, so not really sure. But my feeling is that these are, again, very different"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2157.04,
      "end": 2162.16,
      "text": " tools for very different use cases. So I don't know if there is really a comparison that you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2162.16,
      "end": 2167.52,
      "text": " can make between them or is more, again, which kind of use cases are people having the most"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2167.52,
      "end": 2174.32,
      "text": " and do they pick up the right tool for that use case or not? Yeah."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2174.32,
      "end": 2179.44,
      "text": " If we could influence the kind of questions or the design of the survey for next year, it would be interesting to get,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2179.44,
      "end": 2183.2,
      "text": " well, what are you using these services for? What's your application? Because I think, yeah,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2183.2,
      "end": 2187.7599999999998,
      "text": " a lot of this could be like OpenAI, 58%. That could be just people playing or using"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2187.7599999999998,
      "end": 2192.56,
      "text": " ChatGPT a few times a week, I guess. Yeah."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2192.56,
      "end": 2196.7999999999997,
      "text": " Not necessarily integrating it into applications, right? Yeah. Yeah. The retention on all these services is quite high, isn't it?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2196.7999999999997,
      "end": 2202.08,
      "text": " People are using them. People who use them tend to keep using them or want to keep using them. Awareness is"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2202.08,
      "end": 2205.8399999999997,
      "text": " pretty good across the board for these AI services, even things like Forecast. Yeah."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2206.3999999999996,
      "end": 2212.7999999999997,
      "text": " And I'm surprised a little bit, like 50, 60% of people are using OpenAI, but only the same number"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2212.96,
      "end": 2217.6800000000003,
      "text": " are interested in using it. So it's like, is there a split of people who are just completely"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2217.6800000000003,
      "end": 2223.76,
      "text": " uninterested in OpenAI? That surprises me in this day. All right. So what are the trends here?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2223.76,
      "end": 2228.6400000000003,
      "text": " Yeah, OpenAI is new there. Wasn't there last year, which makes sense. Same for Bedrock."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2229.36,
      "end": 2235.28,
      "text": " Okay. But everything, machine learning usage seems to be on the increase in general. Amazon Translate,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2236.0800000000004,
      "end": 2241.52,
      "text": " Comprehend, Transcribe, they're all increasing for this audience."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2241.52,
      "end": 2248.08,
      "text": " Now let's see what people don't like SageMaker is probably- Yeah. SageMaker would not use again 9%. Yeah. I can understand that."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2248.08,
      "end": 2252.56,
      "text": " Yeah. It's a bit of a mixed bag SageMaker, I guess, and some of the modes of execution"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2252.56,
      "end": 2256.8,
      "text": " are more complicated than I'd like them to be. They can be a bit slow to start up SageMaker"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2256.8,
      "end": 2261.04,
      "text": " endpoints, for example. We talked about this when we talk about in our episode about how to run"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2261.04,
      "end": 2265.04,
      "text": " machine learning. Yeah. So there's a lot more negative sentiment here, isn't there? Overall,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2265.04,
      "end": 2270.32,
      "text": " 50% of people are three stars or less. That's interesting."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2270.56,
      "end": 2276.1600000000003,
      "text": " Another thing I would ask is that if there is a free form for future surveys, if there would be a free form on why are you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2276.1600000000003,
      "end": 2281.1200000000003,
      "text": " not satisfied with it? Because otherwise it's just too difficult to extrapolate why people might be"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2281.1200000000003,
      "end": 2285.84,
      "text": " unhappy with these tools. I understand it would be really difficult to aggregate this kind of answers,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2285.84,
      "end": 2290.1600000000003,
      "text": " but maybe they could do some kind of manual selection to try to extrapolate what is the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2290.1600000000003,
      "end": 2296.56,
      "text": " sentiment there. Yeah, I agree. And look, I think it's well done on putting this stuff together."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2296.64,
      "end": 2301.04,
      "text": " I mean, it's difficult to get this sort of output and make sure it's statistically relevant and"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2301.04,
      "end": 2307.04,
      "text": " unbiased. It's impossible, I would imagine, but it's been running for a few years now. I guess"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2307.04,
      "end": 2312.56,
      "text": " this is the second year. And if you want to, if you didn't know about it this year, if you want to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2312.56,
      "end": 2317.2,
      "text": " be included next year, you can add your email for the 2025 and you'll get a notification when that one comes out next January."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2317.2,
      "end": 2322.72,
      "text": " Yes. And I think this brings us to the end of this episode."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2322.72,
      "end": 2327.4399999999996,
      "text": " I hope that you like this slightly different format from what we do generally. This was a little bit more"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2327.4399999999996,
      "end": 2333.2799999999997,
      "text": " open for us. We did do a little bit less preparation. So it's more of our real unfiltered"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2333.2799999999997,
      "end": 2338.48,
      "text": " opinions rather than preparing an entire set of things that we wanted to say in advance."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2338.48,
      "end": 2344,
      "text": " So hopefully that comes across well, but if not, let us know and we'll try to stick to what you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2344,
      "end": 2348.72,
      "text": " like the most and get better in the next episode. So as usual, leave us comments, reach out to us on"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2348.72,
      "end": 2353.7599999999998,
      "text": " social media and let's engage because that's what helps us to try to make this podcast better and"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2353.7599999999998,
      "end": 2363.6,
      "text": " better every single time. So thank you very much. And we'll see you in the next episode."
    }
  ]
}