{
  "speakers": {
    "spk_0": "spk_0",
    "spk_1": "spk_1"
  },
  "segments": [
    {
      "speakerLabel": "spk_0",
      "start": 0,
      "end": 7.36,
      "text": " Hello and welcome. This is AWS Bites episode 136. We were not planning on doing a pre-invent episode,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 7.5600000000000005,
      "end": 14.06,
      "text": " but there has been so much new and exciting stuff coming out of AWS in the last few weeks that we"
    },
    {
      "speakerLabel": "spk_0",
      "start": 14.06,
      "end": 18.76,
      "text": " really wanted to share our take, what we think are the best announcements, and really there has been"
    },
    {
      "speakerLabel": "spk_0",
      "start": 18.76,
      "end": 23.5,
      "text": " a fire hose of announcements. But by the way, don't worry, we're not going to cover any Gen AI stuff."
    },
    {
      "speakerLabel": "spk_0",
      "start": 23.72,
      "end": 28.76,
      "text": " This is going to be purely a Gen AI free episode, so please stick around and hopefully you'll enjoy"
    },
    {
      "speakerLabel": "spk_0",
      "start": 28.76,
      "end": 32.480000000000004,
      "text": " what we have to share. Of course, we are not going to cover every single announcement, but again,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 32.6,
      "end": 38.54,
      "text": " only what we think are our top picks from the last few weeks. My name is Luciano and today I'm joined"
    },
    {
      "speakerLabel": "spk_0",
      "start": 38.54,
      "end": 53.96,
      "text": " by Eoin for another episode of AWS Bites podcast. AWS Bytes is brought to you as always by Forteorem."
    },
    {
      "speakerLabel": "spk_0",
      "start": 54.260000000000005,
      "end": 58.68000000000001,
      "text": " Sometimes AWS can be a little bit overwhelming and you might need someone to provide you a"
    },
    {
      "speakerLabel": "spk_0",
      "start": 58.68,
      "end": 64,
      "text": " clear guidance in the fog of the cloud offerings. That's one of the four-teorem, so if that sounds"
    },
    {
      "speakerLabel": "spk_0",
      "start": 64,
      "end": 70.08,
      "text": " interesting, check us out at four-teorem.com. By the way, we have been updating our AWS Bites website."
    },
    {
      "speakerLabel": "spk_0",
      "start": 70.32,
      "end": 75.66,
      "text": " We added an amazing feature that allows you to search across all our episodes, including the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 75.66,
      "end": 81.1,
      "text": " transcripts, and this is powered by Orama Search. Our website is also all open source, so if you're"
    },
    {
      "speakerLabel": "spk_0",
      "start": 81.1,
      "end": 85.46000000000001,
      "text": " curious, you can check out how we implemented all of that. We'll have a link in the show notes to the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 85.46,
      "end": 91.47999999999999,
      "text": " repo, and hopefully with this new feature, you can find all our episodes a little bit more easily."
    },
    {
      "speakerLabel": "spk_0",
      "start": 91.83999999999999,
      "end": 96.58,
      "text": " And if there is any topic that interests you with more than 130 episodes, hopefully there will be"
    },
    {
      "speakerLabel": "spk_0",
      "start": 96.58,
      "end": 101.78,
      "text": " one episode covering what you're interested about. So please let us know what you think and if you find"
    },
    {
      "speakerLabel": "spk_0",
      "start": 101.78,
      "end": 106.89999999999999,
      "text": " this feature useful. Okay, so let's get started. I think we want to cover a lot of announcements, but"
    },
    {
      "speakerLabel": "spk_0",
      "start": 106.89999999999999,
      "end": 113.28,
      "text": " what's your first one, Eoin?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 113.28,
      "end": 120.14,
      "text": " We do a lot of stuff with step functions, and anyone who's worked with step functions will know that dealing with the JSON path stuff, input path, output path, result selector,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 120.36,
      "end": 124.9,
      "text": " can be a little bit difficult. Now there's a whole new way to deal with state in step functions."
    },
    {
      "speakerLabel": "spk_1",
      "start": 125.2,
      "end": 131.32,
      "text": " So using JSONata, which is a standard I wasn't familiar with before, you can now have much larger"
    },
    {
      "speakerLabel": "spk_1",
      "start": 131.32,
      "end": 137.2,
      "text": " state. You can have up to 10 megabytes of state stored in variables, each of which can be 256k,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 137.2,
      "end": 142.32,
      "text": " and you don't necessarily have to pass the state all the way through each step in your function."
    },
    {
      "speakerLabel": "spk_1",
      "start": 142.88,
      "end": 147.51999999999998,
      "text": " You can instead just have these variables in one state that you then reference later in another"
    },
    {
      "speakerLabel": "spk_1",
      "start": 147.51999999999998,
      "end": 152.1,
      "text": " state. Now JSONata is much more powerful than JSON path, so it supports additional functions for"
    },
    {
      "speakerLabel": "spk_1",
      "start": 152.1,
      "end": 157.88,
      "text": " transforming data, string manipulation, mathematics, doing daytime stuff, etc. And it's a lot more intuitive,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 158.44,
      "end": 162.51999999999998,
      "text": " and there's lots of like online playgrounds and stuff you can use to get familiar with it."
    },
    {
      "speakerLabel": "spk_1",
      "start": 162.52,
      "end": 167.22,
      "text": " Speaking of step functions, you can now also generate SAM and CloudFormation templates from"
    },
    {
      "speakerLabel": "spk_1",
      "start": 167.22,
      "end": 170.44,
      "text": " the step functions console. So if you want to play around with the workflow editor,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 170.86,
      "end": 173.16000000000003,
      "text": " and then generate your SAM template, you can now do that."
    },
    {
      "speakerLabel": "spk_0",
      "start": 173.36,
      "end": 179.78,
      "text": " That's really cool. My first one is EC2 autoscaling, that now is much faster when doing target tracking."
    },
    {
      "speakerLabel": "spk_0",
      "start": 180.14000000000001,
      "end": 185.08,
      "text": " Used to be with the minute granularity, I believe, and now is going to the second."
    },
    {
      "speakerLabel": "spk_0",
      "start": 185.62,
      "end": 189.98000000000002,
      "text": " So that basically gives you much faster scaling up and down depending on your threshold."
    },
    {
      "speakerLabel": "spk_0",
      "start": 189.98,
      "end": 194.88,
      "text": " So that's pretty cool if you still rely on EC2 and you do lots of autoscaling groups."
    },
    {
      "speakerLabel": "spk_0",
      "start": 195.1,
      "end": 200.48,
      "text": " But going into a more serverless one, we have a couple of news regarding Lambda,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 200.85999999999999,
      "end": 206.82,
      "text": " and specifically regarding runtimes such as Node.js and Python, because finally we have two new"
    },
    {
      "speakerLabel": "spk_0",
      "start": 206.82,
      "end": 212.78,
      "text": " amazing versions supported. So speaking of Node.js, we have Node.js 22 available for Lambda."
    },
    {
      "speakerLabel": "spk_0",
      "start": 213.12,
      "end": 216.42,
      "text": " And this is a release that I really like for a couple of reasons."
    },
    {
      "speakerLabel": "spk_0",
      "start": 216.42,
      "end": 222.6,
      "text": " The first one is that Node.js 22 gives you native fetch, so you don't need to do polyfilling anymore."
    },
    {
      "speakerLabel": "spk_0",
      "start": 223.04,
      "end": 228.5,
      "text": " And the other one that I care about even more is that Node.js 22 gives you experimental require,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 228.89999999999998,
      "end": 233.57999999999998,
      "text": " which is basically a feature that allows you to use the require for ESM."
    },
    {
      "speakerLabel": "spk_0",
      "start": 233.66,
      "end": 237.79999999999998,
      "text": " So if you are working on ESM mode, you can still require common JS modules."
    },
    {
      "speakerLabel": "spk_0",
      "start": 238.33999999999997,
      "end": 242.76,
      "text": " And this used to be a little bit of a problem for MIDI, because when we published MIDI 5,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 242.76,
      "end": 249.78,
      "text": " I think it was last year at some point, we decided to go a little bit wild and not support"
    },
    {
      "speakerLabel": "spk_0",
      "start": 249.78,
      "end": 255.73999999999998,
      "text": " common JS anymore, because we wanted to be ESM first and actually ESM only, just for the simplicity"
    },
    {
      "speakerLabel": "spk_0",
      "start": 255.73999999999998,
      "end": 260.88,
      "text": " of maintaining a package like that. And this had a little bit of a backlash in the community,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 260.88,
      "end": 265.82,
      "text": " because lots of people are still using common JS. And even if they want to migrate to ESM,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 265.92,
      "end": 272.32,
      "text": " it's not something you can just do overnight. So lots of people were effectively stuck with MIDI 4."
    },
    {
      "speakerLabel": "spk_0",
      "start": 272.32,
      "end": 279.04,
      "text": " Now, to be fair, MIDI 5 wasn't really adding anything new. So sticking with MIDI 4 was effectively"
    },
    {
      "speakerLabel": "spk_0",
      "start": 279.04,
      "end": 287.6,
      "text": " the same experience. And we kept maintaining both for a long time. But now you can just use MIDI 5 and"
    },
    {
      "speakerLabel": "spk_0",
      "start": 287.6,
      "end": 293.3,
      "text": " stay up to date with the latest version and still use common JS if you have to. By the way,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 293.34,
      "end": 299.96,
      "text": " we just published MIDI 6 as well, which comes with some polish and some improvement. So check it out,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 299.96,
      "end": 306.12,
      "text": " we'll have the release note in the show notes if you're curious. But yeah, excited about Node.js 22"
    },
    {
      "speakerLabel": "spk_0",
      "start": 306.12,
      "end": 312.71999999999997,
      "text": " and MIDI 6 as well. And speaking about another runtime, Python as well got a new major release of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 312.71999999999997,
      "end": 319.9,
      "text": " the runtime. Now Python 3.13 is available as well. Now I don't use Python nearly as much as Node.js,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 320.15999999999997,
      "end": 324.96,
      "text": " so I wouldn't be able to say which new amazing features are becoming available with this new release."
    },
    {
      "speakerLabel": "spk_0",
      "start": 324.96,
      "end": 330.15999999999997,
      "text": " But I'm sure that if you are a Pythonista, you are excited about this one. And I'm sure that there"
    },
    {
      "speakerLabel": "spk_0",
      "start": 330.15999999999997,
      "end": 333.46,
      "text": " are some amazing features that you can start to use in your Lambdas as well."
    },
    {
      "speakerLabel": "spk_1",
      "start": 333.76,
      "end": 340.44,
      "text": " I know that one of the things that 3.13 introduces, but it's still behind an experimental flag,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 340.62,
      "end": 345.56,
      "text": " is removing the GIL, the global interpreter lock from Python and adding free threading support."
    },
    {
      "speakerLabel": "spk_1",
      "start": 345.56,
      "end": 352.62,
      "text": " But it's really like the first step on the journey of adding that free threading support. So it doesn't"
    },
    {
      "speakerLabel": "spk_1",
      "start": 352.62,
      "end": 357.82,
      "text": " apply if you're using Lambda because you won't get that experimental flag. But I think there's a lot"
    },
    {
      "speakerLabel": "spk_1",
      "start": 357.82,
      "end": 363.04,
      "text": " of other improvements, nice language typing improvements, and also just performance improvements"
    },
    {
      "speakerLabel": "spk_1",
      "start": 363.04,
      "end": 363.44,
      "text": " as well."
    },
    {
      "speakerLabel": "spk_0",
      "start": 363.64,
      "end": 368.94,
      "text": " That's nice. I wonder when the cold start benchmarks are going to come out, if there is any major"
    },
    {
      "speakerLabel": "spk_0",
      "start": 368.94,
      "end": 375.21999999999997,
      "text": " revelation. But I don't know anything about that just yet. Okay, the next one I have is another"
    },
    {
      "speakerLabel": "spk_0",
      "start": 375.21999999999997,
      "end": 381.04,
      "text": " exciting one in the serverless space, which is Aurora serverless now scales to zero, which has been"
    },
    {
      "speakerLabel": "spk_0",
      "start": 381.04,
      "end": 386.92,
      "text": " another big complaint for a long time. Because when Aurora serverless v2 was announced, everyone was"
    },
    {
      "speakerLabel": "spk_0",
      "start": 386.92,
      "end": 392.8,
      "text": " basically saying, well, this is not really serverless because it doesn't scale to zero. And now this is no"
    },
    {
      "speakerLabel": "spk_0",
      "start": 392.8,
      "end": 398.3,
      "text": " longer the case. Now you can scale to zero and scale back up again. Basically takes around 15-20 seconds."
    },
    {
      "speakerLabel": "spk_0",
      "start": 398.3,
      "end": 404.72,
      "text": " So that makes Aurora truly a serverless database. And that's really exciting news. And I'm looking"
    },
    {
      "speakerLabel": "spk_0",
      "start": 404.72,
      "end": 411.56,
      "text": " forward to start to play around with Aurora serverless in, I guess, more context, because before I was only"
    },
    {
      "speakerLabel": "spk_0",
      "start": 411.56,
      "end": 418.36,
      "text": " using it mostly for production use cases. Now it starts to become the case that you can use it even for"
    },
    {
      "speakerLabel": "spk_0",
      "start": 418.36,
      "end": 422.8,
      "text": " development environments, because it's going to scale to zero when you are not actually using it."
    },
    {
      "speakerLabel": "spk_0",
      "start": 422.90000000000003,
      "end": 423.58000000000004,
      "text": " What else do we have?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 424.14,
      "end": 427.90000000000003,
      "text": " Well, on the topic of Lambda, Snapstart has been available for Java for a while."
    },
    {
      "speakerLabel": "spk_1",
      "start": 427.9,
      "end": 434.17999999999995,
      "text": " And now it's available for Python and .NET. And we got access to the beta for this before launch,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 434.17999999999995,
      "end": 439.29999999999995,
      "text": " and we were able to run some benchmarks. And with some heavy enough Python functions,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 439.46,
      "end": 443.67999999999995,
      "text": " we were able to get a 4x speedup, which is pretty impressive. You might remember we talked about"
    },
    {
      "speakerLabel": "spk_1",
      "start": 443.67999999999995,
      "end": 448.29999999999995,
      "text": " Python cold start performance in a previous episode. So this is a really a good thing."
    },
    {
      "speakerLabel": "spk_1",
      "start": 448.52,
      "end": 452.15999999999997,
      "text": " Now, there's always a downside when you've got these new features, there's always some trade-offs to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 452.16,
      "end": 458.24,
      "text": " consider. So just to mention, you have to use published versions for functions."
    },
    {
      "speakerLabel": "spk_1",
      "start": 458.52000000000004,
      "end": 463.94,
      "text": " So you can't just use $latest. And it's only available for zip packaged functions. It's not"
    },
    {
      "speakerLabel": "spk_1",
      "start": 463.94,
      "end": 469.54,
      "text": " available for OCI container images at the moment. Now, some people were surprised by the fact that"
    },
    {
      "speakerLabel": "spk_1",
      "start": 469.54,
      "end": 474.54,
      "text": " you have to pay extra for Snapstart for Python and .NET, because that wasn't the case with Java. But"
    },
    {
      "speakerLabel": "spk_1",
      "start": 474.54,
      "end": 480.8,
      "text": " since Lambda has to store your snapshots, and then when it's restoring them, it has to allocate resources,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 481.6,
      "end": 487.18,
      "text": " I suppose it makes sense. And maybe Java developers were just lucky to get a bit of a free ride on that"
    },
    {
      "speakerLabel": "spk_1",
      "start": 487.18,
      "end": 492.12,
      "text": " one as it was introduced. But yeah, I think it's definitely worth checking it out if you're really"
    },
    {
      "speakerLabel": "spk_1",
      "start": 492.12,
      "end": 498.20000000000005,
      "text": " concerned about cold starts in Python and .NET. Now, another thing we covered in a previous episode"
    },
    {
      "speakerLabel": "spk_1",
      "start": 498.2,
      "end": 505.15999999999997,
      "text": " was Mountpoint for S3. We did a whole episode on it in 1995. Right now, you can use, you can,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 505.56,
      "end": 511.42,
      "text": " now you have extra caching available for Mountpoint for S3. So you can use an Express One Zone bucket"
    },
    {
      "speakerLabel": "spk_1",
      "start": 511.42,
      "end": 517.76,
      "text": " as a read cache for Mountpoint. So I think Express One Zone was announced, announced that reinvented last"
    },
    {
      "speakerLabel": "spk_1",
      "start": 517.76,
      "end": 522.48,
      "text": " year. It's a single availability zone bucket. So you don't get the high availability, but you get much"
    },
    {
      "speakerLabel": "spk_1",
      "start": 522.48,
      "end": 528.14,
      "text": " better performance. So if you're using this as a read cache with Mountpoint, then your reads will be up to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 528.14,
      "end": 533.08,
      "text": " seven times faster, they say. And speaking of Express One Zone again, there's a really cool new"
    },
    {
      "speakerLabel": "spk_1",
      "start": 533.08,
      "end": 540.06,
      "text": " feature for this, which is that you can now append data to existing objects. So if you're doing things"
    },
    {
      "speakerLabel": "spk_1",
      "start": 540.06,
      "end": 545.72,
      "text": " like creating log files and appending to them, or doing live video streaming, this could definitely"
    },
    {
      "speakerLabel": "spk_1",
      "start": 545.72,
      "end": 550.48,
      "text": " be very useful. And then how do you do it? Well, it's actually just a normal put object call,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 550.6999999999999,
      "end": 558.04,
      "text": " and now you just can add an offset header, and that will write an append block to your object."
    },
    {
      "speakerLabel": "spk_1",
      "start": 558.14,
      "end": 563.8,
      "text": " And on the topic of S3, if you have a serious bucket addiction, AWS definitely has you covered,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 563.92,
      "end": 567.96,
      "text": " because you can now create up to 1 million buckets. Coincidentally, this is about the same"
    },
    {
      "speakerLabel": "spk_1",
      "start": 567.96,
      "end": 573.48,
      "text": " number of announcements AWS made in the last year, featuring the phrase Amazon Q. Now, like any good"
    },
    {
      "speakerLabel": "spk_1",
      "start": 573.48,
      "end": 579.02,
      "text": " enabler, they give you the first 2,000 buckets for free, but there is actually a price per bucket"
    },
    {
      "speakerLabel": "spk_1",
      "start": 579.02,
      "end": 582.98,
      "text": " after that, so don't go to town on your 1 million bucket limit."
    },
    {
      "speakerLabel": "spk_1",
      "start": 582.98,
      "end": 589.48,
      "text": " The next one I have is about DynamoDB, and it's about price slashing."
    },
    {
      "speakerLabel": "spk_0",
      "start": 589.76,
      "end": 594.9,
      "text": " Because now, if you use on-demand throughput, it's half the price than what it used to be. And also,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 595,
      "end": 600.44,
      "text": " global tables got interesting price slashing, because now they are one-third of the price."
    },
    {
      "speakerLabel": "spk_0",
      "start": 600.64,
      "end": 606.4,
      "text": " So this is super interesting to me, because I always try to use on-demand, but then I'm always a"
    },
    {
      "speakerLabel": "spk_0",
      "start": 606.4,
      "end": 612.12,
      "text": " little bit concerned about price in production. And then I try to think, okay, where is the point"
    },
    {
      "speakerLabel": "spk_0",
      "start": 612.12,
      "end": 617.5,
      "text": " where I need to start moving to provision mode and do all the calculation, and then make sure I"
    },
    {
      "speakerLabel": "spk_0",
      "start": 617.5,
      "end": 622.5,
      "text": " scale accordingly and manage all of the stuff that, with the serverless mindset, I really don't want"
    },
    {
      "speakerLabel": "spk_0",
      "start": 622.5,
      "end": 627.34,
      "text": " to manage. I just want the system to do everything on its own and be cheap at the same time. So I think"
    },
    {
      "speakerLabel": "spk_0",
      "start": 627.34,
      "end": 631.0799999999999,
      "text": " now we are getting a little bit closer to that vision, and maybe I wouldn't have to worry"
    },
    {
      "speakerLabel": "spk_0",
      "start": 631.08,
      "end": 637.1,
      "text": " so much anymore about provision concurrency. So I think now it's going to be easy for most people"
    },
    {
      "speakerLabel": "spk_0",
      "start": 637.1,
      "end": 641.94,
      "text": " to just stick with on-demand throughput and have reasonable prices. Probably they would be even"
    },
    {
      "speakerLabel": "spk_0",
      "start": 641.94,
      "end": 647.5,
      "text": " cheaper than on-demand prices for most cases, and they will scale much better without you having to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 647.5,
      "end": 652.12,
      "text": " do a lot of homework on your site. We'll have a link on the show notes if you are curious to read"
    },
    {
      "speakerLabel": "spk_0",
      "start": 652.12,
      "end": 656.72,
      "text": " more about this particular announcement. But moving on to the next one, we have ALB headers,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 656.72,
      "end": 662.8000000000001,
      "text": " which is an interesting feature that seems like a small thing, but can actually be quite useful."
    },
    {
      "speakerLabel": "spk_0",
      "start": 663.24,
      "end": 668.72,
      "text": " But basically now with application load balancers, you can inject custom headers when effectively"
    },
    {
      "speakerLabel": "spk_0",
      "start": 668.72,
      "end": 674.1,
      "text": " targeting your load balancer targets."
    },
    {
      "speakerLabel": "spk_1",
      "start": 674.1,
      "end": 679.62,
      "text": " It was a pretty unexpected move because AWS has given Cognito a lot of attention and just announced a whole lot of new features. And another unusual move"
    },
    {
      "speakerLabel": "spk_1",
      "start": 679.62,
      "end": 684.9200000000001,
      "text": " was that they added these kind of SaaS-like pricing tiers, which is a bit of a departure from AWS's"
    },
    {
      "speakerLabel": "spk_1",
      "start": 684.92,
      "end": 692.42,
      "text": " usual pricing model. So now there are three tiers, Lite, Essential, and Plus. So Lite is essentially"
    },
    {
      "speakerLabel": "spk_1",
      "start": 692.42,
      "end": 697.8199999999999,
      "text": " what you used to get before. It's the legacy tier, really. And then all the new features are in the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 697.8199999999999,
      "end": 704,
      "text": " new tiers. So Essential will give you a new managed login UI. It has support for passwordless"
    },
    {
      "speakerLabel": "spk_1",
      "start": 704,
      "end": 709.92,
      "text": " authentication, and it allows you to do things like customize access tokens as well. So if you're creating"
    },
    {
      "speakerLabel": "spk_1",
      "start": 709.92,
      "end": 714.3,
      "text": " a new user pool now, it'll be in the Essentials tier rather than the Lite tier. And then there's a"
    },
    {
      "speakerLabel": "spk_1",
      "start": 714.3,
      "end": 719.12,
      "text": " the plus tier is essentially for enterprise features like compromised password detection,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 719.4799999999999,
      "end": 725.9,
      "text": " audit logging, and risk-based adaptive authentication, which is basically trying to detect if it may be a"
    },
    {
      "speakerLabel": "spk_1",
      "start": 725.9,
      "end": 732.26,
      "text": " malicious login and seeking extra verification from the user. So going on to the new features then,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 732.74,
      "end": 737.5,
      "text": " the managed login is an interesting one because previously we've used the hosted UI that they used"
    },
    {
      "speakerLabel": "spk_1",
      "start": 737.5,
      "end": 744.06,
      "text": " to have. It's still there, but as part of the Lite package. The new managed sign-in allows you to do"
    },
    {
      "speakerLabel": "spk_1",
      "start": 744.06,
      "end": 749.52,
      "text": " much more richer UI customization. I think there's a drag and drop UI as well. So I'm looking forward to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 749.52,
      "end": 754.76,
      "text": " looking at that and seeing how well that works. Then you also get passwordless authentication with"
    },
    {
      "speakerLabel": "spk_1",
      "start": 754.76,
      "end": 763.44,
      "text": " pass keys, magic links, and SMS. And those are really, I think, great new additions. It's good to see"
    },
    {
      "speakerLabel": "spk_1",
      "start": 763.44,
      "end": 768.86,
      "text": " Cognito getting this level of attention. There's also some add-ons that you can pay for, like if you"
    },
    {
      "speakerLabel": "spk_1",
      "start": 768.86,
      "end": 772.72,
      "text": " want to do machine-to-machine authorization. And then there's also a whole set of packages you can"
    },
    {
      "speakerLabel": "spk_1",
      "start": 772.72,
      "end": 777.6800000000001,
      "text": " buy at like fixed price per month that will allow you to get higher throughput on specific operations"
    },
    {
      "speakerLabel": "spk_1",
      "start": 777.6800000000001,
      "end": 782.1800000000001,
      "text": " you want. So if you're really running Cognito at scale, that's definitely worth a look. Now,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 782.6600000000001,
      "end": 788.84,
      "text": " Lite and Essentials both have a free tier for 1,000, sorry, not 1,000, but 10,000 monthly active users."
    },
    {
      "speakerLabel": "spk_1",
      "start": 788.84,
      "end": 793.84,
      "text": " That's still a pretty generous free tier, I think. Now, the old Cognito pricing model,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 794.0600000000001,
      "end": 799.1,
      "text": " people often said it was ridiculously cheap. It was a real competitive advantage, actually,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 799.4,
      "end": 805.2800000000001,
      "text": " that kind of allowed people to adopt Cognito and take some of the pain that was associated with the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 805.2800000000001,
      "end": 810.8000000000001,
      "text": " Cognito developer experience. But I think if they are going to improve that developer experience and"
    },
    {
      "speakerLabel": "spk_1",
      "start": 810.8000000000001,
      "end": 817.48,
      "text": " add new features and give it continuous love, then it makes sense to fund that work by having a more"
    },
    {
      "speakerLabel": "spk_1",
      "start": 817.48,
      "end": 823.82,
      "text": " sensible pricing tier. So the pricing difference, Essentials is about two and a half times per user"
    },
    {
      "speakerLabel": "spk_1",
      "start": 823.82,
      "end": 830.6,
      "text": " compared to the old pricing. So I don't think it's outrageous, but you'll have to do your own"
    },
    {
      "speakerLabel": "spk_1",
      "start": 830.6,
      "end": 834.3000000000001,
      "text": " mathematics on it. And then if you're using the enterprise tier, it seems to be about an extra"
    },
    {
      "speakerLabel": "spk_1",
      "start": 834.3000000000001,
      "end": 841.4,
      "text": " half a cent for monthly active user. The next one I have is VPC block public access."
    },
    {
      "speakerLabel": "spk_0",
      "start": 841.4,
      "end": 847.46,
      "text": " So if you heard about block public access for S3, it's basically the same thing for VPC, which means that you have a"
    },
    {
      "speakerLabel": "spk_0",
      "start": 847.46,
      "end": 853.98,
      "text": " central control that blocks internet access to your VPC, regardless of any internet gateway that you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 853.98,
      "end": 859.98,
      "text": " can have in those VPCs. So pretty interesting if you are a network security nerd, I think you might"
    },
    {
      "speakerLabel": "spk_0",
      "start": 859.98,
      "end": 865.2,
      "text": " like this one. And sticking with networking, we have another interesting feature announcement"
    },
    {
      "speakerLabel": "spk_0",
      "start": 865.2,
      "end": 872.1800000000001,
      "text": " involving Lattice. So we spoke about VPC Lattice in episode 88. So check that out if you want to have"
    },
    {
      "speakerLabel": "spk_0",
      "start": 872.18,
      "end": 877.9599999999999,
      "text": " refresher. And we talked about how you need to have a load balancer in front of an ECS in order to use"
    },
    {
      "speakerLabel": "spk_0",
      "start": 877.9599999999999,
      "end": 882.78,
      "text": " it with Lattice. And we also said that maybe that would be improved in the future. So you wouldn't"
    },
    {
      "speakerLabel": "spk_0",
      "start": 882.78,
      "end": 888.16,
      "text": " have to pay the extra cost and latency. Now that future is finally here. I don't know if it was just"
    },
    {
      "speakerLabel": "spk_0",
      "start": 888.16,
      "end": 892.52,
      "text": " a coincidence or maybe somebody at AWS actually listened to that episode. We'd like to think that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 892.52,
      "end": 898.6,
      "text": " they did. But yeah, you can now plug ECS directly into Lattice without a load balance. So yeah,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 898.66,
      "end": 902.6999999999999,
      "text": " again, check out the announcement in the show notes if you're curious to find out more."
    },
    {
      "speakerLabel": "spk_1",
      "start": 902.96,
      "end": 906.36,
      "text": " Yeah, that's a good one. I think Lattice is underappreciated and underutilized. That was a"
    },
    {
      "speakerLabel": "spk_1",
      "start": 906.36,
      "end": 911.04,
      "text": " blocker for people in the past. I can see more adoption now. There's a new type of policy. We've"
    },
    {
      "speakerLabel": "spk_1",
      "start": 911.04,
      "end": 915.98,
      "text": " also done episodes, I think, on all of the different types of policy you can have with IAM and SEPs,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 916.04,
      "end": 920.84,
      "text": " permissions, boundaries. And now we have another one. So it's called resource control policies."
    },
    {
      "speakerLabel": "spk_1",
      "start": 920.84,
      "end": 925.94,
      "text": " And it's essentially like a service control policy, but for resources. So service control"
    },
    {
      "speakerLabel": "spk_1",
      "start": 925.94,
      "end": 931.26,
      "text": " policies are policies that apply to all the principles in an account or in an organizational"
    },
    {
      "speakerLabel": "spk_1",
      "start": 931.26,
      "end": 936.64,
      "text": " unit. RCPs, resource control policies, can be used to apply policies to all supported resources"
    },
    {
      "speakerLabel": "spk_1",
      "start": 936.64,
      "end": 943.46,
      "text": " like S3 buckets, SQSQs, that sort of thing. So with it, you can do things like centrally deny access"
    },
    {
      "speakerLabel": "spk_1",
      "start": 943.46,
      "end": 948.76,
      "text": " to buckets from outside your organization. So it's a pretty nice way to do it rather than having to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 948.76,
      "end": 954.54,
      "text": " monitor each individual bucket's resource policy. Now, we seem to be getting a lot of free stuff"
    },
    {
      "speakerLabel": "spk_1",
      "start": 954.54,
      "end": 960.64,
      "text": " and price reductions in this pre-reinvent, which is really nice. And one of them is that event"
    },
    {
      "speakerLabel": "spk_1",
      "start": 960.64,
      "end": 965.42,
      "text": " bridge is even faster. I think back in episode 23, we talked about event bridge. And one of the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 965.42,
      "end": 970.76,
      "text": " points we made then was how it was not the best compared to SNS, Kinesis, et cetera, when it came"
    },
    {
      "speakerLabel": "spk_1",
      "start": 970.76,
      "end": 974.66,
      "text": " to latency. That was over two years ago. And performance has now improved massively,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 974.66,
      "end": 980.8,
      "text": " like over 90%, I think. So you can now expect delivery in around 130 milliseconds,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 981.3,
      "end": 983.78,
      "text": " which is pretty cool. So hats off to the event bridge team."
    },
    {
      "speakerLabel": "spk_1",
      "start": 984.14,
      "end": 991.36,
      "text": " Nice. And the last one I have is AppSync WebSocket support. So AppSync now has a new way to do WebSockets."
    },
    {
      "speakerLabel": "spk_0",
      "start": 991.4399999999999,
      "end": 997.9399999999999,
      "text": " Previously, you had three options for WebSockets on AWS, AWS IoT, API Gateway, and AppSync with GraphQL."
    },
    {
      "speakerLabel": "spk_0",
      "start": 998.48,
      "end": 1003.64,
      "text": " Now there is a whole dedicated service called AppSync Events, which should be much simpler to set up"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1003.64,
      "end": 1010.72,
      "text": " than all the other options I mentioned. So that's basically all we have for our pre-invent selection."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1011.08,
      "end": 1016.4,
      "text": " There might be maybe some last minute pre-invent announcement. Otherwise, we'd just be curious to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1016.4,
      "end": 1021.02,
      "text": " see what comes up at re-invent. Oh, and by the way, I will personally go and attend re-invent."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1021.4,
      "end": 1025.24,
      "text": " So if you are also there and you would like to catch up in person, I'd love to do that."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1025.24,
      "end": 1030.42,
      "text": " So please reach out on our social channel and let's schedule something together."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1030.42,
      "end": 1036.4,
      "text": " So that's all we have for today. I'm curious to know if you have any favorite pre-invent announcement."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1036.7,
      "end": 1040.3400000000001,
      "text": " Let us know as well. And as always, we'd love to hear your opinion."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1040.74,
      "end": 1042.9,
      "text": " And until that, we'll see you next time."
    }
  ]
}