{
  "speakers": {
    "spk_0": "spk_0",
    "spk_1": "spk_1"
  },
  "segments": [
    {
      "speakerLabel": "spk_0",
      "start": 0,
      "end": 4.0200000000000005,
      "text": " What if we told you that AWS has its own version of Killed by Google?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 4.5600000000000005,
      "end": 10.74,
      "text": " It's actually an AWS official page that lists which products are being retired, phased out, or closed to new customers."
    },
    {
      "speakerLabel": "spk_0",
      "start": 11.06,
      "end": 16.94,
      "text": " And if you actively use AWS and you use a broad range of services, this is a page you should probably bookmark."
    },
    {
      "speakerLabel": "spk_0",
      "start": 17.2,
      "end": 24.34,
      "text": " Today we're talking about the AWS product lifecycle, what it is, what you'll find there, and how it can help you to avoid nasty surprises."
    },
    {
      "speakerLabel": "spk_0",
      "start": 24.34,
      "end": 30.58,
      "text": " We'll also look at some products that are already on their way out, and maybe even some more predictions on what could be next."
    },
    {
      "speakerLabel": "spk_0",
      "start": 31.06,
      "end": 35.66,
      "text": " Welcome to AWS Bites, I'm Eoin, I'm here again with Luciano, let's jump in."
    },
    {
      "speakerLabel": "spk_0",
      "start": 43.4,
      "end": 47.92,
      "text": " This episode is brought to you by 4Theorem, stay tuned for more about that at the end of the show."
    },
    {
      "speakerLabel": "spk_0",
      "start": 48.06,
      "end": 50.5,
      "text": " So what is the AWS product lifecycle page?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 50.5,
      "end": 57.66,
      "text": " Well, AWS quietly launched this page, which is a bit like a changelog for AWS product retirements."
    },
    {
      "speakerLabel": "spk_0",
      "start": 58.2,
      "end": 59.1,
      "text": " The link will be in the show notes."
    },
    {
      "speakerLabel": "spk_0",
      "start": 59.74,
      "end": 71.44,
      "text": " It was only announced in May of this year, and there you'll find products that are being deprecated, services closed to new customers, products entering long-term support, and explicit end-of-life dates."
    },
    {
      "speakerLabel": "spk_0",
      "start": 72.1,
      "end": 76.5,
      "text": " Now, unlike Killed by Google, this isn't a rage-fueled graveyard."
    },
    {
      "speakerLabel": "spk_0",
      "start": 76.5,
      "end": 79.66,
      "text": " It's an attempt to be a transparent and structured overview."
    },
    {
      "speakerLabel": "spk_0",
      "start": 80.02,
      "end": 83.42,
      "text": " It comes from AWS, and we're honestly happy that they made this official."
    },
    {
      "speakerLabel": "spk_0",
      "start": 84.16,
      "end": 93.28,
      "text": " So it gives us developers, teams, enterprises a clear roadmap to avoid surprises, sunsets, and to be able to plan migrations with some time to spare."
    },
    {
      "speakerLabel": "spk_0",
      "start": 93.82,
      "end": 96.53999999999999,
      "text": " So why do you think they might be doing it, Luciano?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 96.54,
      "end": 105.7,
      "text": " Yeah, it's interesting because I think one of the things that I always loved about AWS is that they used to be famous for keeping services running pretty much forever, no matter what."
    },
    {
      "speakerLabel": "spk_1",
      "start": 106.2,
      "end": 110.12,
      "text": " And one example is SimpleDB that is still available, if I'm not mistaken."
    },
    {
      "speakerLabel": "spk_1",
      "start": 110.9,
      "end": 114.9,
      "text": " Although I think at this point everyone is using replacements like DynamoDB, right?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 114.9,
      "end": 125.4,
      "text": " And, yeah, I think this used to be a thing that everyone would be saying in the last few years about AWS, like they're never going to deprecate any service, so it's super stable and everything."
    },
    {
      "speakerLabel": "spk_1",
      "start": 126,
      "end": 131.62,
      "text": " But, of course, we know that this is not going to be sustainable forever, and AWS at some point realized that as well."
    },
    {
      "speakerLabel": "spk_1",
      "start": 131.62,
      "end": 140.70000000000002,
      "text": " And there was a moment where AWS started to deprecate a few services, and there was a little bit of backlash."
    },
    {
      "speakerLabel": "spk_1",
      "start": 141.44,
      "end": 148.48000000000002,
      "text": " So, yeah, why do you think that AWS has been cleaning up more and more lately?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 149.08,
      "end": 152.96,
      "text": " Well, we can only guess, but some of the reasons might be it had to happen sometime."
    },
    {
      "speakerLabel": "spk_0",
      "start": 153.34,
      "end": 158.58,
      "text": " You can't just keep adding services and support them without having enormous maintenance costs on the AWS side."
    },
    {
      "speakerLabel": "spk_0",
      "start": 158.58,
      "end": 167.64000000000001,
      "text": " They also laid off quite a few staff last year, and you can imagine that this means you have to focus on certain product priorities and cutting back on others."
    },
    {
      "speakerLabel": "spk_0",
      "start": 168.5,
      "end": 173.96,
      "text": " I also wonder if AI and Gen AI in particular has caused a big focus shift."
    },
    {
      "speakerLabel": "spk_0",
      "start": 174.24,
      "end": 180.20000000000002,
      "text": " We know that so many announcements and so much marketing from AWS over the past year or so has been around AI, Q, RedRock."
    },
    {
      "speakerLabel": "spk_0",
      "start": 180.66000000000003,
      "end": 185.32000000000002,
      "text": " So this sudden shift must mean that some things have to hit the scrap heap to make room."
    },
    {
      "speakerLabel": "spk_0",
      "start": 185.32000000000002,
      "end": 188,
      "text": " Should we talk a bit about what's on this product lifecycle page?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 188,
      "end": 192.46,
      "text": " A lot of people might be surprised to hear what's on there and what's already on the chopping block."
    },
    {
      "speakerLabel": "spk_1",
      "start": 192.86,
      "end": 193.08,
      "text": " Yes."
    },
    {
      "speakerLabel": "spk_1",
      "start": 193.26,
      "end": 194.66,
      "text": " So this is at the time of the recording."
    },
    {
      "speakerLabel": "spk_1",
      "start": 194.82,
      "end": 198.56,
      "text": " Of course, we expect this page to evolve over time, so always keep an eye."
    },
    {
      "speakerLabel": "spk_1",
      "start": 199.36,
      "end": 205.98,
      "text": " And if we are listening right now as we just published this episode, hopefully this is still going to be pretty relevant."
    },
    {
      "speakerLabel": "spk_1",
      "start": 206.58,
      "end": 209.54,
      "text": " So the important thing, I think, is that there are different categories."
    },
    {
      "speakerLabel": "spk_1",
      "start": 209.76,
      "end": 213.18,
      "text": " So the first one is services closing access to new customers."
    },
    {
      "speakerLabel": "spk_1",
      "start": 213.18,
      "end": 219.74,
      "text": " So the idea is that if you are using a service already today, that service is not going to go away for you immediately."
    },
    {
      "speakerLabel": "spk_1",
      "start": 219.74,
      "end": 224.78,
      "text": " But it's more if somebody is getting a new account, that service is not going to be available in that new account."
    },
    {
      "speakerLabel": "spk_1",
      "start": 224.78,
      "end": 237.58,
      "text": " So that is, of course, a strategy that AWS puts in place to give existing customers time to migrate out while they don't want, of course, to overload themselves with new customers as they are trying to phase out a product."
    },
    {
      "speakerLabel": "spk_1",
      "start": 238.14,
      "end": 242.98,
      "text": " And just to give you one example of what's there right now, there is Amazon Timestream for live analytics."
    },
    {
      "speakerLabel": "spk_1",
      "start": 242.98,
      "end": 250.5,
      "text": " And if you look at the official docs, it's interesting that they are already recommending to use Amazon Timestream for influx DB as an alternative."
    },
    {
      "speakerLabel": "spk_1",
      "start": 250.98,
      "end": 253.39999999999998,
      "text": " So there is already some kind of a migration plan."
    },
    {
      "speakerLabel": "spk_1",
      "start": 253.94,
      "end": 259.7,
      "text": " I'm not sure if there are additional tutorials or guides from AWS, but I wouldn't be surprised if you search for them."
    },
    {
      "speakerLabel": "spk_1",
      "start": 259.74,
      "end": 261.9,
      "text": " Maybe you'll find something like that."
    },
    {
      "speakerLabel": "spk_1",
      "start": 262.2,
      "end": 266.09999999999997,
      "text": " But this is just to give you an example of what might be appearing in this section."
    },
    {
      "speakerLabel": "spk_1",
      "start": 266.1,
      "end": 270.32000000000005,
      "text": " And, yeah, if you're using Timestream, I think Timestream is still available."
    },
    {
      "speakerLabel": "spk_1",
      "start": 270.5,
      "end": 274.98,
      "text": " It's more this particular variation of Timestream is going to go away."
    },
    {
      "speakerLabel": "spk_1",
      "start": 275.06,
      "end": 277.58000000000004,
      "text": " So just be aware if you are a user of Timestream."
    },
    {
      "speakerLabel": "spk_1",
      "start": 278.1,
      "end": 282.26000000000005,
      "text": " I'm personally not an expert in Timestream, so hopefully I'm not saying anything misleading."
    },
    {
      "speakerLabel": "spk_1",
      "start": 283.08000000000004,
      "end": 286.82000000000005,
      "text": " Now, another category is services announcing end of support."
    },
    {
      "speakerLabel": "spk_1",
      "start": 287.1,
      "end": 291.34000000000003,
      "text": " And this is the one that I think right now has the biggest list of products."
    },
    {
      "speakerLabel": "spk_1",
      "start": 291.34,
      "end": 296,
      "text": " And there are services that are officially heading for retirement."
    },
    {
      "speakerLabel": "spk_1",
      "start": 296.23999999999995,
      "end": 299.2,
      "text": " So AWS is starting to provide migration paths and timelines."
    },
    {
      "speakerLabel": "spk_1",
      "start": 299.7,
      "end": 305.32,
      "text": " And this is where you really want to pay attention because, of course, the sooner you're going to catch something there,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 305.38,
      "end": 310.35999999999996,
      "text": " the more prepared you can be to figure out what is a strategy to move out from those services if you're using them."
    },
    {
      "speakerLabel": "spk_1",
      "start": 310.59999999999997,
      "end": 316.12,
      "text": " Now, to give you an example, the first one worth mentioning is Amazon Pinpoint, just because I can say we told you."
    },
    {
      "speakerLabel": "spk_1",
      "start": 316.84,
      "end": 317.76,
      "text": " Of course, I'm joking."
    },
    {
      "speakerLabel": "spk_1",
      "start": 317.76,
      "end": 322.44,
      "text": " We made an episode, episode 98, I think it was almost two years ago at this point,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 322.84,
      "end": 328.34,
      "text": " where we were discussing some of the drastic quota changes that Amazon put in place for Pinpoint."
    },
    {
      "speakerLabel": "spk_1",
      "start": 328.86,
      "end": 334.52,
      "text": " And we got a little bit suspicious that maybe as a service it wasn't getting a lot of traction"
    },
    {
      "speakerLabel": "spk_1",
      "start": 334.52,
      "end": 337.08,
      "text": " or maybe it was too difficult to maintain at that scale."
    },
    {
      "speakerLabel": "spk_1",
      "start": 337.32,
      "end": 340.52,
      "text": " So we just assumed that it eventually might have been phased out."
    },
    {
      "speakerLabel": "spk_1",
      "start": 340.68,
      "end": 341.71999999999997,
      "text": " And so it happens."
    },
    {
      "speakerLabel": "spk_1",
      "start": 341.86,
      "end": 343.18,
      "text": " Maybe we were right, just like it."
    },
    {
      "speakerLabel": "spk_1",
      "start": 343.7,
      "end": 347.28,
      "text": " But yes, this is an example of the kind of products you can see here."
    },
    {
      "speakerLabel": "spk_1",
      "start": 347.28,
      "end": 355.5,
      "text": " Other examples are AWS IQ, which is the marketplace for freelancers, where effectively, if you have AWS skills, you can look for customers."
    },
    {
      "speakerLabel": "spk_1",
      "start": 356.44,
      "end": 362.28,
      "text": " And we expect that, yeah, since this is going for retirement, AWS doesn't want to maintain that marketplace themselves."
    },
    {
      "speakerLabel": "spk_1",
      "start": 362.52,
      "end": 367.7,
      "text": " Maybe there will be other alternatives that are not strictly officially promoted by AWS."
    },
    {
      "speakerLabel": "spk_1",
      "start": 367.7,
      "end": 373.06,
      "text": " And then we have two IoT services, AWS IoT Analytics and IoT Events."
    },
    {
      "speakerLabel": "spk_1",
      "start": 373.52,
      "end": 378.28,
      "text": " And we also have AWS Panorama, which is if you're doing computer visions and you want to do it on premise."
    },
    {
      "speakerLabel": "spk_1",
      "start": 378.5,
      "end": 380.8,
      "text": " That's the kind of service that AWS used to provide."
    },
    {
      "speakerLabel": "spk_1",
      "start": 381.03999999999996,
      "end": 385.7,
      "text": " Now, again, these services are not gone yet, but we can expect that they will eventually go."
    },
    {
      "speakerLabel": "spk_1",
      "start": 386.59999999999997,
      "end": 389.02,
      "text": " So start to prepare yourself if you're using them."
    },
    {
      "speakerLabel": "spk_1",
      "start": 389.28,
      "end": 390.32,
      "text": " Start to look at the documentation."
    },
    {
      "speakerLabel": "spk_1",
      "start": 390.32,
      "end": 396,
      "text": " Start to see what AWS suggests as a migration path and just be aware about the timelines."
    },
    {
      "speakerLabel": "spk_1",
      "start": 396.34,
      "end": 400.12,
      "text": " Now, the next one is services and features reaching end of support."
    },
    {
      "speakerLabel": "spk_1",
      "start": 400.34,
      "end": 402.7,
      "text": " So these ones are services that are already gone."
    },
    {
      "speakerLabel": "spk_1",
      "start": 402.88,
      "end": 404.34,
      "text": " So the end of life has been reached."
    },
    {
      "speakerLabel": "spk_1",
      "start": 404.94,
      "end": 408.06,
      "text": " And if you try to use them now, you will basically hit a wall."
    },
    {
      "speakerLabel": "spk_1",
      "start": 408.4,
      "end": 411.82,
      "text": " And two elements, two services are there right now."
    },
    {
      "speakerLabel": "spk_1",
      "start": 411.82,
      "end": 415.15999999999997,
      "text": " And there is AWS Private 5G and AWS Data Sync Discovery."
    },
    {
      "speakerLabel": "spk_1",
      "start": 415.82,
      "end": 422.92,
      "text": " Now, there is also a generic note that says if you are affected or unsure, reach out to AWS support or check the specific service documentation."
    },
    {
      "speakerLabel": "spk_1",
      "start": 423.62,
      "end": 428.26,
      "text": " So just be aware that, yeah, this seems like a little bit of a vague suggestion."
    },
    {
      "speakerLabel": "spk_1",
      "start": 428.26,
      "end": 433.15999999999997,
      "text": " But I honestly suspect that this is just because this section is probably something that AWS is still working on."
    },
    {
      "speakerLabel": "spk_1",
      "start": 433.3,
      "end": 435.02,
      "text": " And they will probably improve it as they go."
    },
    {
      "speakerLabel": "spk_0",
      "start": 435.3,
      "end": 439.65999999999997,
      "text": " There are actually services that are already end of life, but predate this product lifecycle page."
    },
    {
      "speakerLabel": "spk_0",
      "start": 439.8,
      "end": 440.5,
      "text": " And they're not there yet."
    },
    {
      "speakerLabel": "spk_0",
      "start": 440.5,
      "end": 444.94,
      "text": " One example is OpsWorks, which was, I think, reasonably popular."
    },
    {
      "speakerLabel": "spk_0",
      "start": 445.06,
      "end": 446.86,
      "text": " It managed Chef and Puppet solution."
    },
    {
      "speakerLabel": "spk_0",
      "start": 447.48,
      "end": 449.68,
      "text": " And that has been end of life since May 24."
    },
    {
      "speakerLabel": "spk_0",
      "start": 450.3,
      "end": 456.8,
      "text": " And other examples include Chime, CodeCommit, Cloud9, and QLDB or Quantum LedgerDB."
    },
    {
      "speakerLabel": "spk_0",
      "start": 457.1,
      "end": 462.8,
      "text": " A lot of those were not quite announced, but they were deprecated or sunsetted around the same time."
    },
    {
      "speakerLabel": "spk_0",
      "start": 463.38,
      "end": 469.08,
      "text": " And there was quite a bit of backlash from the community on the lack of communication when these deprecations happened,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 469.08,
      "end": 473.32,
      "text": " especially with CodeCommit, because that's something people really rely on if they're using it."
    },
    {
      "speakerLabel": "spk_0",
      "start": 473.32,
      "end": 478,
      "text": " And also you had things like control tower solutions being based heavily on CodeCommit."
    },
    {
      "speakerLabel": "spk_0",
      "start": 478.12,
      "end": 479.88,
      "text": " So it was not handled very well."
    },
    {
      "speakerLabel": "spk_0",
      "start": 480.26,
      "end": 487.24,
      "text": " Maybe this product lifecycle page is AWS's way of trying to address those communication issues and do things a bit better for the future."
    },
    {
      "speakerLabel": "spk_0",
      "start": 487.24,
      "end": 494.5,
      "text": " Now, with all that said, let's get into crystal ball time and try and think of what other services might be deprecated in the future."
    },
    {
      "speakerLabel": "spk_0",
      "start": 494.82,
      "end": 497.14,
      "text": " Now, big disclaimer, we don't have any insider knowledge."
    },
    {
      "speakerLabel": "spk_0",
      "start": 497.6,
      "end": 500.7,
      "text": " And if we did, we wouldn't use that here or disclose it here."
    },
    {
      "speakerLabel": "spk_0",
      "start": 500.94,
      "end": 504.38,
      "text": " So this is just a guessing game and a random chat at the bar between friends."
    },
    {
      "speakerLabel": "spk_0",
      "start": 504.38,
      "end": 505.98,
      "text": " So here are a few guesses."
    },
    {
      "speakerLabel": "spk_0",
      "start": 506.48,
      "end": 508.74,
      "text": " There's so many different ways to run a container on AWS."
    },
    {
      "speakerLabel": "spk_0",
      "start": 509.32,
      "end": 511.42,
      "text": " You can imagine that at some point they might like to consolidate."
    },
    {
      "speakerLabel": "spk_0",
      "start": 512.32,
      "end": 515.38,
      "text": " And we talked recently about AppRunner in episode 143."
    },
    {
      "speakerLabel": "spk_0",
      "start": 516.22,
      "end": 518.46,
      "text": " Go to awsbytes.com slash 143."
    },
    {
      "speakerLabel": "spk_0",
      "start": 519.2,
      "end": 521.6,
      "text": " And I have to say we've really liked it in principle."
    },
    {
      "speakerLabel": "spk_0",
      "start": 521.76,
      "end": 527.96,
      "text": " The only problem is that there's still a lot of overlap with other services, a bit of Fargate, a bit of Beanstalk, Elastic Beanstalk."
    },
    {
      "speakerLabel": "spk_0",
      "start": 527.96,
      "end": 534.72,
      "text": " It always felt like AppRunner was going to, well, it was at least a candidate to replace Elastic Beanstalk for some use cases."
    },
    {
      "speakerLabel": "spk_0",
      "start": 535.1800000000001,
      "end": 537.62,
      "text": " But in reality, we haven't seen that much development on it."
    },
    {
      "speakerLabel": "spk_0",
      "start": 538.12,
      "end": 541.48,
      "text": " So is one of those two going to be sunsetted eventually?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 541.76,
      "end": 542.6,
      "text": " If yes, which one?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 543.0400000000001,
      "end": 548.44,
      "text": " Is there going to be some sort of consolidation of container services under an umbrella?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 548.58,
      "end": 550.2,
      "text": " Maybe the Fargate umbrella would be nice."
    },
    {
      "speakerLabel": "spk_0",
      "start": 550.58,
      "end": 555.96,
      "text": " Just to make it easier for people to pick and choose those services and to switch between them."
    },
    {
      "speakerLabel": "spk_0",
      "start": 555.96,
      "end": 561.6600000000001,
      "text": " And I guess when it comes to the actual deprecation of them, customer adoption is probably going to dictate that."
    },
    {
      "speakerLabel": "spk_1",
      "start": 561.98,
      "end": 566.84,
      "text": " Yeah, if you want my guess, one of the areas where I've always struggled the most is API Gateway."
    },
    {
      "speakerLabel": "spk_1",
      "start": 567.1600000000001,
      "end": 570.6800000000001,
      "text": " And especially version one versus version two."
    },
    {
      "speakerLabel": "spk_1",
      "start": 571.36,
      "end": 576.38,
      "text": " And I think that's very common for full stack developers, web developers using AWS."
    },
    {
      "speakerLabel": "spk_1",
      "start": 576.9200000000001,
      "end": 578.46,
      "text": " They build lots of APIs."
    },
    {
      "speakerLabel": "spk_1",
      "start": 578.6600000000001,
      "end": 582.02,
      "text": " And it's always a little bit of a struggle to figure out which one do I use."
    },
    {
      "speakerLabel": "spk_1",
      "start": 582.02,
      "end": 592.06,
      "text": " And we spoke about API Gateway, the different versions and other ways to create HTTP endpoints basically on AWS in a serverless fashion."
    },
    {
      "speakerLabel": "spk_1",
      "start": 592.28,
      "end": 594.68,
      "text": " And back in episode 74."
    },
    {
      "speakerLabel": "spk_1",
      "start": 594.96,
      "end": 600.9,
      "text": " So go to awsbytes.com slash 74 if you want to get more details on all the options that you have available."
    },
    {
      "speakerLabel": "spk_1",
      "start": 600.9,
      "end": 606.6,
      "text": " But my point is that basically these two versions of API Gateway are effectively competing for features."
    },
    {
      "speakerLabel": "spk_1",
      "start": 607.4,
      "end": 614.38,
      "text": " And for sure, inside AWS, there is a little bit of a waste of development energies, maintenance, management, and everything else."
    },
    {
      "speakerLabel": "spk_1",
      "start": 614.38,
      "end": 618.28,
      "text": " Because effectively, they have to mandate two things that are trying to do the same thing."
    },
    {
      "speakerLabel": "spk_1",
      "start": 618.4399999999999,
      "end": 619.72,
      "text": " Maybe in slightly different ways."
    },
    {
      "speakerLabel": "spk_1",
      "start": 619.8199999999999,
      "end": 622.1999999999999,
      "text": " Maybe more optimized on different areas."
    },
    {
      "speakerLabel": "spk_1",
      "start": 622.4,
      "end": 626.9,
      "text": " But effectively, from the customer perspective, it's very difficult to pick one over another."
    },
    {
      "speakerLabel": "spk_1",
      "start": 626.9,
      "end": 634.8,
      "text": " So that's probably an area where AWS will eventually have to make a choice, even to just simplify for the customers, not just for themselves."
    },
    {
      "speakerLabel": "spk_1",
      "start": 635.14,
      "end": 638.6,
      "text": " But the interesting guess is which one is going to go, right?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 638.6,
      "end": 641.14,
      "text": " Because you might think that v2 is the newer one."
    },
    {
      "speakerLabel": "spk_1",
      "start": 641.3,
      "end": 645,
      "text": " It's also maybe a little bit cheaper, a little bit faster, based on some benchmarks."
    },
    {
      "speakerLabel": "spk_1",
      "start": 645.26,
      "end": 650.86,
      "text": " So it's easy to expect that v2 is the one that's going to stay and v1 is going to be phased out."
    },
    {
      "speakerLabel": "spk_1",
      "start": 650.86,
      "end": 656.1800000000001,
      "text": " But in reality, it's fair to say that v1 still has a lot more features and integrations with other AWS services."
    },
    {
      "speakerLabel": "spk_1",
      "start": 656.64,
      "end": 658.58,
      "text": " So the choice, I don't think, is that obvious."
    },
    {
      "speakerLabel": "spk_1",
      "start": 659.28,
      "end": 660.7,
      "text": " So what do you think?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 660.82,
      "end": 663.98,
      "text": " Do you think v1 is going to win or v2 is going to win?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 664.2,
      "end": 665.54,
      "text": " Let us know in the comments."
    },
    {
      "speakerLabel": "spk_1",
      "start": 665.6800000000001,
      "end": 670.44,
      "text": " But if you want to know our guess, I think v2 is the one that is going to lose, not stay."
    },
    {
      "speakerLabel": "spk_1",
      "start": 670.44,
      "end": 677.5600000000001,
      "text": " Just because our guess is based on recent announcements, and so it happens that there were more recent announcements for v1."
    },
    {
      "speakerLabel": "spk_1",
      "start": 678.5200000000001,
      "end": 683.7800000000001,
      "text": " Specifically, the last one was an API gateway v1 announcement called dynamic routing."
    },
    {
      "speakerLabel": "spk_1",
      "start": 683.98,
      "end": 686.1,
      "text": " We'll have the link in the show notes if you're curious."
    },
    {
      "speakerLabel": "spk_1",
      "start": 686.8000000000001,
      "end": 688.6600000000001,
      "text": " Now, Eoin, do you have any other guess?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 689.3000000000001,
      "end": 691.2,
      "text": " Maybe they'll just add v3 and we'll have..."
    },
    {
      "speakerLabel": "spk_1",
      "start": 691.2,
      "end": 692.58,
      "text": " Ooh, that might be, yeah."
    },
    {
      "speakerLabel": "spk_1",
      "start": 693.2600000000001,
      "end": 695.0400000000001,
      "text": " The one that solves all the problems."
    },
    {
      "speakerLabel": "spk_1",
      "start": 695.04,
      "end": 702.12,
      "text": " All right, so other honorable mentions that we think might hit the chopping block."
    },
    {
      "speakerLabel": "spk_0",
      "start": 702.24,
      "end": 703.56,
      "text": " We've got simple workflow service."
    },
    {
      "speakerLabel": "spk_0",
      "start": 704.02,
      "end": 707.7199999999999,
      "text": " I think there are still people using this, but it largely has been superseded by step functions."
    },
    {
      "speakerLabel": "spk_0",
      "start": 708.8199999999999,
      "end": 712.74,
      "text": " The QIIME SDK is something that I don't know if it got a lot of adoption."
    },
    {
      "speakerLabel": "spk_0",
      "start": 712.88,
      "end": 715.98,
      "text": " We've definitely used it on a previous project, and it worked very well."
    },
    {
      "speakerLabel": "spk_0",
      "start": 716.3399999999999,
      "end": 719.62,
      "text": " Unfortunately, it never had cloud formation support, which is a bad, bad smell."
    },
    {
      "speakerLabel": "spk_0",
      "start": 720.14,
      "end": 723.9399999999999,
      "text": " And QIIME itself is already end of life, so you have to wonder about QIIME SDK."
    },
    {
      "speakerLabel": "spk_0",
      "start": 723.94,
      "end": 730.5,
      "text": " Now, maybe a controversial one, serverless application repository, or SAR, only because we haven't seen too much adoption."
    },
    {
      "speakerLabel": "spk_0",
      "start": 730.8000000000001,
      "end": 734.44,
      "text": " Now, we like the idea, and we use it, and we publish to the serverless application repository."
    },
    {
      "speakerLabel": "spk_0",
      "start": 734.86,
      "end": 739.08,
      "text": " It's also kind of a hard one to deprecate if a significant number of people depend on it."
    },
    {
      "speakerLabel": "spk_0",
      "start": 739.6,
      "end": 744.3800000000001,
      "text": " So it's hard to see it being completely deprecated, but it would be great to see more adoption."
    },
    {
      "speakerLabel": "spk_0",
      "start": 744.72,
      "end": 749.9000000000001,
      "text": " Another victim might be Neptune, the graph database that AWS has."
    },
    {
      "speakerLabel": "spk_0",
      "start": 749.9,
      "end": 762.9399999999999,
      "text": " Now, we haven't heard that many people using it, and the people we have heard of using it give us this kind of non-scientific conclusion that most people prefer to host Neo4j or something else when they need a graph database."
    },
    {
      "speakerLabel": "spk_0",
      "start": 763.52,
      "end": 765.72,
      "text": " So maybe that's another candidate."
    },
    {
      "speakerLabel": "spk_0",
      "start": 765.72,
      "end": 777.78,
      "text": " In the whole Alexa, Lex space, especially given so much upheaval and development around Gen.AI, we can imagine those services being replaced by Bedrock or Q or something under that umbrella."
    },
    {
      "speakerLabel": "spk_0",
      "start": 777.78,
      "end": 789.6999999999999,
      "text": " They've already announced a new Alexa replacement, or ex-premium version called Alexa Plus, which seems to be a paid solution, and it's all based on Gen.AI."
    },
    {
      "speakerLabel": "spk_0",
      "start": 790.06,
      "end": 792.86,
      "text": " So I guess all these services are going to have to improve anyway."
    },
    {
      "speakerLabel": "spk_0",
      "start": 793.12,
      "end": 799.48,
      "text": " The kind of pre-LLM voice assistants tend to be much worse as a user experience anyway."
    },
    {
      "speakerLabel": "spk_0",
      "start": 799.9,
      "end": 802.74,
      "text": " So maybe Alexa is going to get the boot."
    },
    {
      "speakerLabel": "spk_0",
      "start": 802.74,
      "end": 814.78,
      "text": " And in the areas of DevOps and containers, Proton, which is something that was announced a couple of years ago, a lot of people were curious about it, but I just haven't seen that much adoption in practice."
    },
    {
      "speakerLabel": "spk_0",
      "start": 814.78,
      "end": 826.52,
      "text": " It was intended to make the whole infrastructure versus development teams, deployment pipelines for organizations that had separate Ops and Dev pillars."
    },
    {
      "speakerLabel": "spk_0",
      "start": 826.52,
      "end": 830.28,
      "text": " It was intended to make that much easier, but I just haven't heard that much."
    },
    {
      "speakerLabel": "spk_0",
      "start": 830.28,
      "end": 834.36,
      "text": " It's been pretty much tumbleweed since, so maybe Proton is getting the axe."
    },
    {
      "speakerLabel": "spk_0",
      "start": 835.0799999999999,
      "end": 844.02,
      "text": " And then one we did put a lot of effort into an episode on, I have to say, so it would be a shame to see it go, is the Copilot CLI in AWS."
    },
    {
      "speakerLabel": "spk_0",
      "start": 844.5,
      "end": 854.52,
      "text": " Now, this is not to be confused with GitHub Copilot and Microsoft's Copilot everything, but we also haven't seen too much about the Copilot CLI."
    },
    {
      "speakerLabel": "spk_0",
      "start": 854.52,
      "end": 864.16,
      "text": " And it was convenient to see a lot from deploying containers on AWS, and we did a whole live coding episode that turned out to be way much more work than we anticipated."
    },
    {
      "speakerLabel": "spk_0",
      "start": 864.74,
      "end": 870.04,
      "text": " So we still got some battle scars from that, but it was still a learning experience."
    },
    {
      "speakerLabel": "spk_0",
      "start": 870.4399999999999,
      "end": 871.38,
      "text": " So that's our list."
    },
    {
      "speakerLabel": "spk_0",
      "start": 871.5,
      "end": 874.42,
      "text": " Now, those are, remember, just our guesses."
    },
    {
      "speakerLabel": "spk_0",
      "start": 874.42,
      "end": 879.6999999999999,
      "text": " There's nothing there that you should necessarily bet on."
    },
    {
      "speakerLabel": "spk_0",
      "start": 880.5999999999999,
      "end": 881.8,
      "text": " But let us know what you think."
    },
    {
      "speakerLabel": "spk_0",
      "start": 882.78,
      "end": 891.5799999999999,
      "text": " Hopefully, at least now you know where to look when AWS decides to sunset a service, and maybe we helped you to spot a few warning signs before they become headaches."
    },
    {
      "speakerLabel": "spk_0",
      "start": 892.3199999999999,
      "end": 895.8399999999999,
      "text": " Just because we were right about pinpoint doesn't mean we're right about the rest."
    },
    {
      "speakerLabel": "spk_0",
      "start": 895.84,
      "end": 904.02,
      "text": " We're not trying to play AWS Doom Clock here, but we just want to make sure we're all informed, especially if you're making long-term architecture decisions."
    },
    {
      "speakerLabel": "spk_0",
      "start": 904.7800000000001,
      "end": 908.22,
      "text": " And at least this product lifecycle page is a good tool to keep in your back pocket."
    },
    {
      "speakerLabel": "spk_0",
      "start": 908.6600000000001,
      "end": 912.08,
      "text": " Let us know what you think and give us a share of your guesses in the comments."
    },
    {
      "speakerLabel": "spk_0",
      "start": 912.34,
      "end": 916.0400000000001,
      "text": " Finally, big shout out to 4Theorem for powering yet another episode of AWS Bites."
    },
    {
      "speakerLabel": "spk_0",
      "start": 916.6600000000001,
      "end": 922.22,
      "text": " At 4Theorem, we believe the cloud should be simple, scalable, and cost-effective, and we help teams just to do that."
    },
    {
      "speakerLabel": "spk_0",
      "start": 922.22,
      "end": 932.14,
      "text": " Whether you're diving into containers, stepping into event-driven architectures, or scaling up a global SaaS platform on AWS, even if you're trying to keep cloud spend under control, our team has your back."
    },
    {
      "speakerLabel": "spk_0",
      "start": 932.34,
      "end": 938.96,
      "text": " So visit 4Theorem.com to see how we can help you to build faster, better, and with more confidence using AWS."
    },
    {
      "speakerLabel": "spk_0",
      "start": 939.38,
      "end": 941.26,
      "text": " Thanks very much, and we'll catch you in the next episode."
    }
  ]
}