{
  "speakers": {
    "spk_0": "spk_0",
    "spk_1": "spk_1"
  },
  "segments": [
    {
      "speakerLabel": "spk_0",
      "start": 0.64,
      "end": 4.8,
      "text": " Did AWS just build an IDE to rival your favorite code editor?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 4.8,
      "end": 5.76,
      "text": " Yes, they did."
    },
    {
      "speakerLabel": "spk_0",
      "start": 5.76,
      "end": 10.8,
      "text": " Meet Kiro, an AI-centric take on VS Code that promises to turn an empty repo and a bunch"
    },
    {
      "speakerLabel": "spk_0",
      "start": 10.8,
      "end": 15.92,
      "text": " of loose ideas into working code with an approach that they call specification-driven design."
    },
    {
      "speakerLabel": "spk_0",
      "start": 15.92,
      "end": 21.36,
      "text": " It imports your VS Code configuration so you can start fast, and then it guides you to creating"
    },
    {
      "speakerLabel": "spk_0",
      "start": 21.36,
      "end": 26.400000000000002,
      "text": " requirements, design documents, and a clear task plan before you get your agents to work."
    },
    {
      "speakerLabel": "spk_0",
      "start": 26.4,
      "end": 31.439999999999998,
      "text": " We tried Kiro on a real project, and today we will share what clicked, what tripped us up,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 31.439999999999998,
      "end": 36.48,
      "text": " and what's unique about Kiro. We will also look at pricing, limits, and where it fits among tools"
    },
    {
      "speakerLabel": "spk_0",
      "start": 36.48,
      "end": 41.519999999999996,
      "text": " like Cursor or Cloud Code. So stick around until the end because we will share what we believe the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 41.519999999999996,
      "end": 46.959999999999994,
      "text": " future of Kiro could be and whether you should switch to Kiro or look for something else instead."
    },
    {
      "speakerLabel": "spk_0",
      "start": 46.959999999999994,
      "end": 51.36,
      "text": " My name is Luciano and I'm here with Eoin for another episode of AWS Bites Podcast."
    },
    {
      "speakerLabel": "spk_0",
      "start": 56.4,
      "end": 64,
      "text": " This episode is brought to you by Forteorem. Stay tuned for more details about Forteorem at the end"
    },
    {
      "speakerLabel": "spk_0",
      "start": 64,
      "end": 69.12,
      "text": " of this episode. So Eoin, maybe we can get started by giving a little bit more detail about what Kiro is."
    },
    {
      "speakerLabel": "spk_0",
      "start": 69.12,
      "end": 75.2,
      "text": " Yeah, so Kiro is an AI-centric IDE developed by AWS."
    },
    {
      "speakerLabel": "spk_1",
      "start": 75.2,
      "end": 80.48,
      "text": " I don't think a lot of people saw this coming, but a few weeks ago there was a lot of hype about it for a very short period. You'll find all the info"
    },
    {
      "speakerLabel": "spk_1",
      "start": 80.48,
      "end": 86.72,
      "text": " on Kiro.dev. It's got a dedicated site and like many other tools of its kind, it's a fork of VS Code."
    },
    {
      "speakerLabel": "spk_1",
      "start": 86.72,
      "end": 93.36,
      "text": " So similar to Cursor or Windsurf. And that makes it easy to move from VS Code to Kiro because it'll"
    },
    {
      "speakerLabel": "spk_1",
      "start": 93.36,
      "end": 98.56,
      "text": " import all of your settings, including themes, plugins, and config. And one of its top features"
    },
    {
      "speakerLabel": "spk_1",
      "start": 98.56,
      "end": 106.32000000000001,
      "text": " is that it offers an agentic workflow. So unlike just single prompt iteration like you might do in"
    },
    {
      "speakerLabel": "spk_1",
      "start": 106.32,
      "end": 113.19999999999999,
      "text": " Copilot before or in ChatGPT, you can describe in plain English what you want and it will try to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 113.19999999999999,
      "end": 119.52,
      "text": " achieve the given outcome. So it can read and edit files, run commands, search information online,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 119.52,
      "end": 124.63999999999999,
      "text": " and more. And it basically runs then in a loop trying to achieve the given goal. So as an example,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 124.63999999999999,
      "end": 131.35999999999999,
      "text": " you can tell it to run tests to make sure the changes it makes don't break anything. If the tests fail,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 131.35999999999999,
      "end": 135.6,
      "text": " it can read the output of the tests and then try to iterate and fix the issue until it reaches a stable"
    },
    {
      "speakerLabel": "spk_1",
      "start": 135.6,
      "end": 139.92,
      "text": " state. And you can also turn it into a more interactive collaborator. So you can tell it"
    },
    {
      "speakerLabel": "spk_1",
      "start": 139.92,
      "end": 145.28,
      "text": " to ask clarifying questions or to request more context if it needs. And you can also tell it to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 145.28,
      "end": 150.07999999999998,
      "text": " come up with a plan and request user validation before executing it. So it's a lot more collaborative"
    },
    {
      "speakerLabel": "spk_1",
      "start": 150.07999999999998,
      "end": 155.28,
      "text": " than previous tools of its kind. So Luciano, what do you think? What can Kiro do for you?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 155.28,
      "end": 160.95999999999998,
      "text": " Yeah, I think it's fair to try to provide some example use cases."
    },
    {
      "speakerLabel": "spk_0",
      "start": 160.95999999999998,
      "end": 165.51999999999998,
      "text": " One that I really like is when you are starting on a project that has been created by maybe a team that you just joined. So you don't really"
    },
    {
      "speakerLabel": "spk_0",
      "start": 165.52,
      "end": 170.48000000000002,
      "text": " have a lot of context. You can just open Kiro, open the project and ask it to explain the structure"
    },
    {
      "speakerLabel": "spk_0",
      "start": 170.48000000000002,
      "end": 174.56,
      "text": " of the existing code base. And I think that's a really useful feature to just get you started"
    },
    {
      "speakerLabel": "spk_0",
      "start": 174.56,
      "end": 178.96,
      "text": " quickly and do all of the onboarding stuff. And similarly, if you need to generate some"
    },
    {
      "speakerLabel": "spk_0",
      "start": 178.96,
      "end": 183.12,
      "text": " documentation or improve existing documentation, that's another excellent use case. You can just"
    },
    {
      "speakerLabel": "spk_0",
      "start": 183.12,
      "end": 188.4,
      "text": " add Kiro, like maybe read that some files and update the docs. And generally, this is the kind of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 188.4,
      "end": 194.72,
      "text": " tasks where these tools really shine. And another use case is totally when you start from scratch,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 194.72,
      "end": 200.16,
      "text": " and you literally have a blank slate, and you want to start creating a new project quickly on a prototype."
    },
    {
      "speakerLabel": "spk_0",
      "start": 200.16,
      "end": 204.56,
      "text": " Kiro actually can help you with that. And we'll talk more about an example that we played with."
    },
    {
      "speakerLabel": "spk_0",
      "start": 205.36,
      "end": 210.8,
      "text": " Or even you can work on features or fixes on existing projects. So if you've used Courser,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 210.8,
      "end": 216.32,
      "text": " Windsurf, Copilot Agent Mode, Cloud Code, Open Code, Klein, or Clean for VS Code,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 216.32,
      "end": 221.51999999999998,
      "text": " or any other of these AI-agentic tools, the experience is exactly the same. It's just that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 221.51999999999998,
      "end": 227.12,
      "text": " this is the product that AWS is building and promoting. So it's a more AWS-centric take on"
    },
    {
      "speakerLabel": "spk_0",
      "start": 227.12,
      "end": 233.2,
      "text": " this kind of products. So one thing where I think Kiro is trying to innovate a little bit more than all of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 233.2,
      "end": 239.12,
      "text": " the competitors is what they call the spec-driven approach or specification-driven approach. And"
    },
    {
      "speakerLabel": "spk_0",
      "start": 239.12,
      "end": 243.76,
      "text": " we'll talk a little bit more about that later. But I think it's fair at this point to mention what is"
    },
    {
      "speakerLabel": "spk_0",
      "start": 243.76,
      "end": 246.23999999999998,
      "text": " the current status of this project since it's very new."
    },
    {
      "speakerLabel": "spk_1",
      "start": 251.67999999999998,
      "end": 257.12,
      "text": " Well, it was launched back in early July with an open beta and quickly moved into a closed beta with a waitlist. And we were both lucky enough to get in early. It currently supports Claude Sonnet"
    },
    {
      "speakerLabel": "spk_1",
      "start": 257.12,
      "end": 266.56,
      "text": " models 4 and 3.7. And during the beta access, the model access was totally free. And this is a big draw"
    },
    {
      "speakerLabel": "spk_1",
      "start": 266.56,
      "end": 271.03999999999996,
      "text": " for a lot of people because it was completely unlimited. And that's very rare these days to get access to a"
    },
    {
      "speakerLabel": "spk_1",
      "start": 271.04,
      "end": 274.96000000000004,
      "text": " powerful model like that for free. And possibly one of the reasons why everyone was so excited to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 274.96000000000004,
      "end": 279.84000000000003,
      "text": " try it. Of course, in reality, there are limits. We haven't used it enough to hit those limits."
    },
    {
      "speakerLabel": "spk_1",
      "start": 279.84000000000003,
      "end": 284.40000000000003,
      "text": " We'll get into that in a sec, but it seems that a lot of people in the AWS community have reported"
    },
    {
      "speakerLabel": "spk_1",
      "start": 284.40000000000003,
      "end": 288.8,
      "text": " that these limits are very stringent and they make it hard to really evaluate the tool. Of course,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 288.8,
      "end": 293.44,
      "text": " these limits are going to change once Kiro is out of beta and becomes a paid product like Cursor and"
    },
    {
      "speakerLabel": "spk_1",
      "start": 293.44,
      "end": 300.32,
      "text": " the others. So let's get into all of that pricing discussion later. But one of the big differences"
    },
    {
      "speakerLabel": "spk_1",
      "start": 300.32,
      "end": 305.84,
      "text": " with Kiro is the vibe versus spec model. Luciano, do you want to go into that?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 305.84,
      "end": 310,
      "text": " Luciano Vecanovic Yes."
    },
    {
      "speakerLabel": "spk_0",
      "start": 310,
      "end": 315.36,
      "text": " So as I say, this is probably the most innovating piece of Kiro, this spec-driven development. And I think to really appreciate what that means, we need to say that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 315.36,
      "end": 321.36,
      "text": " AI-driven development is all about context. And we can define context as basically the combination of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 321.36,
      "end": 326.40000000000003,
      "text": " a specific prompt that you are giving to the agent with somewhat clear instructions and expected"
    },
    {
      "speakerLabel": "spk_0",
      "start": 326.40000000000003,
      "end": 331.12,
      "text": " outcomes, plus everything that you have in your project. So basically you are giving the agent"
    },
    {
      "speakerLabel": "spk_0",
      "start": 331.12,
      "end": 337.28000000000003,
      "text": " access to additional information like local files, or maybe other documents that you can provide in"
    },
    {
      "speakerLabel": "spk_0",
      "start": 337.28000000000003,
      "end": 343.92,
      "text": " some other way. Sometimes can be even diagrams, pictures, because all these models support not just"
    },
    {
      "speakerLabel": "spk_0",
      "start": 343.92,
      "end": 349.28000000000003,
      "text": " text, but they can also read images and audio and so on. So all of that together is basically something"
    },
    {
      "speakerLabel": "spk_0",
      "start": 349.28,
      "end": 355.52,
      "text": " we can define as context. And context also can be enriched even more if you use tools like MCP servers,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 355.52,
      "end": 360.23999999999995,
      "text": " but we're not going to deep dive too much into that. Just keep in mind that that's yet another thing"
    },
    {
      "speakerLabel": "spk_0",
      "start": 360.23999999999995,
      "end": 365.84,
      "text": " that you can use to basically provide even more information to your AI agents. So effectively,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 365.84,
      "end": 370.64,
      "text": " the idea is very simple. The more context and the more details you can provide about your projects and"
    },
    {
      "speakerLabel": "spk_0",
      "start": 370.64,
      "end": 375.03999999999996,
      "text": " the features that you're trying to build, the more likely is that the agent is going to do a good job,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 375.04,
      "end": 380.56,
      "text": " and you end up with a result of an acceptable quality. And if we think about that, to be honest,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 380.56,
      "end": 386.72,
      "text": " humans work more or less the same way, right? If you are working with a colleague and you can provide"
    },
    {
      "speakerLabel": "spk_0",
      "start": 386.72,
      "end": 392.88,
      "text": " very clear details and requirements, chances are that at the end you end up with a much more fruitful"
    },
    {
      "speakerLabel": "spk_0",
      "start": 392.88,
      "end": 399.52000000000004,
      "text": " collaboration. If you just give very loose specs, so to speak, then your management might vary, right?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 399.52,
      "end": 403.52,
      "text": " You don't know what your colleague is going to come up with because they need to make a lot of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 403.52,
      "end": 409.2,
      "text": " assumptions and you might not be happy with some of these assumptions. So the main question in general,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 409.2,
      "end": 413.2,
      "text": " and this is a question that goes even beyond here, I think it's in the industry at this stage with all"
    },
    {
      "speakerLabel": "spk_0",
      "start": 413.2,
      "end": 419.84,
      "text": " these new AI agentic tools is how do you provide good context to an AI model?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 419.84,
      "end": 424.79999999999995,
      "text": " It's still not a perfect science and the industry and everyone is still trying to figure out the best practices. I suppose every one"
    },
    {
      "speakerLabel": "spk_1",
      "start": 424.8,
      "end": 430.16,
      "text": " of these agentic AI tools gives you ways to enrich your prompts with extra context, but they all"
    },
    {
      "speakerLabel": "spk_1",
      "start": 430.16,
      "end": 435.68,
      "text": " tend to be very loose and it's still not ideal. Kiro differentiates itself a bit with a very"
    },
    {
      "speakerLabel": "spk_1",
      "start": 435.68,
      "end": 441.44,
      "text": " structured and prescriptive approach, which is what they call spec-driven AI coding. And this is"
    },
    {
      "speakerLabel": "spk_1",
      "start": 442,
      "end": 447.44,
      "text": " especially useful when you're starting a new project or feature work from scratch and you want to give it"
    },
    {
      "speakerLabel": "spk_1",
      "start": 447.44,
      "end": 452.8,
      "text": " a bit more structure. So you start by giving Kiro a loose prompt with a high level idea of your goal."
    },
    {
      "speakerLabel": "spk_1",
      "start": 452.8,
      "end": 456.32,
      "text": " Then Kiro will guide you through the process of creating this specification."
    },
    {
      "speakerLabel": "spk_1",
      "start": 456.96000000000004,
      "end": 460.88,
      "text": " And the spec is ultimately a collection of three documents that are useful to describe what you"
    },
    {
      "speakerLabel": "spk_1",
      "start": 460.88,
      "end": 465.92,
      "text": " want the agent to achieve. And they can also serve as human readable documentation too, which is no bad"
    },
    {
      "speakerLabel": "spk_1",
      "start": 465.92,
      "end": 470.88,
      "text": " thing. So what are these three documents?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 470.88,
      "end": 476,
      "text": " Yeah, the first file that Kiro generates for you when you just provide a very loose prompt and we'll give you an example, a full example later on is called"
    },
    {
      "speakerLabel": "spk_0",
      "start": 476,
      "end": 482.40000000000003,
      "text": " requirements.md. So it's a markdown file and it will contain an eye level introduction and a list of user"
    },
    {
      "speakerLabel": "spk_0",
      "start": 482.4,
      "end": 488.08,
      "text": " stories with requirements. And there is actually a very specific format to the way that these stories"
    },
    {
      "speakerLabel": "spk_0",
      "start": 488.08,
      "end": 494.23999999999995,
      "text": " are defined. And what I really like to see is that there is a clear acceptance criteria. So there is"
    },
    {
      "speakerLabel": "spk_0",
      "start": 494.23999999999995,
      "end": 498.96,
      "text": " this structured way of saying when something happens, then something else needs to be done."
    },
    {
      "speakerLabel": "spk_0",
      "start": 498.96,
      "end": 504.96,
      "text": " And you can see all these user stories written following this structure. So in a way, I like to think"
    },
    {
      "speakerLabel": "spk_0",
      "start": 504.96,
      "end": 509.44,
      "text": " about this document as if you're working with a product manager that doesn't necessarily have lots of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 509.44,
      "end": 513.52,
      "text": " technical depth, but they can understand the product and tell you what the product needs to do"
    },
    {
      "speakerLabel": "spk_0",
      "start": 513.52,
      "end": 519.28,
      "text": " on different features or things that are happening when users interact with the product. So when you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 520.64,
      "end": 525.76,
      "text": " when you get this document from Kiro, of course, this document is a sort of a collaboration if you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 525.76,
      "end": 531.12,
      "text": " want. So Kiro gives you a first draft and then you can update it yourself manually or you can give Kiro"
    },
    {
      "speakerLabel": "spk_0",
      "start": 531.12,
      "end": 535.92,
      "text": " extra prompts for things that you wanted to improve on. And then when you are happy with it, you can"
    },
    {
      "speakerLabel": "spk_0",
      "start": 535.92,
      "end": 541.36,
      "text": " effectively move on to the next phase. And Kiro is going to take your requirements.md file as an input"
    },
    {
      "speakerLabel": "spk_0",
      "start": 541.36,
      "end": 548,
      "text": " and use it to generate a design.md. And the design.md is a more technical document because it contains"
    },
    {
      "speakerLabel": "spk_0",
      "start": 548,
      "end": 553.92,
      "text": " things like an architecture section and it can even create diagrams in mermaid format. So you can actually"
    },
    {
      "speakerLabel": "spk_0",
      "start": 553.92,
      "end": 558.88,
      "text": " visualize those diagrams and again, iterate on them until you feel that this is really what you want to achieve."
    },
    {
      "speakerLabel": "spk_0",
      "start": 558.88,
      "end": 564.32,
      "text": " But it goes deeper because for every component in your diagram, there is a component architecture."
    },
    {
      "speakerLabel": "spk_0",
      "start": 564.32,
      "end": 570.32,
      "text": " And for that means that for each one of these components, you'll need to work with Kiro to provide"
    },
    {
      "speakerLabel": "spk_0",
      "start": 570.32,
      "end": 574.72,
      "text": " details like what is the purpose of this component? What are the inputs that are expected for this"
    },
    {
      "speakerLabel": "spk_0",
      "start": 574.72,
      "end": 581.04,
      "text": " component? What kind of outputs is going to produce? And if even key methods, so for instance, Kiro is going"
    },
    {
      "speakerLabel": "spk_0",
      "start": 581.04,
      "end": 586,
      "text": " to try to infer from your project what kind of programming language you want to use, or you can also tell it"
    },
    {
      "speakerLabel": "spk_0",
      "start": 586,
      "end": 591.12,
      "text": " explicitly. And it's going to start to generate at this point some sketches for key methods. And this"
    },
    {
      "speakerLabel": "spk_0",
      "start": 591.12,
      "end": 596.4,
      "text": " is actually signatures of function or classes and methods telling, okay, for this component, this is"
    },
    {
      "speakerLabel": "spk_0",
      "start": 596.4,
      "end": 601.2,
      "text": " what I expect to generate in terms of code. It doesn't generate all the code, but just the signatures of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 601.2,
      "end": 606.4,
      "text": " the name, the inputs, the outputs, which is generally good enough to really understand what is the purpose of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 606.4,
      "end": 611.52,
      "text": " that component. Then there is an entire section dedicated to data models. So very similar to components."
    },
    {
      "speakerLabel": "spk_0",
      "start": 611.52,
      "end": 616.8,
      "text": " It provides details also generates some snippets of code, just to tell you these are the attributes,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 616.8,
      "end": 621.6,
      "text": " for example, that I expect to have for each of the different data models. And finally, there are"
    },
    {
      "speakerLabel": "spk_0",
      "start": 621.6,
      "end": 626.96,
      "text": " other sections like error handling. So how do you want to handle errors? Do you want to just crash or"
    },
    {
      "speakerLabel": "spk_0",
      "start": 626.96,
      "end": 631.28,
      "text": " have a more graceful fallback? How do you want to log these errors? How do you want to display them to the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 631.28,
      "end": 637.68,
      "text": " users? Even testing strategy. So do you want to do unit tests, integration tests, even test the data models,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 637.68,
      "end": 643.04,
      "text": " or which tools and libraries do you want to use for those? And deployment strategies as well. So of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 643.04,
      "end": 648.3199999999999,
      "text": " course, if you use Kiro, chances are you're using AWS and serverless. And this was our example as well."
    },
    {
      "speakerLabel": "spk_0",
      "start": 648.3199999999999,
      "end": 654.2399999999999,
      "text": " So in that case, Kiro will start to ask you, okay, you are working with lambdas. What kind of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 654.2399999999999,
      "end": 659.1999999999999,
      "text": " configuration do you expect in terms of memory? What is the trigger for that lambda? Are there specific"
    },
    {
      "speakerLabel": "spk_0",
      "start": 659.1999999999999,
      "end": 664.9599999999999,
      "text": " code dependencies that I need to keep in mind? And even performance expectations. So this is really a very"
    },
    {
      "speakerLabel": "spk_0",
      "start": 664.96,
      "end": 669.44,
      "text": " technical document. And I imagine like you are sitting down with a CTO or a team lead,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 669.44,
      "end": 674,
      "text": " or somebody that's very technical in your team, and you have to work together to come up with all"
    },
    {
      "speakerLabel": "spk_0",
      "start": 674,
      "end": 678.8000000000001,
      "text": " these details. And again, this is another step in the process, very interactive. When you are happy with"
    },
    {
      "speakerLabel": "spk_0",
      "start": 678.8000000000001,
      "end": 683.76,
      "text": " it, you can click to go to the next step. And in the next step, all that you have created so far"
    },
    {
      "speakerLabel": "spk_0",
      "start": 683.76,
      "end": 690.48,
      "text": " becomes input for the new step, which is called tasks.md. So this is a new file that effectively is"
    },
    {
      "speakerLabel": "spk_0",
      "start": 690.48,
      "end": 694.32,
      "text": " almost again, like you are bouncing the ball back to the product manager and saying, okay, now we have"
    },
    {
      "speakerLabel": "spk_0",
      "start": 694.32,
      "end": 699.44,
      "text": " a very clear idea of what we need to build, how we need to build it. We just need to break it down"
    },
    {
      "speakerLabel": "spk_0",
      "start": 699.44,
      "end": 704.72,
      "text": " into manageable tasks. So effectively, Kiro generates a to-do list with some details referencing"
    },
    {
      "speakerLabel": "spk_0",
      "start": 704.72,
      "end": 709.84,
      "text": " the other documents. And then for each item in this to-do list, it's almost like a checkbox."
    },
    {
      "speakerLabel": "spk_0",
      "start": 709.84,
      "end": 716,
      "text": " So you will have an interactive button there close to every item saying, start to work on this task."
    },
    {
      "speakerLabel": "spk_0",
      "start": 716,
      "end": 720.48,
      "text": " And this is where you start to run the other individual tasks to the agent to effectively come up"
    },
    {
      "speakerLabel": "spk_0",
      "start": 720.48,
      "end": 725.28,
      "text": " with the implementation for them. Okay."
    },
    {
      "speakerLabel": "spk_1",
      "start": 725.28,
      "end": 729.44,
      "text": " So I guess it's worth noting that all of these documents are created in order and you can tweak them manually, or you could use more prompting to get"
    },
    {
      "speakerLabel": "spk_1",
      "start": 729.44,
      "end": 734.24,
      "text": " Kiro to do it for you before you move to the next one. So that makes it feel like it is quite a"
    },
    {
      "speakerLabel": "spk_1",
      "start": 734.24,
      "end": 739.36,
      "text": " structured guided process and you have control over it, but you don't have to do all the work yourself."
    },
    {
      "speakerLabel": "spk_1",
      "start": 739.36,
      "end": 742.64,
      "text": " And what we do like is that if you don't have a lot of clarity on what you want to build,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 742.64,
      "end": 747.44,
      "text": " this process helps you to kind of brainstorm it and rubber duck it with the agent and helps you to come up"
    },
    {
      "speakerLabel": "spk_1",
      "start": 747.44,
      "end": 751.7600000000001,
      "text": " with a better picture before you move on to the implementation. This process alone has a lot of"
    },
    {
      "speakerLabel": "spk_1",
      "start": 751.7600000000001,
      "end": 756.4000000000001,
      "text": " value. And I say that, you know, all of these AI code tools are great, but the biggest challenge in"
    },
    {
      "speakerLabel": "spk_1",
      "start": 756.4000000000001,
      "end": 761.2,
      "text": " software is actually understanding what you're trying to build, communicating it well, understanding"
    },
    {
      "speakerLabel": "spk_1",
      "start": 761.2,
      "end": 766.08,
      "text": " the needs of the users and really getting that into a specification. Because once you have that clarity,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 766.08,
      "end": 771.2,
      "text": " writing software is always easier anyway, whether you're using AI or not. It is interesting to see"
    },
    {
      "speakerLabel": "spk_1",
      "start": 771.2,
      "end": 777.36,
      "text": " that Kiro makes this clear difference between vibe and spec, where vibe, which often for a very"
    },
    {
      "speakerLabel": "spk_1",
      "start": 777.36,
      "end": 781.52,
      "text": " good reason gets a negative connotation is intended as like, just work off a single prompt and figure"
    },
    {
      "speakerLabel": "spk_1",
      "start": 781.52,
      "end": 785.92,
      "text": " it out yourself. Spec is more on the line of, let me give you all the details and the structured format"
    },
    {
      "speakerLabel": "spk_1",
      "start": 785.92,
      "end": 790,
      "text": " we just described and let's come up with an implementation plan. Now you can still do the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 790,
      "end": 794.24,
      "text": " vibe mode in Kiro. You can pick the approach that feels most appropriate for what you want to do."
    },
    {
      "speakerLabel": "spk_1",
      "start": 794.96,
      "end": 799.2,
      "text": " If you just want to update a readme file or do something very throwaway, you can probably just vibe it."
    },
    {
      "speakerLabel": "spk_1",
      "start": 799.76,
      "end": 804.64,
      "text": " But if you're working on something like a complex new feature, it makes sense to probably go with"
    },
    {
      "speakerLabel": "spk_1",
      "start": 804.64,
      "end": 810.64,
      "text": " a spec-driven approach. Luciano, you were able to put this into practice with some real-world needs,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 811.1999999999999,
      "end": 813.36,
      "text": " which is what it's supposed to be designed for. So how did it go?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 817.6,
      "end": 821.92,
      "text": " Luciano Guido Yeah, I'm going to try to describe the use case that I was trying to work with first, because it requires a little bit of context, but it's actually a real need. So it's a realistic idea,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 821.92,
      "end": 827.84,
      "text": " which hopefully helps to appreciate Kiro a bit more. So the problem that I was trying to work with is,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 827.84,
      "end": 834.56,
      "text": " I don't know if people here ever try to share a product URL from an eCommerce like Amazon. So let's say,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 834.56,
      "end": 840.16,
      "text": " a book, for example, and you want to have some easy way to give people a URL, and they should just"
    },
    {
      "speakerLabel": "spk_0",
      "start": 840.16,
      "end": 845.1999999999999,
      "text": " be able to see the book and buy it if they like it. But with Amazon specifically, there is a problem,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 845.1999999999999,
      "end": 850.64,
      "text": " because Amazon is not just one single eCommerce globally, but there are 20, probably even more"
    },
    {
      "speakerLabel": "spk_0",
      "start": 850.64,
      "end": 856.2399999999999,
      "text": " than 20 stores. There is like the United States one, Australia, UK, Italy, Ireland, Turkey, etc."
    },
    {
      "speakerLabel": "spk_0",
      "start": 856.2399999999999,
      "end": 861.52,
      "text": " And each one of them has its own domain, for example, amazon.com, amazon.it, amazon.ie, etc."
    },
    {
      "speakerLabel": "spk_0",
      "start": 862.0799999999999,
      "end": 867.68,
      "text": " So if you want to link a product, you suddenly have a problem because you don't necessarily know"
    },
    {
      "speakerLabel": "spk_0",
      "start": 867.68,
      "end": 872.96,
      "text": " the country that is going to be best for whoever is going to click the link. So the option, the most"
    },
    {
      "speakerLabel": "spk_0",
      "start": 872.96,
      "end": 878.48,
      "text": " complete option realistically that you have is to create 20 plus URLs, one for each existing domain,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 878.48,
      "end": 883.12,
      "text": " and just put them somewhere in a page and then hope that the user is going to find and click the right"
    },
    {
      "speakerLabel": "spk_0",
      "start": 883.12,
      "end": 889.68,
      "text": " one. So my idea was, okay, why don't we create a service, like a Lambda, for example, an HTTP Lambda,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 889.68,
      "end": 895.5999999999999,
      "text": " that acts as a single entry point, it figures out what is the user location, and then it redirects"
    },
    {
      "speakerLabel": "spk_0",
      "start": 895.5999999999999,
      "end": 901.04,
      "text": " the user to the correct URL for that particular product. And of course, you can generalize this"
    },
    {
      "speakerLabel": "spk_0",
      "start": 901.04,
      "end": 905.8399999999999,
      "text": " idea a little bit more. So not just focus on Amazon, which was my use case, but I thought,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 905.8399999999999,
      "end": 910.0799999999999,
      "text": " okay, let's make maybe something that can be more useful to more people. But in general, whenever you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 910.0799999999999,
      "end": 916.24,
      "text": " have the need of creating like a geo aware redirect system, you can have this entry point, single URL,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 916.24,
      "end": 921.04,
      "text": " and then some kind of routing configuration that tells you, okay, if we detect the user is from this"
    },
    {
      "speakerLabel": "spk_0",
      "start": 921.04,
      "end": 925.12,
      "text": " particular country, this is going to be the target URL where we want to redirect the user."
    },
    {
      "speakerLabel": "spk_0",
      "start": 925.12,
      "end": 929.6,
      "text": " And of course, you can make this configuration a little bit fancier if you want to support multiple"
    },
    {
      "speakerLabel": "spk_0",
      "start": 929.6,
      "end": 935.52,
      "text": " URLs, multiple countries, maybe fallback URLs if you cannot detect the country, or if the current"
    },
    {
      "speakerLabel": "spk_0",
      "start": 935.52,
      "end": 940.48,
      "text": " country is not in the lists that you have provided. So this was kind of the use cases that I want"
    },
    {
      "speakerLabel": "spk_0",
      "start": 940.48,
      "end": 947.6,
      "text": " key row to help me with. So let's build this Lambda with all this logic and figure out how to package"
    },
    {
      "speakerLabel": "spk_0",
      "start": 947.6,
      "end": 954.24,
      "text": " it in a way that we can ship it to AWS and have it running. So we started the process from scratch"
    },
    {
      "speakerLabel": "spk_0",
      "start": 954.24,
      "end": 959.9200000000001,
      "text": " in spec mode. And as we described before, the process starts in a very simple way. So you just"
    },
    {
      "speakerLabel": "spk_0",
      "start": 959.9200000000001,
      "end": 964.24,
      "text": " need to give it an initial prompt, which doesn't have to be detailed at all. So it needs to be a very"
    },
    {
      "speakerLabel": "spk_0",
      "start": 964.24,
      "end": 969.28,
      "text": " high level description of what you want to achieve. And what I gave it was effectively not more than two"
    },
    {
      "speakerLabel": "spk_0",
      "start": 969.28,
      "end": 976.0799999999999,
      "text": " lines, something that goes like a Lambda function written in Rust with an HTTP trigger could be API"
    },
    {
      "speakerLabel": "spk_0",
      "start": 976.0799999999999,
      "end": 981.92,
      "text": " Gateway or function URL that allows you to redirect the user to different URLs depending on their geo"
    },
    {
      "speakerLabel": "spk_0",
      "start": 981.92,
      "end": 987.1999999999999,
      "text": " location. That was just the prompt that I gave Kiro. And it started by generating the first file,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 987.1999999999999,
      "end": 991.76,
      "text": " which is a requirements.md. Now I'm not going to read the entire documents because it's quite long,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 991.76,
      "end": 996.8,
      "text": " but the document that was generated at an introduction, more or less similar to the prompt that I gave at"
    },
    {
      "speakerLabel": "spk_0",
      "start": 996.8,
      "end": 1001.3599999999999,
      "text": " the beginning. But then it started to generate requirements and user story. So for instance,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1001.3599999999999,
      "end": 1008.16,
      "text": " there was a first user story that said, when a user makes an HTTP request to the Lambda, then the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1008.16,
      "end": 1013.04,
      "text": " system shall determine the user geographic location. When the geographic location is determined, then the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1013.04,
      "end": 1019.28,
      "text": " system shall match it against a configured set of rules. And then you keep going. When you identify the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1019.28,
      "end": 1024.3999999999999,
      "text": " rule, then you need to create a direct response and so on. So very structured format. And this was the first"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1024.4,
      "end": 1030.96,
      "text": " acceptance criteria. And there were more acceptance criteria going even into performance and security."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1031.52,
      "end": 1037.2,
      "text": " And of course, it wasn't perfect as I imagined at the beginning. So this is where the collaboration is"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1037.2,
      "end": 1043.0400000000002,
      "text": " a very important step. I kept tweaking it a little bit, either by manual edits or by asking Kiro to fix"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1043.0400000000002,
      "end": 1048.0800000000002,
      "text": " certain things by itself. And at some point when I was happy with it, I clicked the button to move to the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1048.0800000000002,
      "end": 1053.92,
      "text": " next phase. And that's where Kiro generated the design.md document. So the more technical document"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1053.92,
      "end": 1059.44,
      "text": " containing more implementation details. So here, one thing that I really appreciated is that it"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1059.44,
      "end": 1065.44,
      "text": " started with a high level architecture in mermaid format. It wasn't 100% correct as I imagined it,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1065.44,
      "end": 1072.24,
      "text": " but it wasn't too bad either. So what I did, I basically copy pasted that mermaid specification into"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1072.24,
      "end": 1077.76,
      "text": " a mermaid editor. So I could see the preview real time and I did some tweaks myself, then copy pasted it"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1077.76,
      "end": 1082.72,
      "text": " back to the markdown and then also changed a few other details. And at that point, I think I was"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1082.72,
      "end": 1088.4,
      "text": " happy enough to move to the next phase, which is the generation of the tasks.md file. So this is where"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1088.4,
      "end": 1095.12,
      "text": " Kiro takes your design document and your requirements, and it comes up with a list of tasks to implement"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1096.32,
      "end": 1101.6,
      "text": " basically concrete steps. So it's not going to create very big steps only one go, but very manageable,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1101.6,
      "end": 1105.44,
      "text": " small steps that incrementally, they will lead you to the final solution."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1105.44,
      "end": 1110.24,
      "text": " Now, this is where things started to go a little bit wrong. So, so far, I was very happy with the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1110.24,
      "end": 1114.24,
      "text": " process. Like I really enjoyed this kind of collaboration and actually realized that I had"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1114.24,
      "end": 1118.88,
      "text": " a few gaps in my understanding of the project. So there were a few things where Kiro actually"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1118.88,
      "end": 1123.1200000000001,
      "text": " throw me questions that I haven't thought about. And I had to actually think really hard, okay,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1123.1200000000001,
      "end": 1128.4,
      "text": " what do we need to do in this case? Let's define a clear expectation. Once you put all of that into"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1128.4,
      "end": 1134.4,
      "text": " writing, I think it's a really good exercise anyway for yourself, for the agent, and even for anyone"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1134.4,
      "end": 1138.4,
      "text": " else that is going to join the project in the future. So all these documents, I think, become"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1138.4,
      "end": 1142.88,
      "text": " persistent knowledge that everyone can access to even in the future. But then yes, moving to the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1142.88,
      "end": 1148.5600000000002,
      "text": " implementation phase, I actually eat a very nasty bug. So the first task that Kiro generated was about"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1148.5600000000002,
      "end": 1153.92,
      "text": " scaffolding the whole project using a tool that generally people use when you want to do a Lambda"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1153.92,
      "end": 1158.4,
      "text": " Rust. We have an episode about that. We'll have the link in the show notes that is called Cargo Lambda."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1158.4,
      "end": 1163.92,
      "text": " And Cargo Lambda basically allows you to grow from zero to a structured approach where you can say,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1163.92,
      "end": 1168.5600000000002,
      "text": " I want an HTTP Lambda, and it generates an entire example for you that you can build on."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1168.5600000000002,
      "end": 1175.2800000000002,
      "text": " So when I say we, I mean myself and Kiro, we kind of decided, okay, we want to use Cargo Lambda. So the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1175.2800000000002,
      "end": 1178.72,
      "text": " first step is going to be to scaffold the project with Cargo Lambda. And because it's going to be an"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1178.72,
      "end": 1183.1200000000001,
      "text": " HTTP function, the first step that Cargo Lambda generally asks you is like, what kind of Lambda are you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1183.12,
      "end": 1188.7199999999998,
      "text": " building? So it generates a more closer template to actually what you are trying to do. And the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1188.7199999999998,
      "end": 1195.28,
      "text": " problem is that when Kiro tried to run Cargo Lambda in the terminal, it did use an argument that actually"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1195.28,
      "end": 1200.9599999999998,
      "text": " didn't really exist. So the command failed. And at that point, Kiro somehow didn't realize that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1200.9599999999998,
      "end": 1205.4399999999998,
      "text": " the command had failed and what was the error. So it got stuck into a loop where it was working,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1205.4399999999998,
      "end": 1210.56,
      "text": " waiting for the command to finish, although the command wasn't running anymore. And I was waiting for a"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1210.56,
      "end": 1214.3999999999999,
      "text": " while. And then eventually I had to ask, like, what's going on? Didn't you see that the command"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1214.3999999999999,
      "end": 1219.52,
      "text": " finished? And Kiro kind of pretended that at that point, he realized, oh, yes, the command finished,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1219.52,
      "end": 1223.12,
      "text": " but it looked like he wasn't able to read the output of that command. So he didn't really know"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1223.12,
      "end": 1227.36,
      "text": " what was the next step to do. So I started to assume that there was something wrong, for instance,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1227.36,
      "end": 1232.24,
      "text": " with my Rust configuration and tried to fix the Rust environment, rather than really understanding"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1232.24,
      "end": 1236.96,
      "text": " that he wasn't able to read the output of the command and that he had used a wrong command in the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1236.96,
      "end": 1242.16,
      "text": " first place. So I had to do a lot of manual steering to get it to the point where he was able to run the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1242.16,
      "end": 1246.72,
      "text": " command correctly. But again, even when the command was running correctly, it was stuck in this working"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1246.72,
      "end": 1251.8400000000001,
      "text": " mode because it didn't really understand that the command had finished successfully. So that seemed"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1251.8400000000001,
      "end": 1256.88,
      "text": " like a bug. And then I started to look online and many other people seem to have very similar bugs."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1256.88,
      "end": 1263.28,
      "text": " So I reported it on GitHub myself and many other people are reporting that. So hopefully that's get fixed"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1263.28,
      "end": 1267.92,
      "text": " and it's going to make the experience much nicer because at this point, this is pretty frustrating"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1267.92,
      "end": 1272.56,
      "text": " from a user experience perspective. This is like the main thing you expect an agent to do,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1272.56,
      "end": 1277.28,
      "text": " to be autonomous to some degree, once you have defined the tasks and the acceptance criteria."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1277.28,
      "end": 1281.68,
      "text": " And if you have to continuously interact with it to fix this kind of misunderstanding of every single"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1281.68,
      "end": 1285.84,
      "text": " action, then you are just better off doing it yourself. Which by the way, funny enough,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1285.84,
      "end": 1290,
      "text": " was one of the proposed solutions on GitHub is like copy paste the command yourself and plan it"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1290,
      "end": 1295.04,
      "text": " yourself. But then you're not using an agent anymore. You're just using a readme that tells you which"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1295.04,
      "end": 1301.6,
      "text": " commands to run. So this was our experience, although it was a bit frustrating. I think it's fair to say"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1301.6,
      "end": 1307.6,
      "text": " that this product is still in beta and bugs are to be expected. This can be a reasonable bug in the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1307.6,
      "end": 1313.84,
      "text": " sense that everything has worked fine. The spec driven approach worked seamlessly. So I think I just"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1313.84,
      "end": 1319.92,
      "text": " expect all these things will be cleaned up and fixed as we go out of that beta phase. And at that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1319.92,
      "end": 1324.0800000000002,
      "text": " point, I think everyone will have a nice experience with Kiro. So don't take this as negative feedback"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1324.0800000000002,
      "end": 1330.0800000000002,
      "text": " or as don't use Kiro. Of course, at the beginning bugs are expected, but we believe it's normal and"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1330.0800000000002,
      "end": 1334.4,
      "text": " it's only going to get better."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1334.4,
      "end": 1338.96,
      "text": " Yeah, I hope that let's look at the GitHub issue list and keep an eye on it because it is great when Amazon tries to do a project like this in open source and on GitHub."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1338.96,
      "end": 1344.3200000000002,
      "text": " But we have seen cases in the past where there's a lot of fanfare when things are open sourced at the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1344.32,
      "end": 1351.28,
      "text": " beginning. But the repo does not get the attention and resourcing it deserves. So the fingers crossed"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1351.28,
      "end": 1356.3999999999999,
      "text": " that we'll see a bit of activity there. Maybe we should talk a little bit about a couple of other"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1356.3999999999999,
      "end": 1361.52,
      "text": " unique features Kiro has compared to other tools. So those are agent hooks and steering. So agent hooks"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1361.52,
      "end": 1365.84,
      "text": " lets you define a prompt that runs automatically when specific things happen in your IDE, like when"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1365.84,
      "end": 1371.6799999999998,
      "text": " a file is created, saved or deleted, as well as on a manual trigger. And this is a bit like custom"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1371.68,
      "end": 1377.04,
      "text": " commands in cloud code. So an examples to that for that are like, if you want to review changed files"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1377.04,
      "end": 1381.28,
      "text": " for potential security issues automatically, like check if you've got credentials in your code."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1381.92,
      "end": 1387.8400000000001,
      "text": " Or another one might be like an internationalization helper. So when you add a new label in one language,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1387.8400000000001,
      "end": 1392,
      "text": " make sure to highlight missing translations in other supported languages and provide an initial"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1392,
      "end": 1397.8400000000001,
      "text": " template translation. Then there's steering. So that steering is basically giving you persistent"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1397.84,
      "end": 1403.36,
      "text": " project knowledge stored in markdown files under dot Kiro slash steering. And Kiro will load that as"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1403.36,
      "end": 1407.6799999999998,
      "text": " context on every prompt. So it basically stops you from having to continuously steer it back in the kind"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1407.6799999999998,
      "end": 1415.52,
      "text": " of style or patterns you prefer to have. So it feels very similar to cloud.md with cloud code or cursor rules"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1415.52,
      "end": 1421.28,
      "text": " if you use cursor, but it's a bit more structured. You get default files for product overview, your tech stack"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1421.28,
      "end": 1425.52,
      "text": " and your project structure. And you can also reference live files from the repo inside a steering file."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1425.52,
      "end": 1430,
      "text": " And they'll be loaded as well into the context window of each prompt, which is, it seems like a nice approach."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1430,
      "end": 1436.24,
      "text": " Now, all this is all very well and good, but it completely depends on what it costs. So what does it cost?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1436.24,
      "end": 1442.08,
      "text": " Exactly. Let's talk about pricing finally. So this actually is very, very new because only last week"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1442.08,
      "end": 1448.56,
      "text": " AWS published a relevant blog post to disclose what they have in mind after the beta phase is completed."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1448.56,
      "end": 1453.36,
      "text": " And we'll link in the show notes to that particular blog post so you can see all the details yourself."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1453.36,
      "end": 1458.7199999999998,
      "text": " But let's try to give you a summary as well. So at the moment, there are four different plans."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1458.7199999999998,
      "end": 1464.08,
      "text": " So there is the free, the pro, the pro plus and the power. And each plan has a different price and limits"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1464.08,
      "end": 1469.6799999999998,
      "text": " in terms of requests and prompts that you can run, which by the way, is quite interesting because almost"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1469.6799999999998,
      "end": 1476.24,
      "text": " every other competitor is based on tokens. In the case of Kiro, they look at the number of prompts, basically,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1476.24,
      "end": 1481.6,
      "text": " the free plan, which is, I don't know, I feel it's a little bit looser in terms of unit,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1481.6,
      "end": 1485.28,
      "text": " but might work better because it's probably closer to what a user can understand."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1486.08,
      "end": 1491.44,
      "text": " So the free plan gives you, oh, by the way, there is an important difference between vibe mode and spec"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1491.44,
      "end": 1496.56,
      "text": " mode. We already mentioned that Kiro supports both. So vibe mode is just give it a prompt and it's going"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1496.56,
      "end": 1501.9199999999998,
      "text": " to try to guess what you really want based on a very loose prompt. While spec mode is that entire"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1501.9199999999998,
      "end": 1506.72,
      "text": " process where you work together through a series of documents before the work can actually start."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1506.72,
      "end": 1512.48,
      "text": " So of course, you can imagine that vibe mode is much lighter in terms of AI usage, while spec mode"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1512.48,
      "end": 1517.9199999999998,
      "text": " is a much more involved process that requires a lot more interaction with AI. So more expensive from"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1517.9199999999998,
      "end": 1523.28,
      "text": " just a computational perspective. So when you go with the free plan, you get 50 vibe requests per month"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1523.28,
      "end": 1530.32,
      "text": " and zero spec requests. So no spec, if you go with the free plan, the pro plan has 225 vibe and 125"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1530.32,
      "end": 1539.44,
      "text": " spec, and it costs you $20 a month. The pro plus has 450 vibe and 250 spec, and it costs you $40 a month."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1540.08,
      "end": 1545.36,
      "text": " So it's exactly doubled the pro plan in everything. And then there is the power plan, which is like"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1545.36,
      "end": 1552.8799999999999,
      "text": " 2250 vibe and 1250 spec per month, and it costs you $200. So there is a steep increase there,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1552.88,
      "end": 1558.8000000000002,
      "text": " but you also get a lot more usage in terms of vibe and spec. So there is actually a welcome bonus. So when"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1558.8000000000002,
      "end": 1565.5200000000002,
      "text": " you join the first 14 days, you have like a trial run where you can do 100 spec and 105 included in that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1565.5200000000002,
      "end": 1571.0400000000002,
      "text": " trial run. But of course, after the 14 days, all of this stuff is removed. So you better use it fast."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1571.0400000000002,
      "end": 1577.0400000000002,
      "text": " And also you can enable pay as you go. So if you reach one of these limits, and you still need to use the tool,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1577.0400000000002,
      "end": 1582.3200000000002,
      "text": " you don't necessarily need to upgrade to the next plan because you can just pay for whatever else you need."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1582.32,
      "end": 1588.24,
      "text": " And the rates are $0.04 per every single vibe and $0.20 per spec. And again, I want to underline that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1588.24,
      "end": 1594,
      "text": " the pricing is not per token. So people might wonder, okay, what does a spec gives me? And"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1594,
      "end": 1598.48,
      "text": " actually, there is a note somewhere in the article that says that if you try to do complex actions,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1598.48,
      "end": 1604.24,
      "text": " you might end up consuming multiple requests. So this is something worth noting that I think you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1604.24,
      "end": 1609.28,
      "text": " cannot just game the system and try to use one prompt to do 1 million things. Because I think there is"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1609.28,
      "end": 1614.96,
      "text": " a mechanism that realizes and it will still be built accordingly to some kind of unit that I don't"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1614.96,
      "end": 1619.92,
      "text": " think is super well described. But yeah, you cannot just let it do everything with just one"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1619.92,
      "end": 1625.12,
      "text": " ask and expect that it's going to cost you only one request. There is, by the way, a very useful usage"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1625.12,
      "end": 1630.16,
      "text": " dashboard that shows exactly what is your current consumption for every kind of request. And if you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1630.16,
      "end": 1636.3999999999999,
      "text": " are using any of the overages in case you enable that feature. So at least you can keep things in check and"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1636.4,
      "end": 1642.96,
      "text": " understand where you're going with your spend. Now, this pricing has been a little bit debated in"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1642.96,
      "end": 1647.44,
      "text": " the AWS community. I've seen some very common complaints. And I think some of them are fair to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1647.44,
      "end": 1652.88,
      "text": " share here. Like for instance, when you get at the beginning free zero spec credits, it makes it really"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1652.88,
      "end": 1658.16,
      "text": " hard to really evaluate one of what I believe is the best features of Kiro. So it's a little bit of a"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1658.16,
      "end": 1663.3600000000001,
      "text": " shame that users might not even realize that how powerful is that feature just because they are"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1663.36,
      "end": 1667.6799999999998,
      "text": " discouraged by either pricing or maybe because they have a free plan and they don't have any more."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1668.24,
      "end": 1672.8799999999999,
      "text": " Maybe they expired the 14 days trial. So they don't effectively have a way to test if the spec thing"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1672.8799999999999,
      "end": 1677.12,
      "text": " is actually really good for them. The other complaint is that cost feels a little bit unpredictable."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1677.12,
      "end": 1683.6799999999998,
      "text": " One task can consume multiple spec or vibe. So what happens? How much is this going to cost me? You"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1683.6799999999998,
      "end": 1687.9199999999998,
      "text": " don't necessarily can you cannot tell upfront when you're starting to do an action how much it's going to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1687.92,
      "end": 1694.4,
      "text": " cost you. And then the spec between vibe and sorry, the split between vibe and spec. It's nice in a way,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1694.4,
      "end": 1699.04,
      "text": " but also adds cognitive load because you have to always think, okay, which mode do I need to use?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1699.04,
      "end": 1705.2,
      "text": " How much credit do I have left for each mode? And so it kind of makes developers work a little bit"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1705.2,
      "end": 1710.72,
      "text": " more just to really understand what am I going to build on? And do I actually even have the credits for"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1710.72,
      "end": 1715.68,
      "text": " what I want to do? So I think this it's important to say that this pricing decision doesn't really seem"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1715.68,
      "end": 1720,
      "text": " final from the AWS perspective. So probably important for you to provide feedback. If you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1720,
      "end": 1725.2,
      "text": " have ideas or complaints, make sure you express them to AWS, because I expect this is probably the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1725.2,
      "end": 1729.3600000000001,
      "text": " best phase of this product to try to influence future outcomes in this sense."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1729.3600000000001,
      "end": 1735.2,
      "text": " Yeah, that makes sense. I think it's interesting. I don't know how you can make a better pricing model,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1735.2,
      "end": 1739.8400000000001,
      "text": " to be honest, because I think even when you're using token based pricing, it's still very difficult"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1739.8400000000001,
      "end": 1744.0800000000002,
      "text": " to anticipate how many you're going to use, especially when it's agentic and the agent is generating"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1744.08,
      "end": 1748.48,
      "text": " prompts for you with all sorts of different contexts from all over the place. So it doesn't seem like a"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1748.48,
      "end": 1753.52,
      "text": " deterministic pricing model is that easy to achieve. Let's see how this one evolves because AWS do,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1753.52,
      "end": 1760.3999999999999,
      "text": " from time to time, move things in a more cost-effective direction. I just wanted to ask some"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1760.3999999999999,
      "end": 1765.9199999999998,
      "text": " questions since you've spent a lot more time than I have with Kiro. I just wanted to get your overall"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1765.9199999999998,
      "end": 1769.36,
      "text": " opinion. So do you think it's valuable as a product in its own right?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1769.36,
      "end": 1775.52,
      "text": " I'd say yes, more yes than no."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1775.52,
      "end": 1780.1599999999999,
      "text": " And just because of the spec-driven approach is, yeah, it made me feel like I'm always working together with a product manager and a very skilled technical"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1780.1599999999999,
      "end": 1785.1999999999998,
      "text": " person in a team, even when I'm working alone. And I think there's lots of value in that."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1785.1999999999998,
      "end": 1789.6799999999998,
      "text": " And that whole process makes you go from an idea that sometimes even you think you have a really"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1789.6799999999998,
      "end": 1794.9599999999998,
      "text": " clear understanding of the idea, you'd be surprised after going through the process, how many gaps you had"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1794.96,
      "end": 1800.16,
      "text": " on the potential implementation of that idea. So definitely there is a huge amount of value in that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1800.16,
      "end": 1806.32,
      "text": " process alone. Okay. Does it have a USB, like if we compare it to other tools in the market?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1807.04,
      "end": 1810.88,
      "text": " Yeah."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1810.88,
      "end": 1816.08,
      "text": " And I think that's a little bit of the challenge for AWS, because I will go as far as saying yes and no, meaning that the spec-driven approach at the moment is the unique value proposition"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1816.08,
      "end": 1822,
      "text": " of this product. But to be realistic, you could recreate a similar experience with any other AI tool."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1822,
      "end": 1826.88,
      "text": " You just need to create prompts and steps, maybe a little bit more manually yourself."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1826.88,
      "end": 1831.92,
      "text": " But I think you can easily achieve a similar experience with something like Cloud Code or Courser"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1831.92,
      "end": 1838.24,
      "text": " or any other Agentee KI just by defining a workflow that kind of describes what we just mentioned when"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1838.24,
      "end": 1844.16,
      "text": " we spoke about the spec-driven approach that Kiro has built in. And in a sense, if Courser,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1844.16,
      "end": 1848.72,
      "text": " for example, just to mention one, or Cloud Code, if they realize, oh, this approach is actually really"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1848.72,
      "end": 1852.64,
      "text": " cool and we can see lots of our users wanting something like that, how long is it going to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1852.64,
      "end": 1856.72,
      "text": " take them to recreate it and make it native in their own solution? I don't think it's going to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1856.72,
      "end": 1862.56,
      "text": " be a difficult thing to recreate. So that can be a bit of a problem for AWS in the sense that they"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1862.56,
      "end": 1866.32,
      "text": " will lose this edge really quickly because it's not really defendable."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1866.32,
      "end": 1873.6,
      "text": " Okay."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1873.6,
      "end": 1874.1599999999999,
      "text": " Now, biggest question for me is, do you believe Amazon is committed to making this product a success?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1874.1599999999999,
      "end": 1880.3999999999999,
      "text": " Yeah, to be honest, I'm unsure."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1880.3999999999999,
      "end": 1884.72,
      "text": " Part of me would like to say yes, because I think I like the product and I see lots of potential value, especially projected into the future. But there were a few"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1884.72,
      "end": 1889.52,
      "text": " things that made me a little bit skeptical. For instance, at the beginning, I saw lots of hype."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1889.52,
      "end": 1895.44,
      "text": " And this hype was, it felt like mostly marketing driven, like if there was a big push organized"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1895.44,
      "end": 1899.84,
      "text": " from the entire community, which is great. I think that's something that should be done from somebody"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1899.84,
      "end": 1905.36,
      "text": " like AWS. But then when I went back to the repo and I saw all the open issues and very little"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1905.36,
      "end": 1910.96,
      "text": " engagement from AWS engineers into all these issues, that made me a little bit worried thinking,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1910.96,
      "end": 1915.44,
      "text": " okay, after all that marketing push, then there isn't an equivalent push from a development"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1915.44,
      "end": 1921.2,
      "text": " perspective, which maybe is just right now in this flow state, AWS hasn't allocated enough people"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1921.2,
      "end": 1925.1200000000001,
      "text": " into the project. So that's something that can be easily fixed, in my opinion. But at the moment,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1925.1200000000001,
      "end": 1930.48,
      "text": " there's a little bit of a warning sign that maybe the hype is not well balanced with the actual"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1930.48,
      "end": 1931.92,
      "text": " development on the product."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1931.92,
      "end": 1937.68,
      "text": " Yeah."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1937.68,
      "end": 1943.04,
      "text": " And I'd reiterate, I think there are a few projects where we can say we've seen AWS invest in open source on a continued basis. I'm thinking primarily of the AWS Lambda power tools, particularly"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1943.04,
      "end": 1948.56,
      "text": " the Python one, where the open source contributions have been fantastic and sustained over a long"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1948.56,
      "end": 1953.36,
      "text": " period of time. But I think it's an outlier. And a lot of projects we see launched with hype"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1953.92,
      "end": 1958.8,
      "text": " tend to fade and gather dust. We really hope that doesn't happen here. Do you think it's worth"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1958.8,
      "end": 1962.6399999999999,
      "text": " migrating at this point from whatever IDE you're using right now to Kiro?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1962.6399999999999,
      "end": 1967.84,
      "text": " That's a difficult one to generalize. I think it's very up to the individuals."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1967.84,
      "end": 1972.8,
      "text": " I think if people are already using VS code, there is very minimal difference. Like even the team gets imported,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1972.8,
      "end": 1979.12,
      "text": " so you don't even feel like you are changing an IDE. So in that sense, it's not a big deal. Although I"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1979.12,
      "end": 1985.9199999999998,
      "text": " think there is an important thing to call out that because Kiro as Cursor and Windsurf are forks of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1985.9199999999998,
      "end": 1990.3999999999999,
      "text": " VS code, I think there is a huge amount of work that needs to happen behind the scenes to keep that fork in"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1990.3999999999999,
      "end": 1996.6399999999999,
      "text": " sync with the evolution of VS code. And to keep it always compatible, as the two products of this"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1996.64,
      "end": 2002.88,
      "text": " multiple forks go ahead in their own history. So if AWS is not really committed to invest in that,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2002.88,
      "end": 2007.1200000000001,
      "text": " then eventually Kiro is not going to be a VS code fork anymore. It's just going to be its own thing,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2007.1200000000001,
      "end": 2012.5600000000002,
      "text": " and it's going to be impossible to migrate from one to the other without losing features or losing"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2012.5600000000002,
      "end": 2017.3600000000001,
      "text": " configuration or whatever. So that's probably the risk in the long term. But in the short term,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2017.3600000000001,
      "end": 2022.48,
      "text": " if you use VS code, you're literally not going to see any difference. So the migration is just like the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2022.48,
      "end": 2029.2,
      "text": " name of the binary that you run effectively. But I would also say that if you come from other ideas"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2029.2,
      "end": 2033.44,
      "text": " or editors, I don't think there is a compelling enough story there for you to move on because"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2033.44,
      "end": 2038.56,
      "text": " that will require a lot of mental effort and just embracing a totally different tool. So in those"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2038.56,
      "end": 2043.3600000000001,
      "text": " cases, you might be better off with something more CLI driven, like cloud code is something that I really"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2043.3600000000001,
      "end": 2049.6,
      "text": " like because you can run it in parallel in another terminal window, and it doesn't affect your main workflow"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2049.6,
      "end": 2053.6,
      "text": " with your ID. But if you like that experience and you want to use something that is a little bit"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2053.6,
      "end": 2059.2799999999997,
      "text": " closer to AWS, you can use Amazon Q developer CLI, which is somewhat similar to cloud code."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2059.2799999999997,
      "end": 2064.24,
      "text": " Yeah. Yeah."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2064.24,
      "end": 2069.92,
      "text": " I tend to agree with that because I'm someone who likes to switch between Vim and VS code and then specific tools, specific languages. Like I find VS code not good enough for Python in general."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2070.56,
      "end": 2075.6,
      "text": " So I use PyCharm for that. So it would suit me better to use the CLI and allow me to control the editor"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2075.6,
      "end": 2082.7999999999997,
      "text": " separately. But given that AWS is moving into having its own IDE, maybe entering the same space"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2082.7999999999997,
      "end": 2090.08,
      "text": " as Microsoft with VS code, is there a larger opportunity for AWS with this tool beyond just"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2090.08,
      "end": 2096.64,
      "text": " agentic AI?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2096.64,
      "end": 2102.96,
      "text": " Yeah, I think this is actually the big topic for us where we can make some guesses and maybe give some suggestions to AWS in this episode. I think there is a good opportunity here, not necessarily"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2102.96,
      "end": 2108.08,
      "text": " in the current form. I think the current form is just driven by the AI hype that is still there,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2108.08,
      "end": 2114.2400000000002,
      "text": " it hasn't faded away yet. But I think the larger opportunity for AWS is if they are investing into"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2114.2400000000002,
      "end": 2119.92,
      "text": " creating their own IDE, it should be much more tightly integrated with the whole AWS ecosystem."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2119.92,
      "end": 2124.7200000000003,
      "text": " So AI, of course, should be a prevalent feature because these days you cannot have an IDE without"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2124.7200000000003,
      "end": 2130.32,
      "text": " AI. And we can see that even with very new projects like the Zed editor, which is a really nice"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2130.32,
      "end": 2135.6800000000003,
      "text": " project that is trying to disrupt the IDE space in their own way, they are also investing a huge"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2135.6800000000003,
      "end": 2141.36,
      "text": " amount into AI. So AI definitely needs to be a cornerstone in any IDE going forward. I think here"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2141.36,
      "end": 2147.84,
      "text": " AWS, as you said, can take a big step forward and trying to imagine KeyRow as the equivalent of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2147.84,
      "end": 2153.6000000000004,
      "text": " VS Code, sorry, Visual Studio, not VS Code, the full Visual Studio IDE that it is for Azure,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2153.6000000000004,
      "end": 2159.44,
      "text": " try to use KeyRow in a way that it becomes that central place where every AWS developer goes"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2159.44,
      "end": 2165.68,
      "text": " to do anything related to AWS. So from scaffolding a new project, writing it, testing it, deploying"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2165.68,
      "end": 2171.52,
      "text": " it, monitoring, operating it in production. When I've seen people using Visual Studio, I see that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2171.52,
      "end": 2177.12,
      "text": " they only use the IDE to interact with everything in Azure, which is quite impressive. I think KeyRow"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2177.12,
      "end": 2182.32,
      "text": " can have an opportunity to become that for the AWS world. So maybe, I don't know, maybe that place"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2182.32,
      "end": 2186.8,
      "text": " doesn't share this vision, but I think that would become a pretty powerful product if they invest"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2186.8,
      "end": 2190.96,
      "text": " in that kind of vision. What do you think? Do you agree with the stake or is it too wild?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2194.5600000000004,
      "end": 2199.36,
      "text": " I think there's a huge number of users out there who would really like that, especially new users who need more of a guided approach. And especially if you're coming to AWS for the first time these"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2199.36,
      "end": 2205.84,
      "text": " days, the AWS console is so overwhelming and all the other tools can be too. If your IDE could have"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2205.84,
      "end": 2212.1600000000003,
      "text": " much more of a guided experience to help users there. We like to do everything with infrastructure as"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2212.16,
      "end": 2218.64,
      "text": " code and SDKs and CLIs, but we don't necessarily represent the majority of users out there."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2218.64,
      "end": 2223.7599999999998,
      "text": " And if you, like you did look at users who are embedded in the Microsoft ecosystem,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2223.7599999999998,
      "end": 2229.44,
      "text": " the tendency tends to be more around using the IDE and visual tooling. And those users need to be"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2229.44,
      "end": 2233.7599999999998,
      "text": " served as well. Like it's not necessarily that our approach is the one approach. So maybe there is"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2233.7599999999998,
      "end": 2238.24,
      "text": " an opportunity for AWS in terms of greater adoption of AWS compared to Azure."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2238.24,
      "end": 2242.56,
      "text": " Yeah. And I think this brings us to the end of this episode, but before giving you the closing"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2242.56,
      "end": 2247.52,
      "text": " notes, I want to say thank you to Forteorem for sponsoring yet another episode of this podcast."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2247.52,
      "end": 2251.52,
      "text": " At Forteorem, we believe that the cloud should be simple, scalable, and cost-effective,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2251.52,
      "end": 2255.8399999999997,
      "text": " and we help teams to just achieve that. So whether you're diving into containers,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2255.8399999999997,
      "end": 2261.04,
      "text": " stepping into event-driven architecture or scaling global SaaS platforms on AWS, or even just trying"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2261.04,
      "end": 2267.9199999999996,
      "text": " to keep cloud spend under control, our team can help you out and we have your back. So visit forteorem.com"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2267.92,
      "end": 2273.36,
      "text": " to see how we can help you and see our customer stories. And hopefully we get to work together."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2273.36,
      "end": 2279.28,
      "text": " So don't hesitate to reach out. Now, just to give you the closing notes, we did a very good overview"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2279.28,
      "end": 2284.32,
      "text": " of Kiro. We really enjoyed the spec-driven approach, and we believe that there is a lot of potential for"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2284.32,
      "end": 2290.32,
      "text": " this product in the future if AWS really commits to polish it out and maybe expand a little bit beyond"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2290.32,
      "end": 2297.52,
      "text": " just the AI focus to integrate it into the bigger AWS ecosystem. Of course, this is just our opinion,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2297.52,
      "end": 2302.6400000000003,
      "text": " so we're really curious to hear what you think. Have you tried it? Do you see yourself using it"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2302.6400000000003,
      "end": 2306.8,
      "text": " more in the future or maybe you just don't like the idea, you prefer other tools? What do you think"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2306.8,
      "end": 2311.6000000000004,
      "text": " of the current pricing? And yes, if you have any answers to the questions, we'd really like to know."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2311.6,
      "end": 2318,
      "text": " So reach out or leave us a comment. We definitely love your opinion and we'll use that for sure in"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2318,
      "end": 2330.88,
      "text": " the following episodes. So stay tuned for more. Thank you and see you in the next one."
    }
  ]
}