{
  "speakers": {
    "spk_0": "spk_0",
    "spk_1": "spk_1"
  },
  "segments": [
    {
      "speakerLabel": "spk_0",
      "start": 0,
      "end": 9.94,
      "text": " Hello and welcome to AWS Bites, the weekly show where we answer your questions about"
    },
    {
      "speakerLabel": "spk_0",
      "start": 9.94,
      "end": 16.16,
      "text": " AWS. I am Luciano and today I'm joined by Eoin. And before we get started, please let"
    },
    {
      "speakerLabel": "spk_0",
      "start": 16.16,
      "end": 22.1,
      "text": " me remind you to please follow and subscribe this channel so you can be up to date every"
    },
    {
      "speakerLabel": "spk_0",
      "start": 22.1,
      "end": 26.98,
      "text": " time we publish new episodes. And today's question is actually somewhat relevant to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 26.98,
      "end": 33.38,
      "text": " this because we want to try and answer the question, how do you keep up with AWS in 2022?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 33.38,
      "end": 38.04,
      "text": " The new year is just around the corner. So what are the best resources out there for"
    },
    {
      "speakerLabel": "spk_0",
      "start": 38.04,
      "end": 44.92,
      "text": " you to know about all the news about AWS every time there is something worth knowing about?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 44.92,
      "end": 50.44,
      "text": " Eoin, do you want to try to start to give an answer to this question?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 55.32,
      "end": 59.7,
      "text": " Yeah, I guess we have to start off saying that everybody should keep listening to AWS and keep subscribing and listen to all the episodes because everything that we think"
    },
    {
      "speakerLabel": "spk_1",
      "start": 59.7,
      "end": 65.04,
      "text": " is relevant and interesting to talk about will be having at least weekly episodes throughout"
    },
    {
      "speakerLabel": "spk_1",
      "start": 65.04,
      "end": 73.03999999999999,
      "text": " 2022. There's so many resources out there. The question is how do you filter out and"
    },
    {
      "speakerLabel": "spk_1",
      "start": 73.03999999999999,
      "end": 79.76,
      "text": " pick something? And I guess my habits change quite regularly and I dip in and out of various"
    },
    {
      "speakerLabel": "spk_1",
      "start": 79.76,
      "end": 84.28,
      "text": " different pieces of content and it depends on my mood and what I'm doing and how much"
    },
    {
      "speakerLabel": "spk_1",
      "start": 84.28,
      "end": 90.16,
      "text": " time I have. And sometimes I don't keep up to date for periods of time. And I guess that's"
    },
    {
      "speakerLabel": "spk_1",
      "start": 90.16,
      "end": 96.04,
      "text": " the same for everybody. There are some people who are going to be obsessively keeping up"
    },
    {
      "speakerLabel": "spk_1",
      "start": 96.04,
      "end": 102.72,
      "text": " to date and following RSS streams, RSS feeds of news announcements. That's not really how"
    },
    {
      "speakerLabel": "spk_1",
      "start": 102.72,
      "end": 110.1,
      "text": " I like to do it. I suppose my strategy is kind of best effort, but also trying to keep"
    },
    {
      "speakerLabel": "spk_1",
      "start": 110.1,
      "end": 116.03999999999999,
      "text": " a passive awareness of what's happening in the world of AWS in the background. And there's"
    },
    {
      "speakerLabel": "spk_1",
      "start": 116.03999999999999,
      "end": 123.64,
      "text": " a couple of fairly fundamental AWS update resources I use just to kind of keep that"
    },
    {
      "speakerLabel": "spk_1",
      "start": 123.64,
      "end": 130.4,
      "text": " passive awareness going. And one is the AWS official podcast. And sometimes I just listen"
    },
    {
      "speakerLabel": "spk_1",
      "start": 130.4,
      "end": 136.76,
      "text": " to that when I'm traveling or have headphones in and I have a bit of time and they basically"
    },
    {
      "speakerLabel": "spk_1",
      "start": 136.76,
      "end": 142.48,
      "text": " just read out all the announcements on that podcast. And so it's not particularly thrilling"
    },
    {
      "speakerLabel": "spk_1",
      "start": 142.48,
      "end": 149.16,
      "text": " or opinionated, but it covers absolutely everything. So if you want to know what easy to instance"
    },
    {
      "speakerLabel": "spk_1",
      "start": 149.16,
      "end": 157.79999999999998,
      "text": " types there are, or what new languages are available for Lex, then it will tell you everything"
    },
    {
      "speakerLabel": "spk_1",
      "start": 157.79999999999998,
      "end": 163.64,
      "text": " in great detail. And it's kind of something that doesn't sink in too deep, but it's there"
    },
    {
      "speakerLabel": "spk_1",
      "start": 163.64,
      "end": 168.82,
      "text": " in the back of your mind. So if you encounter it in the future, you might think about it."
    },
    {
      "speakerLabel": "spk_1",
      "start": 168.82,
      "end": 173.44,
      "text": " And another thing that's really useful for that is there's a Twitter feed. It's Twitter"
    },
    {
      "speakerLabel": "spk_1",
      "start": 173.44,
      "end": 179.57999999999998,
      "text": " bot, not official, but it's called What's New on AWS. And I think it basically just"
    },
    {
      "speakerLabel": "spk_1",
      "start": 179.57999999999998,
      "end": 184.51999999999998,
      "text": " tweets out all the announcements that come on the AWS official blogs. And you end up"
    },
    {
      "speakerLabel": "spk_1",
      "start": 184.51999999999998,
      "end": 190.27999999999997,
      "text": " getting a few notifications per day. If you tick the bell on Twitter, then you get a few"
    },
    {
      "speakerLabel": "spk_1",
      "start": 190.28,
      "end": 195.02,
      "text": " notifications every day and most of them will be pretty irrelevant to you and you can just"
    },
    {
      "speakerLabel": "spk_1",
      "start": 195.02,
      "end": 201,
      "text": " ignore them instantly, but others are interesting and then you can dig deeper and read about"
    },
    {
      "speakerLabel": "spk_1",
      "start": 201,
      "end": 204.98,
      "text": " them. So I find that really efficient way of keeping up to date. So those are pretty"
    },
    {
      "speakerLabel": "spk_1",
      "start": 204.98,
      "end": 207.08,
      "text": " boring ones, but very useful."
    },
    {
      "speakerLabel": "spk_1",
      "start": 207.08,
      "end": 212,
      "text": " Yeah."
    },
    {
      "speakerLabel": "spk_0",
      "start": 212,
      "end": 217.2,
      "text": " I suppose on the last one, if you are more of a feed reader type of person, you can just subscribe to the feed reader from the official AWS announcement blog and you'll"
    },
    {
      "speakerLabel": "spk_0",
      "start": 217.2,
      "end": 222.39999999999998,
      "text": " get the same type of content from the Twitter post. So yeah, it's interesting that we have"
    },
    {
      "speakerLabel": "spk_0",
      "start": 222.39999999999998,
      "end": 229.23999999999998,
      "text": " these days a huge variety of medias where you can consume information from. I don't"
    },
    {
      "speakerLabel": "spk_0",
      "start": 229.23999999999998,
      "end": 234.2,
      "text": " know, another option could be YouTube channels. There is no shortage of YouTube channels related"
    },
    {
      "speakerLabel": "spk_0",
      "start": 234.2,
      "end": 243.51999999999998,
      "text": " to AWS and definitely a few shout outs to Marcia Villalba, FUBAR. It's a really good"
    },
    {
      "speakerLabel": "spk_0",
      "start": 243.52,
      "end": 249.32000000000002,
      "text": " one. And I know that Marcia is also doing content in Spanish, so that could be also"
    },
    {
      "speakerLabel": "spk_0",
      "start": 249.32000000000002,
      "end": 254.20000000000002,
      "text": " interesting. Could be another way to access this information if you prefer content in"
    },
    {
      "speakerLabel": "spk_0",
      "start": 254.20000000000002,
      "end": 259.8,
      "text": " another language. There is again, no shortage of material out there. So that's another one"
    },
    {
      "speakerLabel": "spk_0",
      "start": 259.8,
      "end": 266.40000000000003,
      "text": " that is definitely recommended. I'm always flipping between, I suppose, more YouTube"
    },
    {
      "speakerLabel": "spk_0",
      "start": 266.4,
      "end": 274.35999999999996,
      "text": " videos and classic, more traditional blog posts or written articles. And I want to give"
    },
    {
      "speakerLabel": "spk_0",
      "start": 274.35999999999996,
      "end": 280.71999999999997,
      "text": " another shout out to Borislav Atziv. I hope I am pronouncing it right. I ended up reading"
    },
    {
      "speakerLabel": "spk_0",
      "start": 280.71999999999997,
      "end": 286.28,
      "text": " a lot of his CDK blog posts. They are very good, very in detail, and generally you find"
    },
    {
      "speakerLabel": "spk_0",
      "start": 286.28,
      "end": 291.88,
      "text": " very complete examples. So that was a very specific quest for me at the beginning of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 291.88,
      "end": 296.92,
      "text": " last year to start learning more and more about CDK. So I ended up in this blog post"
    },
    {
      "speakerLabel": "spk_0",
      "start": 296.92,
      "end": 300.48,
      "text": " and then started to read the next one and the next one and the next one and there is"
    },
    {
      "speakerLabel": "spk_0",
      "start": 300.48,
      "end": 305.7,
      "text": " a lot of good material out there. It's very niche. I think it's mostly CDK, but if that's"
    },
    {
      "speakerLabel": "spk_0",
      "start": 305.7,
      "end": 311.08,
      "text": " something you want to learn more about, definitely I recommend that particular blog. And by the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 311.08,
      "end": 319.32,
      "text": " way, you'll find all the links in the description of this episode. And yeah, let's see. Another"
    },
    {
      "speakerLabel": "spk_0",
      "start": 319.32,
      "end": 326.92,
      "text": " one that I really like in terms of blog, and it's a little bit different, I guess, from"
    },
    {
      "speakerLabel": "spk_0",
      "start": 326.92,
      "end": 339.76,
      "text": " most blogs is Werner Vogel's own blog post, because there is a huge effort in publishing"
    },
    {
      "speakerLabel": "spk_0",
      "start": 339.76,
      "end": 344.14,
      "text": " regularly, I would say, but there are some blog posts that are actually very deep and"
    },
    {
      "speakerLabel": "spk_0",
      "start": 344.14,
      "end": 349.47999999999996,
      "text": " you get a lot of principles and ideas about how to architect distributed systems, which"
    },
    {
      "speakerLabel": "spk_0",
      "start": 349.47999999999996,
      "end": 354.03999999999996,
      "text": " is not always strictly related to AWS, but of course, it's some knowledge that you need"
    },
    {
      "speakerLabel": "spk_0",
      "start": 354.03999999999996,
      "end": 360.24,
      "text": " to have and you need to keep building if you want to use AWS efficiently. And with that,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 360.24,
      "end": 364.8,
      "text": " of course, there are mixed blog posts where the focus is more maybe on a new service of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 364.8,
      "end": 370.09999999999997,
      "text": " AWS. So you can definitely also find that kind of, okay, what's new on AWS type of material."
    },
    {
      "speakerLabel": "spk_0",
      "start": 370.1,
      "end": 376.76000000000005,
      "text": " So I think it's an interesting combination of strictly related AWS topics, but also things"
    },
    {
      "speakerLabel": "spk_0",
      "start": 376.76000000000005,
      "end": 384.68,
      "text": " that you might need to know in terms of how to architect good distributed systems. Yeah."
    },
    {
      "speakerLabel": "spk_0",
      "start": 384.68,
      "end": 389.72,
      "text": " Anything else on your radar? Yeah."
    },
    {
      "speakerLabel": "spk_1",
      "start": 389.72,
      "end": 394.72,
      "text": " There's a couple, I suppose, the first few things we mentioned that were about just keeping up to date with news announcements."
    },
    {
      "speakerLabel": "spk_1",
      "start": 394.72,
      "end": 398.90000000000003,
      "text": " We're getting into more like, how do you keep up to date with community and best practices"
    },
    {
      "speakerLabel": "spk_1",
      "start": 398.9,
      "end": 406.88,
      "text": " and how to's and there's so much there. There's one set of resources I've been using quite"
    },
    {
      "speakerLabel": "spk_1",
      "start": 406.88,
      "end": 413.56,
      "text": " a lot, which is the CloudAnnot blog and YouTube channel. And this is from Andreas and Michael"
    },
    {
      "speakerLabel": "spk_1",
      "start": 413.56,
      "end": 420.44,
      "text": " Wittig, who are brothers who have an AWS consultancy. And the one thing that stands out about this"
    },
    {
      "speakerLabel": "spk_1",
      "start": 420.44,
      "end": 425.84,
      "text": " content to me is that if you're looking for knowledge, as opposed to just discussion and"
    },
    {
      "speakerLabel": "spk_1",
      "start": 425.84,
      "end": 433.35999999999996,
      "text": " opinions, these videos and blog posts are just really well crafted and very well thought"
    },
    {
      "speakerLabel": "spk_1",
      "start": 433.35999999999996,
      "end": 439.91999999999996,
      "text": " out and informative. So they're always, I think, done in such a way that you have the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 439.91999999999996,
      "end": 444.65999999999997,
      "text": " video and the accompanying blog posts. So you've got both formats and they're just really"
    },
    {
      "speakerLabel": "spk_1",
      "start": 444.65999999999997,
      "end": 451.12,
      "text": " well done. So if you're looking for how to set up SSO, for example, for the first time,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 451.12,
      "end": 457.34000000000003,
      "text": " or basic stuff around IAM or how to do code pipeline and code build, they've quite a lot"
    },
    {
      "speakerLabel": "spk_1",
      "start": 457.34000000000003,
      "end": 461.24,
      "text": " of blogs that are just really informative and really well thought out. And I think they"
    },
    {
      "speakerLabel": "spk_1",
      "start": 461.24,
      "end": 467.92,
      "text": " stand out as being different because they're just really knowledge rich and well structured"
    },
    {
      "speakerLabel": "spk_1",
      "start": 467.92,
      "end": 474,
      "text": " and they're not so opinion based."
    },
    {
      "speakerLabel": "spk_0",
      "start": 474,
      "end": 478,
      "text": " They look like tutorials, right?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 478,
      "end": 484.92,
      "text": " Yeah, exactly. Yeah. And they're just really well written and you always leave with a sense"
    },
    {
      "speakerLabel": "spk_1",
      "start": 484.92,
      "end": 489.2,
      "text": " that you have a much more complete understanding than you started with."
    },
    {
      "speakerLabel": "spk_0",
      "start": 489.2,
      "end": 494.64,
      "text": " Yeah. And I also like that they have this kind of double format video and text so you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 494.64,
      "end": 500.56,
      "text": " can pick your favorite or even consume both as a second way of digesting the same type"
    },
    {
      "speakerLabel": "spk_0",
      "start": 500.56,
      "end": 502.28,
      "text": " of information."
    },
    {
      "speakerLabel": "spk_0",
      "start": 502.28,
      "end": 508.76,
      "text": " Yeah, that's good. That's good. Yeah. And you were talking about Werner Fokkel's content."
    },
    {
      "speakerLabel": "spk_1",
      "start": 508.76,
      "end": 515.4,
      "text": " That's quite, I suppose, like you say, deeper. The builders library in AWS is kind of similar"
    },
    {
      "speakerLabel": "spk_1",
      "start": 515.4,
      "end": 522.9599999999999,
      "text": " to that, isn't it? In that it's deeper architectural practices and organizational practices that"
    },
    {
      "speakerLabel": "spk_1",
      "start": 522.9599999999999,
      "end": 527.24,
      "text": " are, I suppose, require a little bit more study."
    },
    {
      "speakerLabel": "spk_1",
      "start": 527.24,
      "end": 534.72,
      "text": " Yeah. Yeah."
    },
    {
      "speakerLabel": "spk_0",
      "start": 534.72,
      "end": 542.04,
      "text": " There are a couple actually of interesting articles that were even mentioned by Werner Vogels at his latest re-invent keynote. And one is about the importance of constant"
    },
    {
      "speakerLabel": "spk_0",
      "start": 542.04,
      "end": 549.04,
      "text": " work. Another one is about how to design idempotent IPIs. And I think those two articles are actually"
    },
    {
      "speakerLabel": "spk_0",
      "start": 549.04,
      "end": 554.44,
      "text": " very good in giving you information that maybe you have been exposed to, but probably you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 554.44,
      "end": 558.44,
      "text": " kind of underestimated. And it's good that they remark why these kind of concepts are"
    },
    {
      "speakerLabel": "spk_0",
      "start": 558.44,
      "end": 565.2,
      "text": " so important to build very good distributed systems. But also they are kind of representative"
    },
    {
      "speakerLabel": "spk_0",
      "start": 565.2,
      "end": 571.2,
      "text": " of the type of content you can find in this particular section of the AWS website. So"
    },
    {
      "speakerLabel": "spk_0",
      "start": 571.2,
      "end": 578.4200000000001,
      "text": " all the content is pretty much that in-depth focus on one specific architectural topic."
    },
    {
      "speakerLabel": "spk_0",
      "start": 578.4200000000001,
      "end": 582.6,
      "text": " So if you are trying to become an architect or if you are already an architect and you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 582.6,
      "end": 588.28,
      "text": " want to explore more in-depth topics, I think that that's really a good resource."
    },
    {
      "speakerLabel": "spk_0",
      "start": 588.28,
      "end": 597.4,
      "text": " Yeah. Okay. That sounds good."
    },
    {
      "speakerLabel": "spk_1",
      "start": 597.4,
      "end": 601.2,
      "text": " I mean, when I'm in kind of busy periods, I guess it gets very difficult trying to watch videos or read blog posts and getting the time to actually"
    },
    {
      "speakerLabel": "spk_1",
      "start": 601.2,
      "end": 605.08,
      "text": " sit down and focus. But podcasts can be pretty useful sometimes because you can have them"
    },
    {
      "speakerLabel": "spk_1",
      "start": 605.08,
      "end": 608.6,
      "text": " on in the background and you mightn't hear everything and you might be able to focus"
    },
    {
      "speakerLabel": "spk_1",
      "start": 608.6,
      "end": 613.9200000000001,
      "text": " on everything, but sometimes some of it just does stick and that could be useful and serve"
    },
    {
      "speakerLabel": "spk_1",
      "start": 613.9200000000001,
      "end": 617.9200000000001,
      "text": " you in the future. So do you have any go-to podcasts?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 617.9200000000001,
      "end": 624.0400000000001,
      "text": " I actually want to mention two of them. One is probably the newest I've seen in this space"
    },
    {
      "speakerLabel": "spk_0",
      "start": 624.0400000000001,
      "end": 631.38,
      "text": " is Adam Elmore's AWS FM. And I really liked that one because it feels a little bit lighter"
    },
    {
      "speakerLabel": "spk_0",
      "start": 631.38,
      "end": 636.22,
      "text": " than at least many of the other types of content we have been mentioning because it's more"
    },
    {
      "speakerLabel": "spk_0",
      "start": 636.22,
      "end": 642.6,
      "text": " a conversation between people that are prominent in the AWS ecosystem. And it's more about,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 642.6,
      "end": 647.8000000000001,
      "text": " I don't know, their life story, what they built, how did they get to the place where"
    },
    {
      "speakerLabel": "spk_0",
      "start": 647.8000000000001,
      "end": 652.52,
      "text": " they are today. And of course, you get to learn a lot of interesting information about"
    },
    {
      "speakerLabel": "spk_0",
      "start": 652.52,
      "end": 658.76,
      "text": " AWS, but it's more about the personal journey of the guests. So I think this is the kind"
    },
    {
      "speakerLabel": "spk_0",
      "start": 658.76,
      "end": 663.84,
      "text": " of podcast you can listen without necessarily being too focused on the content, but still"
    },
    {
      "speakerLabel": "spk_0",
      "start": 663.84,
      "end": 668.52,
      "text": " you can get a pretty good value for the time you spend listening to the podcast. So I really"
    },
    {
      "speakerLabel": "spk_0",
      "start": 668.52,
      "end": 672.84,
      "text": " liked that particular format. But there is another one that is a little"
    },
    {
      "speakerLabel": "spk_0",
      "start": 672.84,
      "end": 680.0400000000001,
      "text": " bit more technical, it's from Yan Cui, which is Real-World Serverless. And that one is"
    },
    {
      "speakerLabel": "spk_0",
      "start": 680.0400000000001,
      "end": 684.34,
      "text": " a lot more, well, first of all, it's focused on serverless, but it's more the story of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 684.34,
      "end": 689.9200000000001,
      "text": " people that have built successful systems using serverless and what they learned. So"
    },
    {
      "speakerLabel": "spk_0",
      "start": 689.92,
      "end": 694.9599999999999,
      "text": " there is a lot more like serverless from the trenches or you get to hear, okay, this did"
    },
    {
      "speakerLabel": "spk_0",
      "start": 694.9599999999999,
      "end": 700.56,
      "text": " work, this did work. So that's a lot more practical and focused. So if you are interested"
    },
    {
      "speakerLabel": "spk_0",
      "start": 700.56,
      "end": 708.68,
      "text": " in serverless, that's really a great resource. Yeah."
    },
    {
      "speakerLabel": "spk_1",
      "start": 708.68,
      "end": 714.24,
      "text": " And Yan Cui also has a bunch of really good blog posts on serverless that are, I suppose, indispensable for anybody in the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 714.24,
      "end": 719.14,
      "text": " space. I really like those two podcasts too. I mean, and there's the serverless chats one"
    },
    {
      "speakerLabel": "spk_1",
      "start": 719.14,
      "end": 725.4,
      "text": " as well. I guess they all have different styles and approaches and it depends on the kind"
    },
    {
      "speakerLabel": "spk_1",
      "start": 725.4,
      "end": 730,
      "text": " of mood I'm in, which one I listen to. But I do really like that real world serverless"
    },
    {
      "speakerLabel": "spk_1",
      "start": 730,
      "end": 734.8,
      "text": " approach where you get people talking about the use cases and stuff they're really building"
    },
    {
      "speakerLabel": "spk_1",
      "start": 734.8,
      "end": 742.3199999999999,
      "text": " and ultimately what doesn't work, which is sometimes missing from a lot of other content."
    },
    {
      "speakerLabel": "spk_1",
      "start": 742.3199999999999,
      "end": 745.4,
      "text": " Like what are the gotchas and the failure modes?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 749.28,
      "end": 750.28,
      "text": " Yeah, I think in a similar vein- Is there anybody?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 750.28,
      "end": 756.4399999999999,
      "text": " Exactly. Yeah, because Twitter is another way to consume pretty much like random content,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 756.4399999999999,
      "end": 761.56,
      "text": " right? But if you follow people then in a specific niche, then you get more focused"
    },
    {
      "speakerLabel": "spk_0",
      "start": 761.56,
      "end": 767.6,
      "text": " on that particular type of content. And there are in particular three profiles that I really"
    },
    {
      "speakerLabel": "spk_0",
      "start": 767.6,
      "end": 773.76,
      "text": " like. Emily Shea is probably one of the new profiles that I started to follow recently"
    },
    {
      "speakerLabel": "spk_0",
      "start": 773.76,
      "end": 779,
      "text": " and she has been producing a lot of amazing content, especially targeting people that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 779,
      "end": 785.28,
      "text": " are starting with AWS. So if you are in that particular part of the journey, definitely"
    },
    {
      "speakerLabel": "spk_0",
      "start": 785.28,
      "end": 792.36,
      "text": " follow Emily. You'll get a lot of value for that. And then other two are evangelists in"
    },
    {
      "speakerLabel": "spk_0",
      "start": 792.36,
      "end": 798.04,
      "text": " AWS, Danilo Poce and 8OrLess. I think we mentioned them already in a previous episode. They are"
    },
    {
      "speakerLabel": "spk_0",
      "start": 798.04,
      "end": 802.84,
      "text": " always producing a huge amount of material and even just giving you information about"
    },
    {
      "speakerLabel": "spk_0",
      "start": 802.84,
      "end": 808.52,
      "text": " new services or things that you can now do in AWS that maybe you couldn't do before or"
    },
    {
      "speakerLabel": "spk_0",
      "start": 808.52,
      "end": 816.32,
      "text": " it was more complicated. So it's good also to get few bits of information by just following"
    },
    {
      "speakerLabel": "spk_0",
      "start": 816.32,
      "end": 825.1600000000001,
      "text": " their profiles. So definitely recommend it. Do you have any other profile you would recommend?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 825.1600000000001,
      "end": 829.76,
      "text": " I guess, yeah, I just wanted to call out, since you mentioned Emily Shea, I think we"
    },
    {
      "speakerLabel": "spk_1",
      "start": 829.76,
      "end": 835.4399999999999,
      "text": " both managed to catch Emily's talk at Reinvent, which was a really, really excellent talk"
    },
    {
      "speakerLabel": "spk_1",
      "start": 835.4399999999999,
      "end": 840.04,
      "text": " on serverless. And I think a lot of people who are using AWS, but thinking about getting"
    },
    {
      "speakerLabel": "spk_1",
      "start": 840.04,
      "end": 844,
      "text": " into serverless might be looking at that in the new year and how do you discover more"
    },
    {
      "speakerLabel": "spk_1",
      "start": 844,
      "end": 848.52,
      "text": " about serverless? And I think Emily's talk is a really good place to start. But another"
    },
    {
      "speakerLabel": "spk_1",
      "start": 848.52,
      "end": 856.88,
      "text": " one I wanted to mention, and I think we mentioned serverless chats and Jeremy Daily as well."
    },
    {
      "speakerLabel": "spk_1",
      "start": 856.88,
      "end": 861.4399999999999,
      "text": " Jeremy's off by none newsletter is a really, really good resource. So it's a weekly newsletter"
    },
    {
      "speakerLabel": "spk_1",
      "start": 861.4399999999999,
      "end": 867.04,
      "text": " and because there's so much content out there, I think Jeremy puts a lot of time into distilling"
    },
    {
      "speakerLabel": "spk_1",
      "start": 867.04,
      "end": 873.64,
      "text": " it down into like, here's some articles that I'd like to highlight for you. And it just"
    },
    {
      "speakerLabel": "spk_1",
      "start": 873.64,
      "end": 877.8,
      "text": " makes it really efficient to keep up to date without having to do all the work. He's kind"
    },
    {
      "speakerLabel": "spk_1",
      "start": 877.8,
      "end": 881.32,
      "text": " of done all the effort for you. So I just wanted to shout that out. And he's on Twitter"
    },
    {
      "speakerLabel": "spk_1",
      "start": 881.32,
      "end": 889.2800000000001,
      "text": " as well. So we'll add his Twitter handle into the feed as well. But I think that's covered"
    },
    {
      "speakerLabel": "spk_1",
      "start": 889.2800000000001,
      "end": 893.24,
      "text": " everything I had anyway. I think there's plenty there for people. But I'd be interested if"
    },
    {
      "speakerLabel": "spk_1",
      "start": 893.24,
      "end": 896.2800000000001,
      "text": " what are we missing? Maybe people have some good suggestions out there."
    },
    {
      "speakerLabel": "spk_0",
      "start": 902.44,
      "end": 907.0400000000001,
      "text": " Yeah, it would be great if you can just leave us a comment or a tweet saying, okay, I would recommend this particular resource for whatever reason you like it. I think that will help"
    },
    {
      "speakerLabel": "spk_0",
      "start": 907.04,
      "end": 912.48,
      "text": " us to give even more ideas and content to people following us. And also for us, maybe"
    },
    {
      "speakerLabel": "spk_0",
      "start": 912.48,
      "end": 916.76,
      "text": " we can discover resources that we didn't know about. So that would be amazing."
    },
    {
      "speakerLabel": "spk_1",
      "start": 922.88,
      "end": 928.76,
      "text": " Yeah, maybe a good new year's resolution is to switch the people you follow and change the content you're consuming just to get out of the filter bubble and get some new perspectives"
    },
    {
      "speakerLabel": "spk_1",
      "start": 928.76,
      "end": 934.8399999999999,
      "text": " on everything AWS. Absolutely. Okay."
    },
    {
      "speakerLabel": "spk_0",
      "start": 934.84,
      "end": 940.24,
      "text": " I think that's all we have for today. Thanks again for being with us and listening to this episode. Again, make"
    },
    {
      "speakerLabel": "spk_0",
      "start": 940.24,
      "end": 947.48,
      "text": " sure to follow and subscribe us. And yeah, again, if you have comments or opinions, please"
    },
    {
      "speakerLabel": "spk_0",
      "start": 947.48,
      "end": 952.8000000000001,
      "text": " share them. We'd love to hear. And if you have any question you would like us to answer,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 952.8000000000001,
      "end": 959.44,
      "text": " definitely send it our way and we'll try our best in one of the next episodes. And that's"
    },
    {
      "speakerLabel": "spk_0",
      "start": 959.44,
      "end": 972.2800000000001,
      "text": " all. See you in the next episode."
    }
  ]
}