{
  "speakers": {
    "spk_0": "Eoin",
    "spk_1": "Luciano"
  },
  "segments": [
    {
      "speakerLabel": "spk_0",
      "start": 0,
      "end": 4.58,
      "text": " Hello today we were going to answer the question should I get AWS certification"
    },
    {
      "speakerLabel": "spk_0",
      "start": 4.9,
      "end": 10.34,
      "text": " And we're going to cover why a certification can be important from the perspective of individuals and companies"
    },
    {
      "speakerLabel": "spk_0",
      "start": 10.9,
      "end": 17.62,
      "text": " What are the certifications available? We're going to give some suggestions for a study plan and various resources and tips"
    },
    {
      "speakerLabel": "spk_0",
      "start": 17.62,
      "end": 29.8,
      "text": " My name is Eoin and today I'm joined by Luciano and this is the AWS bytes podcast"
    },
    {
      "speakerLabel": "spk_0",
      "start": 29.86,
      "end": 35.52,
      "text": " The first question I think we can answer is is it worth it to get AWS certification?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 35.980000000000004,
      "end": 37.980000000000004,
      "text": " Do you want to try and answer that Luciano?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 40.64,
      "end": 46.760000000000005,
      "text": " Yeah, I guess that's it's the good first question and the answer of course again as usual is it depends and"
    },
    {
      "speakerLabel": "spk_1",
      "start": 46.76,
      "end": 50.9,
      "text": " I suppose we can discuss different perspectives"
    },
    {
      "speakerLabel": "spk_1",
      "start": 50.94,
      "end": 57.5,
      "text": " The first one is you are somebody that already has some degree of experience with AWS or the cloud in general"
    },
    {
      "speakerLabel": "spk_1",
      "start": 57.5,
      "end": 62.239999999999995,
      "text": " And in that case, maybe it's a little bit trickier to say yes or no"
    },
    {
      "speakerLabel": "spk_1",
      "start": 62.72,
      "end": 65.2,
      "text": " It yeah, it depends on your current situation"
    },
    {
      "speakerLabel": "spk_1",
      "start": 65.28,
      "end": 70.64,
      "text": " But most likely it's gonna add less value to you because you already have experience you can probably prove"
    },
    {
      "speakerLabel": "spk_1",
      "start": 70.64,
      "end": 77.98,
      "text": " In your workplace or if you're doing an interview that you already know your stuff and you don't need a certification"
    },
    {
      "speakerLabel": "spk_1",
      "start": 79.24,
      "end": 86.14,
      "text": " But if you are just starting your cloud journey or your software engineering journey, and you are interested in the cloud in general"
    },
    {
      "speakerLabel": "spk_1",
      "start": 87,
      "end": 93.78,
      "text": " Trying to get a certification could help you a lot boosting your well first of all your self-confidence"
    },
    {
      "speakerLabel": "spk_1",
      "start": 93.78,
      "end": 98.2,
      "text": " But also going into interviews or trying to grow in your existing workplace"
    },
    {
      "speakerLabel": "spk_1",
      "start": 98.2,
      "end": 102.16,
      "text": " It can be like very beneficial to get that certification"
    },
    {
      "speakerLabel": "spk_1",
      "start": 102.68,
      "end": 109.46000000000001,
      "text": " And on the other side other than just the title itself. I think going through the journey of studying for the certification"
    },
    {
      "speakerLabel": "spk_1",
      "start": 109.46000000000001,
      "end": 116.26,
      "text": " It's something gives you a very good overview on what are all the different services. What are the things that are more important?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 116.64,
      "end": 121.64,
      "text": " How to learn all the different concepts like in which order it makes the most sense"
    },
    {
      "speakerLabel": "spk_1",
      "start": 121.64,
      "end": 125.80000000000001,
      "text": " I think a certification is definitely gonna give you all that good"
    },
    {
      "speakerLabel": "spk_1",
      "start": 125.8,
      "end": 128.64,
      "text": " base to keep growing from there"
    },
    {
      "speakerLabel": "spk_1",
      "start": 129.72,
      "end": 133.8,
      "text": " Do you agree with this perspective or is there anything else you might want to add?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 139.6,
      "end": 141.92,
      "text": " Yeah, I do agree And my own experience of it as well"
    },
    {
      "speakerLabel": "spk_0",
      "start": 141.92,
      "end": 148.01999999999998,
      "text": " I probably previously had that common perception that as long as you had the experience you don't really need the certification"
    },
    {
      "speakerLabel": "spk_0",
      "start": 148.01999999999998,
      "end": 150.84,
      "text": " But I've been through the journey with the AWS certification"
    },
    {
      "speakerLabel": "spk_0",
      "start": 151.4,
      "end": 153.4,
      "text": " and I've also realized that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 153.4,
      "end": 157.4,
      "text": " That kind of perception kind of comes from a position of privilege as well"
    },
    {
      "speakerLabel": "spk_0",
      "start": 157.4,
      "end": 161.08,
      "text": " And it's less true for underrepresented groups in tech"
    },
    {
      "speakerLabel": "spk_0",
      "start": 161.32,
      "end": 166.78,
      "text": " So in the end I've heard many cases where people have said that where you're fighting that bias all the time"
    },
    {
      "speakerLabel": "spk_0",
      "start": 166.96,
      "end": 170.22,
      "text": " Having a certification can really help to overcome that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 171.4,
      "end": 177.36,
      "text": " So I think that's that's really worthwhile to mention because everybody's context is very different"
    },
    {
      "speakerLabel": "spk_0",
      "start": 177.36,
      "end": 183.84,
      "text": " But in general, I think there is a lot of value to certification for a lot of people and it does help for hiring, right?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 183.84,
      "end": 191.16000000000003,
      "text": " So it can kind of give you access to better roles and salaries. Like you said it can help you get jobs and"
    },
    {
      "speakerLabel": "spk_0",
      "start": 193.16000000000003,
      "end": 198.88000000000002,
      "text": " Change your role in your existing company and it really helps for companies that are early on in the cloud journey"
    },
    {
      "speakerLabel": "spk_0",
      "start": 199.88000000000002,
      "end": 203.56,
      "text": " If you've got a lot of people already with a lot of experience in-house, it may matter less"
    },
    {
      "speakerLabel": "spk_0",
      "start": 203.56,
      "end": 209.4,
      "text": " But if you're trying to build a lot of expertise, it's something that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 210.4,
      "end": 212.72,
      "text": " boosts credibility, but also helps to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 214.16,
      "end": 220.6,
      "text": " Focus people on AWS and all of the different options available there and also build a culture probably of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 222.68,
      "end": 227.36,
      "text": " Professional development in that area within the company and you'll have people encouraging each other and"
    },
    {
      "speakerLabel": "spk_0",
      "start": 227.36,
      "end": 233.96,
      "text": " Exchanging tips on how to achieve the certifications and when they see other people doing it, they might want to be more encouraged to do it themselves"
    },
    {
      "speakerLabel": "spk_0",
      "start": 235.32000000000002,
      "end": 238.4,
      "text": " What do you think are there other areas that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 238.96,
      "end": 242,
      "text": " AWS certification is useful for that we didn't mention yet?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 248.24,
      "end": 257.2,
      "text": " Yeah, I think another interesting one could be if you are a freelancer or like a consultant as an individual Then having a certification is definitely something it's like a badge that is worth having because it boosts immediately your credibility in the market"
    },
    {
      "speakerLabel": "spk_1",
      "start": 258.04,
      "end": 261.32,
      "text": " But at the same time it's other than the budget itself"
    },
    {
      "speakerLabel": "spk_1",
      "start": 261.40000000000003,
      "end": 264.52,
      "text": " There is for instance the AWS IQ platform"
    },
    {
      "speakerLabel": "spk_1",
      "start": 264.84000000000003,
      "end": 270.84000000000003,
      "text": " Which I think is available in the States and UK maybe some other countries in Europe, I think France"
    },
    {
      "speakerLabel": "spk_1",
      "start": 271.76,
      "end": 277,
      "text": " And of course that it's very likely they will open it up to more and more countries in the next few years"
    },
    {
      "speakerLabel": "spk_1",
      "start": 277,
      "end": 279.32,
      "text": " But the point is that if you are in that platform"
    },
    {
      "speakerLabel": "spk_1",
      "start": 279.32,
      "end": 286.88,
      "text": " It's a platform managed by AWS where you can find customers as a freelancer and having certification is definitely gonna give you more"
    },
    {
      "speakerLabel": "spk_1",
      "start": 287.08,
      "end": 294.6,
      "text": " Visibility so you'll be able to access more opportunities to get hired for four projects and there is a very good blog post"
    },
    {
      "speakerLabel": "spk_1",
      "start": 294.6,
      "end": 299.12,
      "text": " I think it's a blog post by Adam Elmore where he discussed his own experience"
    },
    {
      "speakerLabel": "spk_1",
      "start": 299.88,
      "end": 304.04,
      "text": " He has achieved all the available certifications and he discussed"
    },
    {
      "speakerLabel": "spk_1",
      "start": 304.04,
      "end": 311.56,
      "text": " How doing that and being in that platform has massively increased his chances to get interesting jobs"
    },
    {
      "speakerLabel": "spk_1",
      "start": 311.56,
      "end": 316.48,
      "text": " And grow his freelancing career. So that's an interesting case study"
    },
    {
      "speakerLabel": "spk_1",
      "start": 316.48,
      "end": 321.52000000000004,
      "text": " It's probably like the very extreme but it's good to see that that perspective in my opinion"
    },
    {
      "speakerLabel": "spk_1",
      "start": 322.68,
      "end": 328.12,
      "text": " Yeah, it was an interesting one."
    },
    {
      "speakerLabel": "spk_0",
      "start": 328.12,
      "end": 334.08,
      "text": " He did 12 in six weeks, I think which is a pretty commendable achievement Do you think it's useful for employers? Like if you're an employer you're hiring a lot of people and you're doing a lot on AWS"
    },
    {
      "speakerLabel": "spk_0",
      "start": 334.08,
      "end": 339.28000000000003,
      "text": " How do you perceive people who do and don't have AWS certification badges?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 345.28000000000003,
      "end": 352.6,
      "text": " Yeah, I think from the perspective of an employer there are definitely two possible positions One is that you are trying to hire somebody and then seeing that certification might be more or less important to you"
    },
    {
      "speakerLabel": "spk_1",
      "start": 352.6,
      "end": 359.6,
      "text": " It's definitely as we said like an additional signal of credibility, but I would say trust but verify"
    },
    {
      "speakerLabel": "spk_1",
      "start": 359.6,
      "end": 367.6,
      "text": " Of course as in anything we know you there is still a factor that you can game a little bit the exam and get certified"
    },
    {
      "speakerLabel": "spk_1",
      "start": 367.6,
      "end": 375.6,
      "text": " So the certification is definitely not a replacement for experience. Make sure you validate that certification"
    },
    {
      "speakerLabel": "spk_1",
      "start": 375.6,
      "end": 382.6,
      "text": " That certification may be asking the candidate for specific examples of projects they've been working on"
    },
    {
      "speakerLabel": "spk_1",
      "start": 382.6,
      "end": 389.6,
      "text": " And what they think is more important. What did they learn? So definitely don't just rely on the certification to hire somebody"
    },
    {
      "speakerLabel": "spk_1",
      "start": 389.6,
      "end": 397.6,
      "text": " On the other hand, if you are an employer you probably want to care about certifications even for the people you already hired"
    },
    {
      "speakerLabel": "spk_1",
      "start": 397.6,
      "end": 406.6,
      "text": " They might be interested in getting a certification and I think if that happens in your company I think you should support that"
    },
    {
      "speakerLabel": "spk_1",
      "start": 406.6,
      "end": 413.6,
      "text": " Especially if AWS is something you basically work on it every day you need that experience"
    },
    {
      "speakerLabel": "spk_1",
      "start": 413.6,
      "end": 421.6,
      "text": " Allowing your team to get a certification can definitely increase their productivity, can increase their skill"
    },
    {
      "speakerLabel": "spk_1",
      "start": 421.6,
      "end": 431.6,
      "text": " But not just that you are also supporting every team member to grow on their career so I think that's definitely something good to do in the company anyway"
    },
    {
      "speakerLabel": "spk_1",
      "start": 431.6,
      "end": 439.6,
      "text": " And my immediate recommendation would be don't just say yes do it but actually support them for real"
    },
    {
      "speakerLabel": "spk_1",
      "start": 439.6,
      "end": 445.6,
      "text": " And that could mean a number of different actions for instance help them to create a study plan"
    },
    {
      "speakerLabel": "spk_1",
      "start": 445.6,
      "end": 453.6,
      "text": " Find a portion of their work time that they can spend studying, maybe give them access to paid material"
    },
    {
      "speakerLabel": "spk_1",
      "start": 453.6,
      "end": 464.6,
      "text": " And also it could be interesting to pay for the actual exam as a company I think it's more convenient to do that rather than letting them spend their own money on the certification"
    },
    {
      "speakerLabel": "spk_1",
      "start": 464.6,
      "end": 468.6,
      "text": " So I would definitely recommend that for employers"
    },
    {
      "speakerLabel": "spk_0",
      "start": 475.6,
      "end": 483.6,
      "text": " Yeah absolutely, so we should probably give then an overview quickly of the different certifications available And we've got various tiers right so the first one you would probably start with is the foundational training"
    },
    {
      "speakerLabel": "spk_0",
      "start": 483.6,
      "end": 491.6,
      "text": " You know if you're a developer and or on that track the developer the foundational one is your cloud practitioner certification"
    },
    {
      "speakerLabel": "spk_0",
      "start": 491.6,
      "end": 498.6,
      "text": " And that's going to give you an overview of basic understandings of cloud concepts and the various AWS services"
    },
    {
      "speakerLabel": "spk_0",
      "start": 498.6,
      "end": 506.6,
      "text": " And it is what it says, it's a good foundation and I think that's something that you could do without having significant experience"
    },
    {
      "speakerLabel": "spk_0",
      "start": 506.6,
      "end": 512.6,
      "text": " I think they give a guideline of six months of experience with AWS but six months of experience could mean a lot of different things"
    },
    {
      "speakerLabel": "spk_0",
      "start": 512.6,
      "end": 516.6,
      "text": " And it's something you could probably do without having much hands on keyboard experience with AWS"
    },
    {
      "speakerLabel": "spk_0",
      "start": 516.6,
      "end": 522.6,
      "text": " And it'll help you to navigate AWS a little bit better so I'd definitely recommend that for anyone getting started"
    },
    {
      "speakerLabel": "spk_0",
      "start": 522.6,
      "end": 532.6,
      "text": " And the next up is associate so then within the higher tiers you've got a division between architect and developer and operations"
    },
    {
      "speakerLabel": "spk_0",
      "start": 532.6,
      "end": 539.6,
      "text": " So I think we've both followed the architect track and you've written a particular blog post around solutions architect"
    },
    {
      "speakerLabel": "spk_0",
      "start": 539.6,
      "end": 546.6,
      "text": " So maybe do you want to talk about that one and how the associate solutions architect works and what it gives you"
    },
    {
      "speakerLabel": "spk_1",
      "start": 553.6,
      "end": 559.6,
      "text": " Yeah I wrote a blog post I think it was almost three years ago at this point so I hope it's not too outdated But I try to give like generic tips from what I've seen so maybe most of them are still relevant"
    },
    {
      "speakerLabel": "spk_1",
      "start": 559.6,
      "end": 569.6,
      "text": " But my experience with that particular certification is that it is really good because it really lets you focus on the pillar type of knowledge"
    },
    {
      "speakerLabel": "spk_1",
      "start": 569.6,
      "end": 577.6,
      "text": " Like principles of cloud design but also the most interesting services like S3, DynamoDB, EC2"
    },
    {
      "speakerLabel": "spk_1",
      "start": 577.6,
      "end": 585.6,
      "text": " And you really get to learn what are the characteristics of those services and how you should rely on some particular characteristics"
    },
    {
      "speakerLabel": "spk_1",
      "start": 585.6,
      "end": 589.6,
      "text": " Not just the strengths but also the weaknesses of every different service"
    },
    {
      "speakerLabel": "spk_1",
      "start": 589.6,
      "end": 597.6,
      "text": " One thing that it might be a little bit annoying or at least it was for me is that there are a lot of questions that are like very specific"
    },
    {
      "speakerLabel": "spk_1",
      "start": 597.6,
      "end": 604.6,
      "text": " So you end up needing to memorize a lot of concepts like I don't know how to do capacity planning with DynamoDB"
    },
    {
      "speakerLabel": "spk_1",
      "start": 604.6,
      "end": 610.6,
      "text": " There are questions where you really need to do the calculations so you really need to know by heart the different values there"
    },
    {
      "speakerLabel": "spk_1",
      "start": 610.6,
      "end": 617.6,
      "text": " Similarly there are questions around the different number of nines that you have for all the different characteristics of S3"
    },
    {
      "speakerLabel": "spk_1",
      "start": 617.6,
      "end": 621.6,
      "text": " Depending on which kind of storage do you end up using"
    },
    {
      "speakerLabel": "spk_1",
      "start": 621.6,
      "end": 629.6,
      "text": " So it takes a little bit of effort in memorizing certain concepts so that might be a little bit annoying for some people"
    },
    {
      "speakerLabel": "spk_1",
      "start": 629.6,
      "end": 634.6,
      "text": " But then those things are really useful like you really need to understand why those things are important"
    },
    {
      "speakerLabel": "spk_1",
      "start": 634.6,
      "end": 637.6,
      "text": " So it pushes you in the right direction in my opinion"
    },
    {
      "speakerLabel": "spk_1",
      "start": 637.6,
      "end": 644.6,
      "text": " And I'll just leave a link to the article there are a lot more tips in terms of how to manage time, how to do the exam"
    },
    {
      "speakerLabel": "spk_1",
      "start": 644.6,
      "end": 648.6,
      "text": " And also some links to resources that I use to study"
    },
    {
      "speakerLabel": "spk_0",
      "start": 655.6,
      "end": 659.6,
      "text": " But yeah that might take another episode if we want to go too much into detail in that Absolutely, yeah and once you've got your associate then you probably look at professional"
    },
    {
      "speakerLabel": "spk_0",
      "start": 659.6,
      "end": 665.6,
      "text": " I think it's interesting that they say if you're looking at associate you want to have one year experience"
    },
    {
      "speakerLabel": "spk_0",
      "start": 665.6,
      "end": 668.6,
      "text": " And then you want to have professional two years"
    },
    {
      "speakerLabel": "spk_0",
      "start": 668.6,
      "end": 674.6,
      "text": " I think I was, I'd been working with AWS for about five or six years before I did any certifications"
    },
    {
      "speakerLabel": "spk_0",
      "start": 674.6,
      "end": 677.6,
      "text": " So it's, your mileage is going to vary here"
    },
    {
      "speakerLabel": "spk_0",
      "start": 677.6,
      "end": 682.6,
      "text": " I would suggest that if you're going to do the professional two years of experience is actually not a lot"
    },
    {
      "speakerLabel": "spk_0",
      "start": 682.6,
      "end": 687.6,
      "text": " I mean it would certainly mean that you probably have to study a lot more and put a lot more effort into it"
    },
    {
      "speakerLabel": "spk_0",
      "start": 687.6,
      "end": 692.6,
      "text": " And rely less on your experience and kind of inherent knowledge that you've built up"
    },
    {
      "speakerLabel": "spk_0",
      "start": 692.6,
      "end": 696.6,
      "text": " Professional exam is a good jump in challenge"
    },
    {
      "speakerLabel": "spk_0",
      "start": 696.6,
      "end": 701.6,
      "text": " And it's, I would suggest it's probably harder to bluff"
    },
    {
      "speakerLabel": "spk_0",
      "start": 701.6,
      "end": 704.6,
      "text": " I mean you can always cram and study and just try and memorize everything"
    },
    {
      "speakerLabel": "spk_0",
      "start": 704.6,
      "end": 708.6,
      "text": " But professional is definitely a significant challenge"
    },
    {
      "speakerLabel": "spk_0",
      "start": 708.6,
      "end": 711.6,
      "text": " I've heard some people describe it as the hardest certification in tech"
    },
    {
      "speakerLabel": "spk_0",
      "start": 711.6,
      "end": 714.6,
      "text": " I don't know if that's true or not or that's just hyperbole"
    },
    {
      "speakerLabel": "spk_0",
      "start": 714.6,
      "end": 718.6,
      "text": " But yeah with a lot of experience it'll help"
    },
    {
      "speakerLabel": "spk_0",
      "start": 718.6,
      "end": 721.6,
      "text": " I'm not somebody who particularly enjoys the exam experience"
    },
    {
      "speakerLabel": "spk_0",
      "start": 721.6,
      "end": 725.6,
      "text": " I know that Adam Elmore in his blog says he loves doing exams"
    },
    {
      "speakerLabel": "spk_0",
      "start": 725.6,
      "end": 729.6,
      "text": " So doing 12 exams in six weeks was enjoyable experience for him"
    },
    {
      "speakerLabel": "spk_0",
      "start": 729.6,
      "end": 733.6,
      "text": " For me it's like pulling teeth so I'm at the other end of the scale"
    },
    {
      "speakerLabel": "spk_0",
      "start": 733.6,
      "end": 737.6,
      "text": " I'm glad to have it over with"
    },
    {
      "speakerLabel": "spk_0",
      "start": 737.6,
      "end": 741.6,
      "text": " But yeah I think if you're doing professional I think there is a lot of credibility associated with that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 741.6,
      "end": 745.6,
      "text": " And it's certainly a good validation of your experience like we said"
    },
    {
      "speakerLabel": "spk_1",
      "start": 751.6,
      "end": 754.6,
      "text": " Yeah I think in the professional one the main difference I'm seeing, I'm preparing for that one right now So take this with a grain of salt"
    },
    {
      "speakerLabel": "spk_1",
      "start": 754.6,
      "end": 760.6,
      "text": " But what I'm seeing by doing the mock exams is that there is a lot more of practical knowledge"
    },
    {
      "speakerLabel": "spk_1",
      "start": 760.6,
      "end": 767.6,
      "text": " Most of the questions are you need to build this, what's the best solution for this particular use case"
    },
    {
      "speakerLabel": "spk_1",
      "start": 767.6,
      "end": 771.6,
      "text": " Or there is a particular problem in an existing architecture"
    },
    {
      "speakerLabel": "spk_1",
      "start": 771.6,
      "end": 775.6,
      "text": " What can be the most likely cause for that problem"
    },
    {
      "speakerLabel": "spk_1",
      "start": 775.6,
      "end": 781.6,
      "text": " So you really need to know a bunch of different architecture which is not something you can improvise by just reading around"
    },
    {
      "speakerLabel": "spk_1",
      "start": 781.6,
      "end": 787.6,
      "text": " So I think having that experience makes a lot of difference in being able to pass the exam"
    },
    {
      "speakerLabel": "spk_0",
      "start": 793.6,
      "end": 798.6,
      "text": " One of the things I haven't done is the specialty exam Or the specialty certification track and there are various different ones like advanced networking"
    },
    {
      "speakerLabel": "spk_0",
      "start": 798.6,
      "end": 802.6,
      "text": " Database, machine learning, security"
    },
    {
      "speakerLabel": "spk_0",
      "start": 802.6,
      "end": 806.6,
      "text": " Where do you think those would fit or do you think it's"
    },
    {
      "speakerLabel": "spk_0",
      "start": 806.6,
      "end": 811.6,
      "text": " Is it for people who are really specialists or do you think it's also something that if you're like an AWS generalist"
    },
    {
      "speakerLabel": "spk_0",
      "start": 811.6,
      "end": 816.6,
      "text": " It would also be worthwhile pursuing one of those"
    },
    {
      "speakerLabel": "spk_1",
      "start": 821.6,
      "end": 823.6,
      "text": " Yeah I haven't done them so again I have a very kind of distant opinion So take it again with a grain of salt"
    },
    {
      "speakerLabel": "spk_1",
      "start": 823.6,
      "end": 832.6,
      "text": " But my guess would be that you can either be somebody that is building up interest in a particular area that you haven't been exposed to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 832.6,
      "end": 839.6,
      "text": " So you might take that certification as almost like a challenge to see what that area of AWS looks like"
    },
    {
      "speakerLabel": "spk_1",
      "start": 839.6,
      "end": 841.6,
      "text": " What kind of knowledge do you need to build"
    },
    {
      "speakerLabel": "spk_1",
      "start": 841.6,
      "end": 847.6,
      "text": " And maybe you will end up learning a bunch of new things and why not decide maybe to do a little bit of a career switch"
    },
    {
      "speakerLabel": "spk_1",
      "start": 847.6,
      "end": 850.6,
      "text": " To specialize even more in those areas"
    },
    {
      "speakerLabel": "spk_1",
      "start": 850.6,
      "end": 856.6,
      "text": " So that's definitely an extreme. The other case could be that you already have a lot of knowledge in that area"
    },
    {
      "speakerLabel": "spk_1",
      "start": 856.6,
      "end": 865.6,
      "text": " So you want to get certified that you know your stuff and maybe that can give you access to more specialized roles in your existing company"
    },
    {
      "speakerLabel": "spk_1",
      "start": 865.6,
      "end": 871.6,
      "text": " Or maybe do interviews for very specialized roles that you are seeing in companies that you really like"
    },
    {
      "speakerLabel": "spk_1",
      "start": 871.6,
      "end": 877.6,
      "text": " So maybe that's another option why you should consider one of those kind of certifications"
    },
    {
      "speakerLabel": "spk_0",
      "start": 880.6,
      "end": 886.6,
      "text": " Yeah this is a good one For people actually thinking about the exam or about to embark on it or in the middle of study"
    },
    {
      "speakerLabel": "spk_0",
      "start": 886.6,
      "end": 889.6,
      "text": " How do you suggest preparing for the exams"
    },
    {
      "speakerLabel": "spk_0",
      "start": 889.6,
      "end": 893.6,
      "text": " You mentioned your blog post which will definitely link in the show notes"
    },
    {
      "speakerLabel": "spk_0",
      "start": 893.6,
      "end": 900.6,
      "text": " And I suppose I've got mixed experience you know experience is obviously good preparation"
    },
    {
      "speakerLabel": "spk_0",
      "start": 900.6,
      "end": 905.6,
      "text": " You need to look at the certification guide and see what the topics and syllabus is"
    },
    {
      "speakerLabel": "spk_0",
      "start": 905.6,
      "end": 911.6,
      "text": " But there's plenty of resources out there sometimes it's a mind boggling array of content"
    },
    {
      "speakerLabel": "spk_0",
      "start": 911.6,
      "end": 919.6,
      "text": " So I know that when I was looking at the professional exam I was using a cloud guru which is incredibly popular"
    },
    {
      "speakerLabel": "spk_0",
      "start": 919.6,
      "end": 923.6,
      "text": " And a lot of companies use it and a lot of individuals use it"
    },
    {
      "speakerLabel": "spk_0",
      "start": 923.6,
      "end": 929.6,
      "text": " I found it to have slightly mixed advantages and disadvantages"
    },
    {
      "speakerLabel": "spk_0",
      "start": 929.6,
      "end": 938.6,
      "text": " In that it was very good content a really good platform and the sandbox environments they give you to experiment with stuff is very useful"
    },
    {
      "speakerLabel": "spk_0",
      "start": 938.6,
      "end": 942.6,
      "text": " One of the things I found is that it seemed to lack a little bit of depth"
    },
    {
      "speakerLabel": "spk_0",
      "start": 942.6,
      "end": 948.6,
      "text": " And that a lot of the detailed topics which are required for professional level weren't explored in a lot of great detail"
    },
    {
      "speakerLabel": "spk_0",
      "start": 948.6,
      "end": 952.6,
      "text": " But instead they just told you to go and read the white papers"
    },
    {
      "speakerLabel": "spk_0",
      "start": 952.6,
      "end": 958.6,
      "text": " So I think it's worth stating that I found you know it's definitely worth looking at"
    },
    {
      "speakerLabel": "spk_0",
      "start": 958.6,
      "end": 962.6,
      "text": " It's just at that professional level I thought it could do with some more detail"
    },
    {
      "speakerLabel": "spk_0",
      "start": 962.6,
      "end": 969.6,
      "text": " And one of the other platforms I found other people recommend quite a lot for that is Adrian Cantrell's platform"
    },
    {
      "speakerLabel": "spk_0",
      "start": 969.6,
      "end": 976.6,
      "text": " Which is you know his own platform but he's got a lot of detailed tutorials there so we'll link that through as well"
    },
    {
      "speakerLabel": "spk_0",
      "start": 976.6,
      "end": 982.6,
      "text": " You mentioned the practice exam so where do people go to get practice and to see what they're like"
    },
    {
      "speakerLabel": "spk_0",
      "start": 982.6,
      "end": 987.6,
      "text": " Because that's something you could do even before you apply for the exam just to get a sense of readiness"
    },
    {
      "speakerLabel": "spk_1",
      "start": 994.6,
      "end": 1001.6,
      "text": " Yeah as far as I know I have been doing the mock exams in three different platforms One is a Cloud Guru itself they do have that feature as well and I think that one is actually quite well done"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1001.6,
      "end": 1007.6,
      "text": " Because it doesn't just give you like okay correct answers you did pass or you did not pass"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1007.6,
      "end": 1015.6,
      "text": " But for every single question after you do the exam you have an entire like in-depth section that tells you how to approach that question"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1015.6,
      "end": 1022.6,
      "text": " In the case you failed why maybe you failed it like maybe some tips on okay look for this keyword next time"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1022.6,
      "end": 1029.6,
      "text": " Because that really has a lot of value so it can give you I think it can give you like a good way of approaching the exam"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1029.6,
      "end": 1036.6,
      "text": " Even if you just fail it I think you will just learn a lot on how to approach the next time you try to do the exam"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1036.6,
      "end": 1046.6,
      "text": " Similarly there is one on Udemy that I'm currently using for studying for the professional certification which is built pretty much in the same way"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1046.6,
      "end": 1055.6,
      "text": " It's a mock exam you get the time that you really get during the exam you try to answer the questions and at the end you get your own score"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1055.6,
      "end": 1059.6,
      "text": " But also for every single question you get a lot of context and suggestions"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1059.6,
      "end": 1067.6,
      "text": " And then there is the AWS itself allows you to do practice exam I think you need to pay some small fee to do that"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1067.6,
      "end": 1076.6,
      "text": " But I would recommend doing that before any exam because chances are that the AWS one is much closer to the one we will actually have to face during the exam"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1076.6,
      "end": 1086.6,
      "text": " In terms of actual content and type of questions so these are the three I know and I used in the past I don't know if you have anything else there"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1092.6,
      "end": 1102.6,
      "text": " I've also used the Udemy ones which I think are essentially resold from the tutorials point Tutorials is the same content and you know they're relatively inexpensive and they're often discounted to like 20 euros that level"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1102.6,
      "end": 1108.6,
      "text": " The one thing I found about them is that I thought they were more challenging than the real exam"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1108.6,
      "end": 1116.6,
      "text": " So from that point of view it's quite good because it sets a higher bar than the actual exam and I found that the questions were often longer, took longer to read"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1116.6,
      "end": 1127.6,
      "text": " A lot more subtle detail in them. In fact the first time I did a cloud partitioner mock exam with Udemy it really frightened me into getting my act together"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1127.6,
      "end": 1133.6,
      "text": " Because it was so challenging and I flunked it so badly the first time"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1133.6,
      "end": 1143.6,
      "text": " I think that's good right because it really helps you to prepare by really setting a high bar and then you actually find that the exam itself isn't so bad"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1143.6,
      "end": 1146.6,
      "text": " So I really recommend those"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1146.6,
      "end": 1153.6,
      "text": " What about during the exam itself? So you've got two options for the exam now"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1153.6,
      "end": 1161.6,
      "text": " Previously I think you could only do the foundational level ones online and everything else you had to go to a test centre"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1161.6,
      "end": 1168.6,
      "text": " But with Covid everything is now available through what they call online proctoring"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1168.6,
      "end": 1172.6,
      "text": " There are two platforms for that one is Pearson View and the other is PSI"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1172.6,
      "end": 1178.6,
      "text": " And I've had experience with Pearson View and I know other people who have had experience with both"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1178.6,
      "end": 1187.6,
      "text": " And I just wanted to relay some of my experience with those because there's good and bad"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1187.6,
      "end": 1195.6,
      "text": " If you can get to a local test centre safely and do your exam I would probably recommend that because you don't have to worry about the environment"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1195.6,
      "end": 1200.6,
      "text": " You just turn up, sit at a desk, do the exam and leave with your result"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1200.6,
      "end": 1205.6,
      "text": " When you do the online proctoring it's an advantage that you can do it from your office or from your home"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1205.6,
      "end": 1212.6,
      "text": " But you really have to make sure that the environment is correct so in advance you have to make sure that the room is clear, your desk is clear"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1212.6,
      "end": 1217.6,
      "text": " There's no devices or books or paper within reach"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1217.6,
      "end": 1224.6,
      "text": " You will have to use your phone to take a picture of your environment from all angles and somebody's watching you for the duration of the exam"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1224.6,
      "end": 1232.6,
      "text": " And it's quite amusing sometimes because if you're thinking about a question and you're focusing and you might put your hand over your mouth"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1232.6,
      "end": 1240.6,
      "text": " Or you might mumble to yourself they'll tell you to stop because they don't know that you're trying to communicate with somebody outside the room"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1240.6,
      "end": 1246.6,
      "text": " Or you're trying to work around the system in some way or cheat"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1246.6,
      "end": 1252.6,
      "text": " So it's a little bit amusing and kind of restrictive in that sense, you have to put time into preparing for it"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1252.6,
      "end": 1254.6,
      "text": " And the platform doesn't always work unfortunately"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1254.6,
      "end": 1262.6,
      "text": " The first one I ever did with online proctoring didn't work at all, I had to cancel it and it took weeks before I was able to reschedule it"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1262.6,
      "end": 1264.6,
      "text": " Which is really inconvenient"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1264.6,
      "end": 1270.6,
      "text": " I know a colleague of ours at Fortheram had that same experience recently, it's no fun when that happens"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1270.6,
      "end": 1275.6,
      "text": " And I've heard about problems with the actual platform on both options there"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1275.6,
      "end": 1280.6,
      "text": " So there are pros and cons to it, it is nice that you have that option to do it online"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1280.6,
      "end": 1286.6,
      "text": " But you really have to prepare, make sure the environment's working and then hope that it just works on the day"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1286.6,
      "end": 1293.6,
      "text": " And I'm sure it usually does but you know things happen, it's technology"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1293.6,
      "end": 1301.6,
      "text": " What about other preparation? During the exam itself Luciano, I think you had a lot of good recommendations on how to approach the exam in your blog post"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1301.6,
      "end": 1303.6,
      "text": " Do you want to talk about some of those?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1309.6,
      "end": 1314.6,
      "text": " Yeah, I think at least what was my approach after failing a few mock exams I started to develop a little bit of a system for how can I be more effective"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1314.6,
      "end": 1322.6,
      "text": " Because I think the main concern is that it's not just challenging because of course it's an exam, you need to have the knowledge, there is a stress factor"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1322.6,
      "end": 1332.6,
      "text": " But also from what I've seen it's very tight, you have a certain amount of time and a lot of questions and you need to really manage your time well"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1332.6,
      "end": 1342.6,
      "text": " So what I would recommend is be aware of the time but also don't let that stress you out, don't freak out just because you see the counter going down"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1342.6,
      "end": 1352.6,
      "text": " Try to focus on the questions, try to allocate enough time for you to understand the question well enough"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1352.6,
      "end": 1358.6,
      "text": " And I think when you start to do a few mock exams you'll start to realize that there are some patterns"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1358.6,
      "end": 1363.6,
      "text": " For instance some keywords will have a certain weight in a question or even in an answer"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1363.6,
      "end": 1371.6,
      "text": " Another thing that happens often is that you have to pick between possible answers and some of the answers are almost identical"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1371.6,
      "end": 1375.6,
      "text": " So basically there is one or a few keywords of difference between each other"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1375.6,
      "end": 1382.6,
      "text": " So most of the time that means that the choice is either one or another question so you can probably ignore the other two"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1382.6,
      "end": 1388.6,
      "text": " But that means that it's really important that you understand the difference between those few keywords"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1388.6,
      "end": 1398.6,
      "text": " So really try to do the exercise of seeing, okay, this is just not the most likely answer because there is another one that is almost identical"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1398.6,
      "end": 1403.6,
      "text": " So try to focus on finding out what's the difference, why the difference might be important"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1403.6,
      "end": 1412.6,
      "text": " And other than that if you see that you are spending too much time on one question there is an option to flag the question you don't have to answer straight away"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1412.6,
      "end": 1422.6,
      "text": " So you can leave it for the end and do all the other questions and then before submitting your results, your answers, you can go back to the flagged ones"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1422.6,
      "end": 1429.6,
      "text": " And try to figure it out with a fresher mind if you can understand what the question means and if you can find a good answer for it"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1429.6,
      "end": 1434.6,
      "text": " Those are I think my basic suggestions, I don't know if you have anything else"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1445.6,
      "end": 1458.6,
      "text": " No, I'd agree with that, yeah, if you've got time left over at the end rather than walking out early take the time to review the answers and flagging the ones where you had some doubt is a good idea I'm really interested to hear what other people's experiences are with certification and if people have any questions about approaching certification we'd love to help and we'd love to learn more about what other people's experiences are"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1458.6,
      "end": 1468.6,
      "text": " So let us know in the comments or ask on Twitter, LinkedIn, wherever you find us and wherever you hang out in YouTube comments"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1468.6,
      "end": 1477.6,
      "text": " If you enjoyed the episode give us a thumbs up, make sure that you subscribe on YouTube or follow the podcast and share it with your friends and colleagues and we'll see you in the next episode"
    }
  ]
}