{
  "speakers": {
    "spk_0": "Luciano",
    "spk_1": "Eoin"
  },
  "segments": [
    {
      "speakerLabel": "spk_0",
      "start": 0,
      "end": 5.2,
      "text": " Hello, today we're going to answer the question, what accounts do you need for your team?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 6,
      "end": 11.200000000000001,
      "text": " And we will try to explore some of the common ways to organize AWS accounts and environments,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 11.200000000000001,
      "end": 16.8,
      "text": " of course with the idea of a company running production workloads, so how many accounts"
    },
    {
      "speakerLabel": "spk_0",
      "start": 16.8,
      "end": 22.16,
      "text": " do they need and how many environments. We will discuss how to become more productive with AWS"
    },
    {
      "speakerLabel": "spk_0",
      "start": 22.16,
      "end": 27.12,
      "text": " accounts and finally we'll discuss some of the common security and cost-related trade-offs."
    },
    {
      "speakerLabel": "spk_0",
      "start": 27.12,
      "end": 32.08,
      "text": " My name is Luciano and today I'm joined by Eoin and this is AWS Bites podcast."
    },
    {
      "speakerLabel": "spk_0",
      "start": 40.08,
      "end": 45.760000000000005,
      "text": " So first of all I'd like to start by saying a big thank you to David Lynam because he"
    },
    {
      "speakerLabel": "spk_0",
      "start": 45.760000000000005,
      "end": 51.120000000000005,
      "text": " suggested this awesome topic on Twitter, so please keep sending us your suggestion,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 51.120000000000005,
      "end": 55.040000000000006,
      "text": " we are more than happy to try to address common questions that you might have."
    },
    {
      "speakerLabel": "spk_0",
      "start": 55.04,
      "end": 61.76,
      "text": " I would suggest we maybe start with a quick definition of what do we mean by an AWS account,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 61.76,
      "end": 66.64,
      "text": " what do we mean by an environment, just to make sure we are all in the same line."
    },
    {
      "speakerLabel": "spk_1",
      "start": 73.75999999999999,
      "end": 80.16,
      "text": " Okay, so an account, let's try to define that as the fundamental unit that you get started with on AWS. Most people will start off with one account, put in a credit card and grow from there, but you"
    },
    {
      "speakerLabel": "spk_1",
      "start": 80.16,
      "end": 85.11999999999999,
      "text": " can add as many accounts as you need across your organization and some companies have hundreds of"
    },
    {
      "speakerLabel": "spk_1",
      "start": 85.11999999999999,
      "end": 91.28,
      "text": " accounts. But an account is really a logical concept but it's a very strict security boundary"
    },
    {
      "speakerLabel": "spk_1",
      "start": 91.28,
      "end": 98.08,
      "text": " as well because once you try to access resources in another account that's a cross-account access"
    },
    {
      "speakerLabel": "spk_1",
      "start": 99.19999999999999,
      "end": 107.19999999999999,
      "text": " concern. So it's very much a walled garden for everything you're doing in AWS and it's very"
    },
    {
      "speakerLabel": "spk_1",
      "start": 107.2,
      "end": 114.32000000000001,
      "text": " useful for isolating workloads. So I think one of the things that you need to think about"
    },
    {
      "speakerLabel": "spk_1",
      "start": 114.32000000000001,
      "end": 122.4,
      "text": " when you're thinking about an account is what do you want to share with other people"
    },
    {
      "speakerLabel": "spk_1",
      "start": 122.4,
      "end": 126.96000000000001,
      "text": " and what do you want to isolate, right? So that's a concern. Is there anything else we need to say"
    },
    {
      "speakerLabel": "spk_1",
      "start": 126.96000000000001,
      "end": 133.04,
      "text": " about what an account is?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 133.04,
      "end": 138.56,
      "text": " Maybe I will only add that you can have this kind of tree structure for accounts so you can group them logically in a way that you will have like a master account and"
    },
    {
      "speakerLabel": "spk_0",
      "start": 138.56,
      "end": 145.76,
      "text": " all the sub-accounts there, which is not always obvious. Organizational units as well are like"
    },
    {
      "speakerLabel": "spk_0",
      "start": 145.76,
      "end": 151.68,
      "text": " these folders really for accounts. So yeah, that's important to know. Yeah, that's true."
    },
    {
      "speakerLabel": "spk_1",
      "start": 151.68,
      "end": 155.92,
      "text": " So what's an environment then? Because we talk about accounts and environments. Are they the same thing?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 160.8,
      "end": 165.76000000000002,
      "text": " So I would consider an environment, this is more of a loose concept I suppose, so I would consider an environment, this is more of a loose concept I suppose from the perspective of AWS."
    },
    {
      "speakerLabel": "spk_0",
      "start": 165.76000000000002,
      "end": 174.32000000000002,
      "text": " So it's more for the way that you decide to build and ship applications throughout your pipeline."
    },
    {
      "speakerLabel": "spk_0",
      "start": 174.32000000000002,
      "end": 180.08,
      "text": " So probably you're going to have a development environment where you are going to use that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 180.08,
      "end": 185.52,
      "text": " only for building new features and as you build maybe you might want to test a few things manually."
    },
    {
      "speakerLabel": "spk_0",
      "start": 185.52,
      "end": 190.88000000000002,
      "text": " You might have other environments for instance for QA or for all sorts of automated testing."
    },
    {
      "speakerLabel": "spk_0",
      "start": 191.68,
      "end": 196,
      "text": " Then finally you will have your production environment which is literally where the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 196,
      "end": 201.20000000000002,
      "text": " software you are running is going to be accessed by your users and that's the main source of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 202,
      "end": 208.96,
      "text": " I suppose delivering the product to your customers. So yeah, it tends to be a little"
    },
    {
      "speakerLabel": "spk_0",
      "start": 208.96,
      "end": 215.20000000000002,
      "text": " bit more loose because you don't really have that concept as a structured way in AWS and"
    },
    {
      "speakerLabel": "spk_0",
      "start": 215.2,
      "end": 220.88,
      "text": " you'll need to decide how to apply that concept using accounts."
    },
    {
      "speakerLabel": "spk_1",
      "start": 220.88,
      "end": 225.35999999999999,
      "text": " So I guess the one environment that everybody would probably have is the production environment and after that it's going to vary?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 227.04,
      "end": 235.28,
      "text": " Exactly, yeah. So what do we think is like the most common way at least to try to structure"
    },
    {
      "speakerLabel": "spk_0",
      "start": 235.92,
      "end": 241.92,
      "text": " accounts and environments for? I suppose a big enough company doesn't have to be extremely big"
    },
    {
      "speakerLabel": "spk_0",
      "start": 241.92,
      "end": 247.11999999999998,
      "text": " but maybe not just like one person company. Maybe you start to have a few products and a few"
    },
    {
      "speakerLabel": "spk_0",
      "start": 247.11999999999998,
      "end": 252.79999999999998,
      "text": " employees in the team. So what can we recommend?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 252.79999999999998,
      "end": 260.15999999999997,
      "text": " It used to be a lot more common to mix lots of different environments in one account. These days, 2022, it's more common to have one account per"
    },
    {
      "speakerLabel": "spk_1",
      "start": 260.71999999999997,
      "end": 268.4,
      "text": " environment but also per application or domain or a team. It would vary from company to company"
    },
    {
      "speakerLabel": "spk_1",
      "start": 268.4,
      "end": 273.03999999999996,
      "text": " how you split that up based on what the relationship is between the number of products"
    },
    {
      "speakerLabel": "spk_1",
      "start": 273.03999999999996,
      "end": 278.08,
      "text": " you have and the number of teams. Really you want to think about what is the security boundary"
    },
    {
      "speakerLabel": "spk_1",
      "start": 278.08,
      "end": 282.64,
      "text": " you're trying to enforce? What are the resources you want to share and not share?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 283.2,
      "end": 288.32,
      "text": " And to avoid people getting on each other's toes, you know, stamping on each other's toes by sharing"
    },
    {
      "speakerLabel": "spk_1",
      "start": 288.32,
      "end": 294.15999999999997,
      "text": " an account. You might find that you have to put in place constraints so that people don't delete"
    },
    {
      "speakerLabel": "spk_1",
      "start": 294.15999999999997,
      "end": 298.08,
      "text": " other people's resources. If you're doing that, that's a sign that you need to split into"
    },
    {
      "speakerLabel": "spk_1",
      "start": 298.08,
      "end": 303.2,
      "text": " multiple accounts, I think. But I think the AWS best practice is more or less one account"
    },
    {
      "speakerLabel": "spk_1",
      "start": 304.08,
      "end": 307.91999999999996,
      "text": " per application per environment. Yeah."
    },
    {
      "speakerLabel": "spk_0",
      "start": 307.91999999999996,
      "end": 314,
      "text": " So if we want to do an example, that basically means, again, let's take our e-commerce example. If you have, I don't know,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 315.28,
      "end": 323.52,
      "text": " kind of product application and then you might have a fulfillment application, you might have"
    },
    {
      "speakerLabel": "spk_0",
      "start": 323.52,
      "end": 328.4,
      "text": " already a few different accounts because let's just say you have a dev and a production account,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 328.4,
      "end": 334.24,
      "text": " you will have two different accounts for the first application and two other different accounts for"
    },
    {
      "speakerLabel": "spk_0",
      "start": 334.24,
      "end": 342.47999999999996,
      "text": " the other application. So you can see how it's kind of a matrix of all the environments you have"
    },
    {
      "speakerLabel": "spk_0",
      "start": 342.47999999999996,
      "end": 348.47999999999996,
      "text": " and all the applications you have. If you want to do very granular kind of control in terms of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 348.47999999999996,
      "end": 353.28,
      "text": " boundaries."
    },
    {
      "speakerLabel": "spk_1",
      "start": 353.28,
      "end": 359.11999999999995,
      "text": " It's probably worth mentioning as well that if those are like microservices and if you've got a team of five people and they're producing the fulfillment application as well as the product"
    },
    {
      "speakerLabel": "spk_1",
      "start": 359.11999999999995,
      "end": 364.4,
      "text": " application and the billing application, if they're really just microservices and the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 364.4,
      "end": 370.47999999999996,
      "text": " deployment can all live quite easily together in one account, you don't need to have an account per"
    },
    {
      "speakerLabel": "spk_1",
      "start": 370.47999999999996,
      "end": 376.79999999999995,
      "text": " microservice per environment. Because in that case, there's also a bit of overhead in managing"
    },
    {
      "speakerLabel": "spk_1",
      "start": 376.79999999999995,
      "end": 382,
      "text": " multiple accounts because you need to, those are more things you have to monitor and take care of."
    },
    {
      "speakerLabel": "spk_1",
      "start": 382,
      "end": 388.16,
      "text": " So just because you have multiple separately deployable units in your application, it doesn't"
    },
    {
      "speakerLabel": "spk_1",
      "start": 388.16,
      "end": 393.68,
      "text": " mean they always need to have a separate account. It's perfectly okay to start with one account if"
    },
    {
      "speakerLabel": "spk_1",
      "start": 393.68,
      "end": 398.32,
      "text": " you've got just one team on that because with a small team especially, you're probably going to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 398.32,
      "end": 403.68,
      "text": " be able to make sure that you don't have any conflicts there."
    },
    {
      "speakerLabel": "spk_0",
      "start": 403.68,
      "end": 409.12,
      "text": " Do we agree that I suppose the rule of thumb is how you structure your organization should be somewhat reflected in"
    },
    {
      "speakerLabel": "spk_0",
      "start": 409.12,
      "end": 415.04,
      "text": " how do you structure accounts, right? Yeah, I think so. This is Conway's law, isn't it?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 415.04,
      "end": 420.56,
      "text": " Exactly. Your architecture is going to follow your team structure anyway. So maybe your"
    },
    {
      "speakerLabel": "spk_1",
      "start": 420.56,
      "end": 427.04,
      "text": " account structure also fits into that."
    },
    {
      "speakerLabel": "spk_0",
      "start": 427.04,
      "end": 433.68,
      "text": " And I suppose to summarize this concept, the benefits of doing that is that when you create accounts, you are trying to enforce autonomy on one side,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 433.68,
      "end": 438.64,
      "text": " but also security boundaries as we mentioned. But there is another interesting topic that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 438.64,
      "end": 445.84,
      "text": " is every account comes with quotas. So AWS will allow you to do a certain number of things"
    },
    {
      "speakerLabel": "spk_0",
      "start": 445.84,
      "end": 451.52,
      "text": " depending on the services you use. And of course, the more teams are trying to use the same account,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 451.52,
      "end": 456.08,
      "text": " the more likely it's going to be that you hit those limits and that can become a little bit of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 456.08,
      "end": 461.84,
      "text": " a complication. It can slow you down. So also keeping more granular accounts will make it"
    },
    {
      "speakerLabel": "spk_0",
      "start": 461.84,
      "end": 469.52,
      "text": " easier to use responsibly every account without having to ask for increased quotas or do other"
    },
    {
      "speakerLabel": "spk_0",
      "start": 469.52,
      "end": 477.35999999999996,
      "text": " things like that. Absolutely. Yeah."
    },
    {
      "speakerLabel": "spk_1",
      "start": 477.35999999999996,
      "end": 481.35999999999996,
      "text": " When we talk about the application per account per environment as well, sorry, account per application for an environment, we should also mention it's pretty"
    },
    {
      "speakerLabel": "spk_1",
      "start": 481.35999999999996,
      "end": 488.15999999999997,
      "text": " common as well to have shared tooling accounts like for CI CD where you might put your pipelines"
    },
    {
      "speakerLabel": "spk_1",
      "start": 488.16,
      "end": 493.52000000000004,
      "text": " and other things that aren't specific to the runtime environment of your application. Because"
    },
    {
      "speakerLabel": "spk_1",
      "start": 493.52000000000004,
      "end": 498.96000000000004,
      "text": " there you have a different set of access criteria and concerns to your runtime environment. And it's"
    },
    {
      "speakerLabel": "spk_1",
      "start": 498.96000000000004,
      "end": 505.28000000000003,
      "text": " good to keep those two things separate."
    },
    {
      "speakerLabel": "spk_0",
      "start": 505.28000000000003,
      "end": 511.84000000000003,
      "text": " It's kind of like a control plane that then can act on behalf of the other accounts, right? Yeah, that's it. Yeah. And it works pretty well."
    },
    {
      "speakerLabel": "spk_1",
      "start": 511.84000000000003,
      "end": 517.0400000000001,
      "text": " And you get very familiar then with providing cross-account access, which is a good skill and a discipline to have when"
    },
    {
      "speakerLabel": "spk_1",
      "start": 517.04,
      "end": 523.8399999999999,
      "text": " you've got multiple accounts."
    },
    {
      "speakerLabel": "spk_0",
      "start": 523.8399999999999,
      "end": 529.68,
      "text": " So I suppose the next question is, do we think that every developer in a team should have their own account? Is that too much or are there benefits in that?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 530.48,
      "end": 535.36,
      "text": " It's a good goal to consider, but it's not necessarily required for people to be productive."
    },
    {
      "speakerLabel": "spk_1",
      "start": 535.36,
      "end": 540.7199999999999,
      "text": " And it kind of depends on what your account requirements are. Some applications might need"
    },
    {
      "speakerLabel": "spk_1",
      "start": 540.7199999999999,
      "end": 545.5999999999999,
      "text": " to have a certain level of setup when you create an account. Like you might need to go to AWS and"
    },
    {
      "speakerLabel": "spk_1",
      "start": 545.6,
      "end": 552.08,
      "text": " get limit increases. Some of that might take support to get a lead time. So you don't necessarily"
    },
    {
      "speakerLabel": "spk_1",
      "start": 552.08,
      "end": 557.12,
      "text": " need to make it one account per developer and make sure that if a new developer joins a team,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 557.12,
      "end": 563.36,
      "text": " you stand up a new account. You can certainly do that. And it provides a good level of autonomy."
    },
    {
      "speakerLabel": "spk_1",
      "start": 563.36,
      "end": 567.9200000000001,
      "text": " But if you've got a team that's collaborating with each other anyway, you might have pairing sessions."
    },
    {
      "speakerLabel": "spk_1",
      "start": 568.64,
      "end": 574.72,
      "text": " You don't necessarily need one per developer. What we see quite often is that you have a pool"
    },
    {
      "speakerLabel": "spk_1",
      "start": 574.72,
      "end": 578.96,
      "text": " of accounts and you just allocate them to people working on different features"
    },
    {
      "speakerLabel": "spk_1",
      "start": 580.1600000000001,
      "end": 584.48,
      "text": " in a given sprint, say in your team. And that tends to work pretty well."
    },
    {
      "speakerLabel": "spk_0",
      "start": 584.48,
      "end": 590.88,
      "text": " Yeah, I agree with that. I actually prefer that approach because encourages people to talk more"
    },
    {
      "speakerLabel": "spk_0",
      "start": 590.88,
      "end": 595.36,
      "text": " between each other and try to figure out, okay, what are you working on? Maybe because you're"
    },
    {
      "speakerLabel": "spk_0",
      "start": 595.36,
      "end": 600.72,
      "text": " working in this environment, let's finish this feature together. Instead with the single account"
    },
    {
      "speakerLabel": "spk_0",
      "start": 600.72,
      "end": 605.52,
      "text": " per developer is a lot more, this is my account, let me do my thing. And you can keep doing your"
    },
    {
      "speakerLabel": "spk_0",
      "start": 605.52,
      "end": 611.76,
      "text": " own thing in your own account, which I don't know, I guess encourages a non-collaborative"
    },
    {
      "speakerLabel": "spk_0",
      "start": 611.76,
      "end": 616,
      "text": " environment at that point."
    },
    {
      "speakerLabel": "spk_1",
      "start": 616.5600000000001,
      "end": 620.88,
      "text": " I guess the main goal with having developer accounts is that people on the team have an environment where they can experiment freely and don't really have to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 620.88,
      "end": 627.0400000000001,
      "text": " worry about breaking things that matter to other people. I think there's a lot of people doing"
    },
    {
      "speakerLabel": "spk_1",
      "start": 627.04,
      "end": 633.04,
      "text": " interesting things like in their continuous deployment pipelines then having automated"
    },
    {
      "speakerLabel": "spk_1",
      "start": 633.04,
      "end": 636.8,
      "text": " processes. So when you create a pull request or when you create a branch, it'll automatically"
    },
    {
      "speakerLabel": "spk_1",
      "start": 637.4399999999999,
      "end": 643.68,
      "text": " deploy a stack from that branch into an account. And then when you merge the PR and delete the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 643.68,
      "end": 648.24,
      "text": " branch, it will tear down that stack. So you can automate a lot of that stuff as well, and it can"
    },
    {
      "speakerLabel": "spk_1",
      "start": 648.24,
      "end": 652.88,
      "text": " make it very productive for people so that if you've got lots of microservices they need to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 652.88,
      "end": 657.68,
      "text": " deploy, they don't have to go to the manual effort of doing that every time they open a new PR."
    },
    {
      "speakerLabel": "spk_0",
      "start": 662.16,
      "end": 666.8,
      "text": " Yeah, that's a good practice because I suppose that will also help to keep those environment as clean as possible so that when people transition across these accounts,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 668.96,
      "end": 672.48,
      "text": " they have some expectations on where they are starting from."
    },
    {
      "speakerLabel": "spk_0",
      "start": 673.4399999999999,
      "end": 679.68,
      "text": " So I suppose the next topic is because we are talking a lot about freedom and having different"
    },
    {
      "speakerLabel": "spk_0",
      "start": 679.68,
      "end": 685.28,
      "text": " accounts where you can experiment freely. We should probably also discuss if there is something"
    },
    {
      "speakerLabel": "spk_0",
      "start": 685.28,
      "end": 692.4799999999999,
      "text": " that you should restrict, right? And how, and I suppose there are two ways of seeing this. You"
    },
    {
      "speakerLabel": "spk_0",
      "start": 692.4799999999999,
      "end": 699.92,
      "text": " could either be very defensive. You could say, okay, I'm going to allow you in this account only"
    },
    {
      "speakerLabel": "spk_0",
      "start": 699.92,
      "end": 705.3599999999999,
      "text": " specific actions so you can provision only specific resources. And that's it. You cannot do anything"
    },
    {
      "speakerLabel": "spk_0",
      "start": 705.36,
      "end": 713.44,
      "text": " else. Or the opposite mindset could be like trust but verify. You have more freedom, but you also"
    },
    {
      "speakerLabel": "spk_0",
      "start": 713.44,
      "end": 719.6800000000001,
      "text": " have a way to detect what's going on and maybe realize if something dangerous is happening. So"
    },
    {
      "speakerLabel": "spk_0",
      "start": 719.6800000000001,
      "end": 724.8000000000001,
      "text": " you can have monitoring or configuration tools that allows you to see, okay, somebody is"
    },
    {
      "speakerLabel": "spk_0",
      "start": 724.8000000000001,
      "end": 730.88,
      "text": " provisioning a very big issue instance and that's going to affect cost or something like that."
    },
    {
      "speakerLabel": "spk_0",
      "start": 730.88,
      "end": 734.16,
      "text": " Do you have any preference like in one or the other?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 739.76,
      "end": 746.16,
      "text": " Yeah, I think the preference is to try and err on the side of putting in place just guardrails for people. And you have the concept of detective guardrails, which are freer for your teams,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 746.16,
      "end": 749.52,
      "text": " because it's basically you're just keeping an eye on things. And then if something does something"
    },
    {
      "speakerLabel": "spk_1",
      "start": 749.52,
      "end": 755.92,
      "text": " that you don't particularly like, you work with them and you try to remediate the situation."
    },
    {
      "speakerLabel": "spk_1",
      "start": 755.92,
      "end": 759.92,
      "text": " Then the more strict approaches you have preventive guardrails where you're putting"
    },
    {
      "speakerLabel": "spk_1",
      "start": 759.92,
      "end": 765.36,
      "text": " in like service control policies, enforcing permissions boundaries and saying you can't do that."
    },
    {
      "speakerLabel": "spk_1",
      "start": 766.64,
      "end": 772.8,
      "text": " If you want to do something new, you have to open a ticket. And ultimately it will come down to what"
    },
    {
      "speakerLabel": "spk_1",
      "start": 772.8,
      "end": 780.0799999999999,
      "text": " are the real levels of compliance that you need in your business and trying to be as trustful as"
    },
    {
      "speakerLabel": "spk_1",
      "start": 780.0799999999999,
      "end": 785.5999999999999,
      "text": " possible of teams, because that's the most productive way to do it. It's just to let people"
    },
    {
      "speakerLabel": "spk_1",
      "start": 785.6,
      "end": 791.12,
      "text": " move forward. And there's lots of things you can use like CloudTrail and AWS Config,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 791.76,
      "end": 796.72,
      "text": " which allow you to observe what's going on and then get alerts. So if you say, OK,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 796.72,
      "end": 802.4,
      "text": " we don't want people to create buckets that are not encrypted. So one of the things you"
    },
    {
      "speakerLabel": "spk_1",
      "start": 802.4,
      "end": 806.48,
      "text": " could do there is put in place a config rule. And if you get alerted then when people create"
    },
    {
      "speakerLabel": "spk_1",
      "start": 806.48,
      "end": 813.0400000000001,
      "text": " an unencrypted bucket. Right. So a much more strict approach is don't allow people to create"
    },
    {
      "speakerLabel": "spk_1",
      "start": 813.04,
      "end": 819.8399999999999,
      "text": " buckets because only we know how to create buckets properly. But that's something that"
    },
    {
      "speakerLabel": "spk_1",
      "start": 819.8399999999999,
      "end": 824.64,
      "text": " will guarantee your compliance at all times. But it is going to slow down your teams because"
    },
    {
      "speakerLabel": "spk_1",
      "start": 824.64,
      "end": 830,
      "text": " creating buckets is something developers need to do to try things quite frequently. So understand"
    },
    {
      "speakerLabel": "spk_1",
      "start": 830,
      "end": 834.88,
      "text": " the tradeoffs there. And I think you can approach this also from a cost perspective."
    },
    {
      "speakerLabel": "spk_0",
      "start": 834.88,
      "end": 840.4,
      "text": " For instance, you could have other rules that will prevent people from spinning up very expensive, easy to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 840.4,
      "end": 846.3199999999999,
      "text": " instances or maybe even at the regional level because we know there are certain regions that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 846.3199999999999,
      "end": 850.72,
      "text": " are more expensive than others. And most likely you are not going to need to use all the possible"
    },
    {
      "speakerLabel": "spk_0",
      "start": 850.72,
      "end": 856.9599999999999,
      "text": " regions. So that's another rule that can help you to limit the surface without restricting too much"
    },
    {
      "speakerLabel": "spk_0",
      "start": 857.52,
      "end": 861.76,
      "text": " the kind of activities that developers might want to do. Yeah, that's a really good one."
    },
    {
      "speakerLabel": "spk_1",
      "start": 862.8,
      "end": 866.96,
      "text": " People might say actually maybe it's worth calling it out. Doesn't that violate the principle of"
    },
    {
      "speakerLabel": "spk_1",
      "start": 866.96,
      "end": 871.76,
      "text": " least privilege if you're being so permissive with accounts? Because on cloud security,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 871.76,
      "end": 876.1600000000001,
      "text": " the important thing is the principle of least privilege, not trying to be over permissive on"
    },
    {
      "speakerLabel": "spk_1",
      "start": 876.1600000000001,
      "end": 881.9200000000001,
      "text": " permissions. I think there's maybe talking about two different things. Certainly in production and"
    },
    {
      "speakerLabel": "spk_1",
      "start": 881.9200000000001,
      "end": 888.08,
      "text": " your test accounts, you need to be enforcing least privilege. In development accounts,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 888.08,
      "end": 894.1600000000001,
      "text": " you want people to be able to be productive. So you can encourage least privilege there by"
    },
    {
      "speakerLabel": "spk_1",
      "start": 894.16,
      "end": 900.16,
      "text": " analyzing cloud trial, by retrospectively looking at things using IAM access analyzer"
    },
    {
      "speakerLabel": "spk_1",
      "start": 900.16,
      "end": 905.12,
      "text": " and trying to continually refine the IAM policies that people use. Doesn't necessarily mean locking"
    },
    {
      "speakerLabel": "spk_1",
      "start": 905.12,
      "end": 910.64,
      "text": " down everything by default. No, that's a very good clarification."
    },
    {
      "speakerLabel": "spk_0",
      "start": 910.64,
      "end": 915.1999999999999,
      "text": " For instance, I totally like the approach that you can experiment as much as you want in the development account. But as you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 915.1999999999999,
      "end": 921.28,
      "text": " do that, one principle that I really like to follow and encourage other team to do the same is"
    },
    {
      "speakerLabel": "spk_0",
      "start": 921.28,
      "end": 928.24,
      "text": " when you are building an app, don't give it any IAM permission as a starting point. And then every"
    },
    {
      "speakerLabel": "spk_0",
      "start": 928.24,
      "end": 932.4,
      "text": " time you get a failure, because of course you cannot do a specific action, I don't know,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 932.4,
      "end": 938.48,
      "text": " read or write from an strip bucket, then enable permissions gradually. And at that point,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 938.48,
      "end": 944.48,
      "text": " it's easier that you end up with a very locked down IAM policy for that particular service."
    },
    {
      "speakerLabel": "spk_0",
      "start": 944.48,
      "end": 950.4,
      "text": " And you can totally do that in a testing account. So yeah, it's a good point to try to separate"
    },
    {
      "speakerLabel": "spk_0",
      "start": 950.4,
      "end": 956.88,
      "text": " how do you define as a developer IAM policies for your services compared to as a developer,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 956.88,
      "end": 962,
      "text": " what can you actually do in an AWS account? So what about non-developer accounts then?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 962,
      "end": 966.0799999999999,
      "text": " What else do you need? Because we focused on, we mentioned production accounts and developer"
    },
    {
      "speakerLabel": "spk_1",
      "start": 966.0799999999999,
      "end": 974,
      "text": " accounts. What about testing? Yeah, that's a good point."
    },
    {
      "speakerLabel": "spk_0",
      "start": 974,
      "end": 980.64,
      "text": " I think we have at least, I've seen two different ways of working and I think they are equally good. One is probably a little bit more"
    },
    {
      "speakerLabel": "spk_0",
      "start": 980.64,
      "end": 985.28,
      "text": " traditional. So you basically have, you start from a development account, you build a feature,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 985.28,
      "end": 989.84,
      "text": " eventually you want to ship this feature to production. There is an intermediate step,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 989.84,
      "end": 994.88,
      "text": " which is this feature is going to end up to another account, which is the QA account or"
    },
    {
      "speakerLabel": "spk_0",
      "start": 995.6,
      "end": 1000.56,
      "text": " acceptance test account, whatever you want to call it. But it's basically an account that is dedicated"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1000.56,
      "end": 1007.28,
      "text": " for testing. So before you actually ship it to production, you can observe and use that feature"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1007.28,
      "end": 1012.16,
      "text": " in that environment. You can run manual and automated tests to make sure it's actually"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1012.16,
      "end": 1018.16,
      "text": " doing what you want. And then from that environment and account, you can transition to the production"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1018.16,
      "end": 1025.9199999999998,
      "text": " account. Another approach could be you skip that QA step entirely and you just go from development"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1025.92,
      "end": 1031.52,
      "text": " to production. This is a little bit of a more modern approach. And of course, when you do that,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1032.24,
      "end": 1036.72,
      "text": " you need to put some boundaries in places to make sure you are not breaking production."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1036.72,
      "end": 1042.64,
      "text": " And that's generally done through the usage of phisher flags and it follows the principle of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1042.64,
      "end": 1047.2,
      "text": " testing in production. So basically what you will do is from development to production,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1047.2,
      "end": 1053.68,
      "text": " you ship something that is technically disabled by default, and then individual users can enable"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1053.68,
      "end": 1058.3200000000002,
      "text": " that. And then they can start to play around with the phisher and see if it's actually doing what"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1058.3200000000002,
      "end": 1065.1200000000001,
      "text": " it does. And that's a good practice because it removes some of the concern we'll probably discuss"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1065.1200000000001,
      "end": 1072,
      "text": " a little bit more later around how is the data going to look like in my QA account versus the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1072,
      "end": 1077.44,
      "text": " production account. Because you are already in the production account, you don't have that concern."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1077.44,
      "end": 1082.4,
      "text": " So you are matching your production account straight away without trying to replicate"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1082.4,
      "end": 1084.8000000000002,
      "text": " a similar account in the QA environment."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1088,
      "end": 1092.88,
      "text": " And I suppose I said if you were to use the QA environment, you would have the concern of,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1093.52,
      "end": 1098.88,
      "text": " okay, I can use CloudFormation or any other infrastructure as code to try to have exactly"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1098.88,
      "end": 1104.5600000000002,
      "text": " the same infrastructure and configuration. But when it comes to data, it might not be possible"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1104.5600000000002,
      "end": 1110.88,
      "text": " to get all the production data to a QA environment because of volumes, because of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1110.88,
      "end": 1118.16,
      "text": " compliance and security and privacy reasons. So probably you'll need a process that copies some"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1118.16,
      "end": 1123.92,
      "text": " of this data and as it's being copied, you might also need to anonymize the data. So that adds"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1123.92,
      "end": 1129.5200000000002,
      "text": " more complexity, of course."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1129.5200000000002,
      "end": 1135.92,
      "text": " Yeah, trying to keep it as close as possible is important because if you have the environments matched one for one, you should match the volume of data and"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1135.92,
      "end": 1141.2,
      "text": " try and simulate the number of transactions and the transaction frequency as well."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1141.2,
      "end": 1146.4,
      "text": " So I suppose the next topic is how do you set up? Where do you start?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1146.4,
      "end": 1151.76,
      "text": " Because we know it's not easy to provision multiple accounts for different environments. Is there any tool or any best"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1151.76,
      "end": 1155.92,
      "text": " practice to get started? You could just start with a console and use that for organizations"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1155.92,
      "end": 1161.6000000000001,
      "text": " and accounts as a lot of people do."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1161.6,
      "end": 1167.6,
      "text": " But I find it's really worthwhile putting some effort into using infrastructure as code for your organizations and accounts. And this is probably the most"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1167.6,
      "end": 1173.9199999999998,
      "text": " pragmatic approach that gives you a lot of stability and control and visibility into what"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1173.9199999999998,
      "end": 1179.1999999999998,
      "text": " changes you're making. So there's two options there. You could use Terraform because Terraform"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1179.1999999999998,
      "end": 1184.56,
      "text": " will allow you to create organization accounts. And there's another product which we use, an open"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1184.56,
      "end": 1192.24,
      "text": " source project called Org Formation. And Org Formation is essentially like a cloud formation"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1192.24,
      "end": 1198.24,
      "text": " additional layer that allows you to manage organizations and accounts and do things across"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1198.24,
      "end": 1203.04,
      "text": " lots of different accounts in your organization. So if you need to have every time you spin up an"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1203.04,
      "end": 1207.6799999999998,
      "text": " account, you need to put a certain set of resources in place like your config rules or your cloud"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1207.6799999999998,
      "end": 1212.32,
      "text": " trail. And it allows you to do that really easy and it doesn't take a lot of code to do that."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1212.32,
      "end": 1216.8,
      "text": " The project also comes with a lot of great example templates for that. So I'd really recommend either"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1216.8,
      "end": 1224,
      "text": " of those. I think it's also really good to use single sign-on on AWS because if you're using"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1224,
      "end": 1231.36,
      "text": " IAM users, not only is it kind of almost a deprecated way of logging onto AWS, you end up"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1231.36,
      "end": 1237.12,
      "text": " with long-term credentials per account, which can be very difficult to manage. So SSO allows you to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1237.12,
      "end": 1244.4799999999998,
      "text": " sign on and have assignments between your users in your identity provider, the accounts and the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1244.4799999999998,
      "end": 1249.6,
      "text": " permissions. And so there's this triangle and you can configure all those things with infrastructure"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1249.6,
      "end": 1255.6,
      "text": " as code. There's some rough edges there because a lot of the AWS APIs don't allow you to control"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1255.6,
      "end": 1259.84,
      "text": " all of these things as you wish. And like there's, for example, there's still no API to delete an"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1259.84,
      "end": 1265.04,
      "text": " account. So you can create accounts very easily programmatically, but the last thing you need to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1265.04,
      "end": 1270.1599999999999,
      "text": " do is delete them. So you can't do that very easily programmatically, but deleting them becomes a pain."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1270.1599999999999,
      "end": 1276.1599999999999,
      "text": " Yeah. The other thing I really like from SSO is that you get, when you go to the web console and"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1276.1599999999999,
      "end": 1281.84,
      "text": " you do your logging, your SSO login, you end up in a page where it's very clear what are all the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1281.84,
      "end": 1287.92,
      "text": " accounts that exists and all the roles that you as a user have in every account. So I think just that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1287.92,
      "end": 1292.56,
      "text": " is extremely valuable because you have like literally a dashboard where you can see what you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1292.56,
      "end": 1295.76,
      "text": " have in your application using the different AWS accounts."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1295.76,
      "end": 1302,
      "text": " Yeah, I agree. It's a game changer when you're coming from IAM users. There's also this thing"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1302,
      "end": 1307.76,
      "text": " of account vending machines. And I think if you've got a really large organization and you're doing"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1307.76,
      "end": 1312.72,
      "text": " this frequently and you need a lot of automation, it's something you can look at. And there's a"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1312.72,
      "end": 1320.32,
      "text": " landing zone that AWS provide, which is a solution to kind of automate this. And you can use"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1320.32,
      "end": 1325.9199999999998,
      "text": " catalog and a lot of AWS resources to automate the process of creating an account and provisioning it"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1325.9199999999998,
      "end": 1331.6,
      "text": " with all these things. You could imagine it could be a massive project for your company. That's the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1331.6,
      "end": 1337.04,
      "text": " only thing I'd say. So I wouldn't go all in on automating that approach unless you want to really"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1337.04,
      "end": 1341.28,
      "text": " dedicate a lot of engineering hours to it. There's nothing that will just work really well out of the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1341.28,
      "end": 1348.48,
      "text": " box for you. So I think you'll get 90% of what you need with just like org formation or Terraform"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1348.48,
      "end": 1352.96,
      "text": " and a process to manage that. And then you can have pull requests against your organization"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1352.96,
      "end": 1359.76,
      "text": " for new accounts and it just works like everything else. So yeah, that's the approach I'd recommend"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1359.76,
      "end": 1364.32,
      "text": " for provisioning new accounts for developers, staging. And then it's something you can have"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1364.32,
      "end": 1369.52,
      "text": " templates for every new application. You have like a set of dev accounts and a staging account and a"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1369.52,
      "end": 1374.16,
      "text": " production account and your CI CD. Yeah, I like that approach."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1374.16,
      "end": 1380.96,
      "text": " I think infrastructure as code applies very well also to this particular topic. Okay, so I think that covers everything we had"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1380.96,
      "end": 1387.8400000000001,
      "text": " for this episode. I am personally really, really curious to see what kind of way you found to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1387.8400000000001,
      "end": 1392.96,
      "text": " organize your accounts and environments. We have seen many, many different configurations with"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1392.96,
      "end": 1398.48,
      "text": " our customers and our projects. And I think there are many, many different ways and they are equally"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1398.48,
      "end": 1403.1200000000001,
      "text": " valid. So if you do something that is different from what we suggested, please let us know because"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1403.12,
      "end": 1407.52,
      "text": " we are really curious to find out what are your trade-offs and why you decided to do something"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1407.52,
      "end": 1414,
      "text": " different. Also, this is a topic that is always evolving. Even AWS is constantly pushing new tools"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1414,
      "end": 1420.8,
      "text": " and new recommendations. So again, if you know any other way that it's equally valid for you,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1420.8,
      "end": 1436.08,
      "text": " please let us know and let's have a chat. And with that, we'll see you at the next episode. Bye."
    }
  ]
}