{
  "speakers": {
    "spk_0": "spk_0",
    "spk_1": "spk_1"
  },
  "segments": [
    {
      "speakerLabel": "spk_0",
      "start": 0,
      "end": 4,
      "text": " We do love AWS, but we have to admit that it's not always a silver bullet."
    },
    {
      "speakerLabel": "spk_0",
      "start": 4,
      "end": 8,
      "text": " There are definitely use cases where it might be worth considering alternatives."
    },
    {
      "speakerLabel": "spk_0",
      "start": 8,
      "end": 12,
      "text": " Today we will discuss some of these use cases and we will try to highlight what are the advantages"
    },
    {
      "speakerLabel": "spk_0",
      "start": 12,
      "end": 16,
      "text": " that other platforms or services can have over AWS in very specific circumstances."
    },
    {
      "speakerLabel": "spk_0",
      "start": 16,
      "end": 20,
      "text": " My name is Luciano and today I'm joined by Eoin and this is AWS Bites podcast."
    },
    {
      "speakerLabel": "spk_0",
      "start": 20,
      "end": 36,
      "text": " So Eoin, why don't we start by asking ourselves why we would prefer to go all in on AWS for everything?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 36,
      "end": 40,
      "text": " That seems to be kind of the default, that you try and look for the AWS solution first,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 40,
      "end": 45,
      "text": " but you don't want to get distracted by that single focus and maybe be a little bit more open-minded."
    },
    {
      "speakerLabel": "spk_1",
      "start": 45,
      "end": 51,
      "text": " But the reason you do it is because generally the way the AWS services are delivered, they're well integrated with each other."
    },
    {
      "speakerLabel": "spk_1",
      "start": 51,
      "end": 55,
      "text": " You also get like unified billing and in general people have a level of trust in AWS."
    },
    {
      "speakerLabel": "spk_1",
      "start": 55,
      "end": 63,
      "text": " If you pick a vendor as important as your primary public cloud vendor, you want to go all in on them and you want to trust them"
    },
    {
      "speakerLabel": "spk_1",
      "start": 63,
      "end": 66,
      "text": " and you believe that they're going to stick around and they're not going to retire services,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 66,
      "end": 70,
      "text": " they're not going to be acquired by some bigger company who then retires the services."
    },
    {
      "speakerLabel": "spk_1",
      "start": 70,
      "end": 73,
      "text": " So that's a good reason to go all in on AWS."
    },
    {
      "speakerLabel": "spk_1",
      "start": 73,
      "end": 79,
      "text": " But like I said, you probably shouldn't always, so why would you want to go for third-party services instead in some cases?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 79,
      "end": 84,
      "text": " Yeah, that's a good point. I would also add that AWS generally gives you very good levels of scalability."
    },
    {
      "speakerLabel": "spk_0",
      "start": 84,
      "end": 91,
      "text": " You have this peace of mind that if your project actually grows a lot, you can find a very good part of scaling up with AWS."
    },
    {
      "speakerLabel": "spk_0",
      "start": 91,
      "end": 95,
      "text": " But I mean, realistically, that's not always a realistic expectation, right?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 95,
      "end": 102,
      "text": " Sometimes you have very modest projects and it's okay to deal with them so you don't have to think about that level of scalability."
    },
    {
      "speakerLabel": "spk_0",
      "start": 102,
      "end": 109,
      "text": " So other cases, I guess, is when you have very specific needs and there might be tools,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 109,
      "end": 114,
      "text": " the companies that are focusing on that one particular need and they're providing very, very good service."
    },
    {
      "speakerLabel": "spk_0",
      "start": 114,
      "end": 117,
      "text": " And I think we'll discuss some of these examples later on during this episode."
    },
    {
      "speakerLabel": "spk_0",
      "start": 117,
      "end": 123,
      "text": " So basically, in those cases, you might end up having a much better user experience, probably even price and feature set,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 123,
      "end": 128,
      "text": " than just going with some of the many AWS services."
    },
    {
      "speakerLabel": "spk_0",
      "start": 128,
      "end": 132,
      "text": " In other cases, it's more about the billing, I guess."
    },
    {
      "speakerLabel": "spk_0",
      "start": 132,
      "end": 138,
      "text": " It's more about how easy it is for me to predict cost in a specific service rather than in AWS."
    },
    {
      "speakerLabel": "spk_0",
      "start": 138,
      "end": 141,
      "text": " Some offering, for instance, we'll talk about virtual machines."
    },
    {
      "speakerLabel": "spk_0",
      "start": 141,
      "end": 147,
      "text": " If you just need one virtual machine, the cost unit is generally easier if you go with something like Digital Ocean or Linod,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 147,
      "end": 153,
      "text": " rather than thinking in terms of AWS where you have so many different parameters that is a little bit harder to predict the cost in advance."
    },
    {
      "speakerLabel": "spk_0",
      "start": 153,
      "end": 159,
      "text": " And in general, we'll talk about simplicity because, of course, we know we have been talking a lot about this, actually, in previous episodes,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 159,
      "end": 162,
      "text": " that AWS has a decent barrier to entry."
    },
    {
      "speakerLabel": "spk_0",
      "start": 162,
      "end": 168,
      "text": " You need to learn a bunch of concepts before you can start to deploy anything serious on AWS."
    },
    {
      "speakerLabel": "spk_0",
      "start": 168,
      "end": 175,
      "text": " So if you are just looking for, again, a simpler way to just deploy things in the cloud and launch products,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 175,
      "end": 183,
      "text": " other platforms might give you better access to the resources and more simple user experience in general."
    },
    {
      "speakerLabel": "spk_0",
      "start": 183,
      "end": 187,
      "text": " So I guess, yeah, let's start by picking some examples."
    },
    {
      "speakerLabel": "spk_0",
      "start": 187,
      "end": 193,
      "text": " I suppose my first one, because it's also a topic we have been discussing before, is what about authentication?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 193,
      "end": 198,
      "text": " Would you go with Cognito or are there alternatives that you would prefer in some cases?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 198,
      "end": 204,
      "text": " Yeah, I would definitely use either Cognito or likely something like Auth0."
    },
    {
      "speakerLabel": "spk_1",
      "start": 204,
      "end": 208,
      "text": " I think these are the two which compete very well with each other."
    },
    {
      "speakerLabel": "spk_1",
      "start": 208,
      "end": 213,
      "text": " Cognito, maybe we should do a deep dive on it in a future episode because there is a lot of features there."
    },
    {
      "speakerLabel": "spk_1",
      "start": 213,
      "end": 219,
      "text": " Unfortunately, it suffers from a couple of drawbacks, like poor naming of some of the concepts in there,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 219,
      "end": 223,
      "text": " which make it very confusing, difficult to get to grips with the documentation."
    },
    {
      "speakerLabel": "spk_1",
      "start": 223,
      "end": 225,
      "text": " There are some feature gaps as well."
    },
    {
      "speakerLabel": "spk_1",
      "start": 225,
      "end": 229,
      "text": " So from a developer experience point of view, it suffers, unfortunately."
    },
    {
      "speakerLabel": "spk_1",
      "start": 229,
      "end": 233,
      "text": " Auth0, on the other hand, has a really nice developer experience and a really good onboarding."
    },
    {
      "speakerLabel": "spk_1",
      "start": 233,
      "end": 238,
      "text": " So if you want to integrate authentication, authorization, like sign up, log in,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 238,
      "end": 245,
      "text": " log in with social identity providers, Auth0 will allow you to do that very quickly."
    },
    {
      "speakerLabel": "spk_1",
      "start": 245,
      "end": 250,
      "text": " And the whole developer experience in general is going to be much smoother."
    },
    {
      "speakerLabel": "spk_1",
      "start": 250,
      "end": 254,
      "text": " The other thing about Auth0 is that it solves those kind of small company startup problems,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 254,
      "end": 260,
      "text": " like how do I add sign up and log into my application in an easy way?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 260,
      "end": 266,
      "text": " But it also solves equally well the enterprise integration scenarios like SAML integration"
    },
    {
      "speakerLabel": "spk_1",
      "start": 266,
      "end": 269,
      "text": " and OpenID Connect for enterprise as well."
    },
    {
      "speakerLabel": "spk_1",
      "start": 269,
      "end": 272,
      "text": " So there's a lot of feature supported there."
    },
    {
      "speakerLabel": "spk_1",
      "start": 272,
      "end": 278,
      "text": " So the only advantage is, and as with all of these things, you just have to compare the pricing models,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 278,
      "end": 281,
      "text": " I think, with the user-based pricing model with Auth0."
    },
    {
      "speakerLabel": "spk_1",
      "start": 281,
      "end": 286,
      "text": " I believe it's still quite expensive when you get to large numbers of users."
    },
    {
      "speakerLabel": "spk_1",
      "start": 286,
      "end": 294,
      "text": " Cognito is pretty inexpensive for large numbers of users by comparison."
    },
    {
      "speakerLabel": "spk_1",
      "start": 294,
      "end": 299,
      "text": " I suppose the other thing you need to think about is just do you need deep integration with IAM?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 299,
      "end": 305,
      "text": " So if you're using Cognito, you get good integration to API Gateway authorizers and AppSync authorizers."
    },
    {
      "speakerLabel": "spk_1",
      "start": 305,
      "end": 311,
      "text": " You won't get that out of the box, and you just have to use a custom authorizer with Auth0 or any other third party."
    },
    {
      "speakerLabel": "spk_1",
      "start": 311,
      "end": 315,
      "text": " So that's the authentication, authorization scenario."
    },
    {
      "speakerLabel": "spk_1",
      "start": 315,
      "end": 318,
      "text": " What else? What else is a topic where people..."
    },
    {
      "speakerLabel": "spk_1",
      "start": 318,
      "end": 322,
      "text": " I think Auth0 is probably the number one thing that people would reach for outside of AWS."
    },
    {
      "speakerLabel": "spk_1",
      "start": 322,
      "end": 326,
      "text": " What else is pretty popular for people who are..."
    },
    {
      "speakerLabel": "spk_1",
      "start": 326,
      "end": 330,
      "text": " There is an option in AWS, but it's not people's number one choice."
    },
    {
      "speakerLabel": "spk_0",
      "start": 336,
      "end": 339,
      "text": " I guess we can talk about search because it's one of those use cases where eventually for any reasonable application, you'll need some search functionality, and that's where you start to ask yourself,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 339,
      "end": 345,
      "text": " okay, how do I build this in AWS, and then you realize it can be much more involved than you actually wanted it to be,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 345,
      "end": 350,
      "text": " and then you might want to start thinking about alternatives outside AWS."
    },
    {
      "speakerLabel": "spk_0",
      "start": 350,
      "end": 356,
      "text": " But if we just stick to AWS, probably the default is Amazon Open Search, so Amazon version of Elasticsearch."
    },
    {
      "speakerLabel": "spk_0",
      "start": 356,
      "end": 362,
      "text": " And while that is good, it's still a little bit annoying that you still need to think in terms of servers."
    },
    {
      "speakerLabel": "spk_0",
      "start": 362,
      "end": 368,
      "text": " You need to provision a cluster and find the servers, and there is not really a serverless model,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 368,
      "end": 374,
      "text": " which is something that I guess is going to go into my own personal wish list for AWS,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 374,
      "end": 380,
      "text": " because of course most of the time you just want an API or something that allows you to index some data"
    },
    {
      "speakerLabel": "spk_0",
      "start": 380,
      "end": 382,
      "text": " and then search over the indices."
    },
    {
      "speakerLabel": "spk_0",
      "start": 382,
      "end": 388,
      "text": " And with Open Search, of course, you need to do a lot more before you can access to that level of API."
    },
    {
      "speakerLabel": "spk_0",
      "start": 388,
      "end": 394,
      "text": " And there is an Elastic Cloud as an alternative, so the cloud from Elasticsearch creators,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 394,
      "end": 400,
      "text": " but that one is also very similar, meaning that it's based on instances, and you need to provision those instances."
    },
    {
      "speakerLabel": "spk_0",
      "start": 400,
      "end": 404,
      "text": " So I guess maybe the user experience can be a little bit better."
    },
    {
      "speakerLabel": "spk_0",
      "start": 404,
      "end": 406,
      "text": " I actually don't know because I haven't tried it."
    },
    {
      "speakerLabel": "spk_0",
      "start": 406,
      "end": 412,
      "text": " But again, you need to go outside AWS, create a whole account, and manage the billing"
    },
    {
      "speakerLabel": "spk_0",
      "start": 412,
      "end": 419,
      "text": " for something that eventually is still based on instances, and it doesn't seem to give you a lot of advantages."
    },
    {
      "speakerLabel": "spk_0",
      "start": 419,
      "end": 427,
      "text": " So yeah, I guess if you want to zoom in a little bit more on different types of use cases,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 427,
      "end": 432,
      "text": " maybe we can also talk about other alternative products, because I suppose one use case is about search."
    },
    {
      "speakerLabel": "spk_0",
      "start": 432,
      "end": 437,
      "text": " So you really just want to index data and then search over it."
    },
    {
      "speakerLabel": "spk_0",
      "start": 437,
      "end": 444,
      "text": " Other very common use case for Elasticsearch is about managing logs, distributed logs, and centralizing them somehow."
    },
    {
      "speakerLabel": "spk_0",
      "start": 444,
      "end": 451,
      "text": " And for those use cases, I've used Elasticsearch, and I think it works really, really well, especially when combined with Kibana."
    },
    {
      "speakerLabel": "spk_0",
      "start": 451,
      "end": 457,
      "text": " But again, it's a little bit of a messy setup, and it takes a little bit of time before you get it right."
    },
    {
      "speakerLabel": "spk_0",
      "start": 457,
      "end": 465,
      "text": " So in those cases, if you want to avoid all of that, you can use third-party services focused at 100% on the logs use cases."
    },
    {
      "speakerLabel": "spk_0",
      "start": 465,
      "end": 470,
      "text": " And these are like Loggly, Logs, DotIO, Splunk, Datadog, Onacom, and so on."
    },
    {
      "speakerLabel": "spk_0",
      "start": 470,
      "end": 478,
      "text": " Instead, equivalent if you want to think about pure product search, or documentation search, document search in a more general way,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 478,
      "end": 487,
      "text": " Algolia is probably the go-to service where you just want to give me an account, give me an API, I don't want to think about servers."
    },
    {
      "speakerLabel": "spk_0",
      "start": 487,
      "end": 494,
      "text": " And it gives you a very nice developer experience, you can get a very good documentation."
    },
    {
      "speakerLabel": "spk_0",
      "start": 494,
      "end": 500,
      "text": " There are also cases where you can get the service for free, like for instance if it's an open-source project, you can easily request Algolia."
    },
    {
      "speakerLabel": "spk_0",
      "start": 500,
      "end": 506,
      "text": " There is like a web form, you need to feel like, can you support us by giving us a certain level of access for free?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 506,
      "end": 512,
      "text": " And at least in my experience, it's been pretty easy to go through the process, and they seem to be very open to support open-source projects."
    },
    {
      "speakerLabel": "spk_0",
      "start": 512,
      "end": 520,
      "text": " And the API is generally very nice, and you also get pre-made scripts or widgets that you can just copy in your application,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 520,
      "end": 524,
      "text": " and everything magically works, at least to a certain degree."
    },
    {
      "speakerLabel": "spk_0",
      "start": 531,
      "end": 536,
      "text": " The only thing is that if you use it at scale, because you really have successfully commerce with thousands of products, I think it might get expensive very quickly, based on what I've seen on the pricing."
    },
    {
      "speakerLabel": "spk_0",
      "start": 536,
      "end": 542,
      "text": " But that's always kind of the trade-off between go and do all the work of setting up infrastructure,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 542,
      "end": 547,
      "text": " and then maybe you get a little bit of economy of scale there, rather than just using a software as a service,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 547,
      "end": 551,
      "text": " which might be very cheap at the beginning, but then the scale curve grows very steeply,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 551,
      "end": 557,
      "text": " and you might end up paying a lot when you are reaching those levels of growth."
    },
    {
      "speakerLabel": "spk_0",
      "start": 557,
      "end": 561,
      "text": " Yeah, so I think that covers search and logs pretty well."
    },
    {
      "speakerLabel": "spk_0",
      "start": 561,
      "end": 568,
      "text": " What about something else very common? I'm thinking, hosting files like CDNs or websites."
    },
    {
      "speakerLabel": "spk_1",
      "start": 573,
      "end": 578,
      "text": " Yeah, this is actually something we talked about in one of the previous episodes, I think back near the beginning, we talked about how to deploy a static website on AWS, and we talked specifically about CDNs."
    },
    {
      "speakerLabel": "spk_1",
      "start": 578,
      "end": 588,
      "text": " I know we mentioned things like GitHub Pages and Vercel and Netlify as ways of getting a static website up and running very quickly on CDN."
    },
    {
      "speakerLabel": "spk_1",
      "start": 588,
      "end": 594,
      "text": " Netlify is actually the site that we use for hosting the AWS bytes website, awsbytes.com, funnily enough."
    },
    {
      "speakerLabel": "spk_1",
      "start": 594,
      "end": 599,
      "text": " And then you also have, I guess, not just static websites, but sometimes you've got other CDN needs,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 599,
      "end": 607,
      "text": " like for video or documents or images, so there's lots of different use cases out there that can leverage a CMS."
    },
    {
      "speakerLabel": "spk_1",
      "start": 607,
      "end": 613,
      "text": " So CloudFront is pretty good. I think CloudFront is a great option, and I'd use it quite a lot, but it's not suitable for every scenario."
    },
    {
      "speakerLabel": "spk_1",
      "start": 613,
      "end": 617,
      "text": " We mentioned before that it might be slow to update. Configuration is complex enough."
    },
    {
      "speakerLabel": "spk_1",
      "start": 617,
      "end": 621,
      "text": " So this is an area where there are quite a few alternatives."
    },
    {
      "speakerLabel": "spk_1",
      "start": 621,
      "end": 627,
      "text": " Cloudflare comes up quite often, I think, especially in the kind of small to medium business space."
    },
    {
      "speakerLabel": "spk_1",
      "start": 627,
      "end": 633,
      "text": " They've got also a lot of other products around it, like for protection and firewall, that kind of stuff."
    },
    {
      "speakerLabel": "spk_1",
      "start": 633,
      "end": 639,
      "text": " And then you have things like Fastly, which is known for being particularly fast."
    },
    {
      "speakerLabel": "spk_1",
      "start": 639,
      "end": 646,
      "text": " And then you've got the big older enterprise players like Akamai, which have been around forever, it seems."
    },
    {
      "speakerLabel": "spk_1",
      "start": 646,
      "end": 651,
      "text": " So there's a lot of alternatives out there in the CDN space, and some of them are pretty fast to get up and running with,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 651,
      "end": 658,
      "text": " especially the more modern services. And yeah, I think it's one area where it really depends on your use case,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 658,
      "end": 661,
      "text": " but you've got good options out there."
    },
    {
      "speakerLabel": "spk_1",
      "start": 661,
      "end": 667,
      "text": " So if we think back then to data, let's maybe think about databases."
    },
    {
      "speakerLabel": "spk_1",
      "start": 667,
      "end": 677,
      "text": " You've got a lot of options in AWS, really, with RDS, right? You've got DynamoDB, which has grown in popularity in a phenomenal way."
    },
    {
      "speakerLabel": "spk_1",
      "start": 677,
      "end": 682,
      "text": " Then you have things like Aurora Serverless, which are kind of serverless, not quite there yet,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 682,
      "end": 688,
      "text": " a little bit debatable in whether you should use them or not. So what else is out there that people should be looking at?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 688,
      "end": 695,
      "text": " I guess looking outside AWS, the main first contender to DynamoDB is probably MongoDB."
    },
    {
      "speakerLabel": "spk_0",
      "start": 695,
      "end": 703,
      "text": " And there is MongoDB Atlas, which is kind of, I suppose, a good alternative to DynamoDB, if you like,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 703,
      "end": 707,
      "text": " document-based databases like Dynamo or NoSQL databases."
    },
    {
      "speakerLabel": "spk_0",
      "start": 707,
      "end": 712,
      "text": " And the good news is that recently there is a serverless option for MongoDB Atlas,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 712,
      "end": 719,
      "text": " so probably much more lightweight in terms of configuring the whole cluster and scaling it and so on."
    },
    {
      "speakerLabel": "spk_0",
      "start": 719,
      "end": 722,
      "text": " I haven't used it yet, but it seems to be an interesting alternative."
    },
    {
      "speakerLabel": "spk_0",
      "start": 722,
      "end": 726,
      "text": " If you're looking, if you like to use MongoDB and if you're looking for the kind of model where it's like,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 726,
      "end": 731,
      "text": " just give me a database and scale it for me and I'm going to pay as I go."
    },
    {
      "speakerLabel": "spk_0",
      "start": 731,
      "end": 738,
      "text": " Another interesting one is that I noticed that recently enough, I think it was either this year or at some point last year,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 738,
      "end": 742,
      "text": " DigitalOcean launched kind of an alternative to RDS."
    },
    {
      "speakerLabel": "spk_0",
      "start": 742,
      "end": 747,
      "text": " It looks very similar, even though it covers Postgres and MySQL as kind of relational databases,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 747,
      "end": 753,
      "text": " but it also covers Redis and MongoDB as other classes of databases that in AWS they will go kind of somewhere else,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 753,
      "end": 755,
      "text": " in a different category of databases."
    },
    {
      "speakerLabel": "spk_0",
      "start": 755,
      "end": 759,
      "text": " And this one is interesting because if you like DigitalOcean and if you use it,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 759,
      "end": 763,
      "text": " you probably know that they spend a lot of time making sure that the developer experience is good"
    },
    {
      "speakerLabel": "spk_0",
      "start": 763,
      "end": 767,
      "text": " and it's very easy to see, to understand how to provision anything and get things up and running."
    },
    {
      "speakerLabel": "spk_0",
      "start": 767,
      "end": 770,
      "text": " You get lots of documentation, lots of tutorials,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 770,
      "end": 775,
      "text": " but the UI is generally very driven to kind of a workflow where it's like step one, step two, step three,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 775,
      "end": 779,
      "text": " and at the end you have everything up and running as you would expect."
    },
    {
      "speakerLabel": "spk_0",
      "start": 779,
      "end": 785,
      "text": " And I saw a small demo there showing how to provision a Postgres database and it seems like really simple to get started with."
    },
    {
      "speakerLabel": "spk_0",
      "start": 785,
      "end": 790,
      "text": " So if you are already using DigitalOcean for something else and you just want a database that is more managed"
    },
    {
      "speakerLabel": "spk_0",
      "start": 790,
      "end": 795,
      "text": " than provisioning everything yourself, that's probably a good alternative to use."
    },
    {
      "speakerLabel": "spk_0",
      "start": 795,
      "end": 801,
      "text": " And I remember you mentioned to me some time ago, Eoin, about something I think from IBM called Compose,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 801,
      "end": 804,
      "text": " which is probably in a similar space. Do you want to talk about that?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 804,
      "end": 809,
      "text": " It actually was since I've used Compose, but when I did use it, I was really pleased with how easy it was to get up and running."
    },
    {
      "speakerLabel": "spk_1",
      "start": 809,
      "end": 814,
      "text": " I was using it for MongoDB at the time. So it's also not target for hosting MongoDB."
    },
    {
      "speakerLabel": "spk_1",
      "start": 814,
      "end": 819,
      "text": " They also host lots of other databases like Postgres, MySQL."
    },
    {
      "speakerLabel": "spk_1",
      "start": 819,
      "end": 824,
      "text": " I think they also have things like Redis and Kafka. I'm not sure about Kafka, but they've got quite a few different options."
    },
    {
      "speakerLabel": "spk_1",
      "start": 824,
      "end": 830,
      "text": " So it's one to check out. They were acquired by IBM, like you say, so they're an IBM service now."
    },
    {
      "speakerLabel": "spk_1",
      "start": 830,
      "end": 834,
      "text": " And yeah, I just thought it was really seamless to get a MongoDB instance up and running."
    },
    {
      "speakerLabel": "spk_1",
      "start": 834,
      "end": 836,
      "text": " So it might be something else to look at."
    },
    {
      "speakerLabel": "spk_1",
      "start": 836,
      "end": 840,
      "text": " Maybe another one to mention finally on databases is Cloudflare."
    },
    {
      "speakerLabel": "spk_1",
      "start": 840,
      "end": 845,
      "text": " We might talk about Cloudflare seems to come up with new products very frequently these days."
    },
    {
      "speakerLabel": "spk_1",
      "start": 845,
      "end": 851,
      "text": " And one of the recent ones was they gave early access to their new relational database called D1."
    },
    {
      "speakerLabel": "spk_1",
      "start": 851,
      "end": 859,
      "text": " And I think the idea here is that if you're using a SQL, if you want SQL database and you're using Cloudflare workers,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 859,
      "end": 863,
      "text": " this is the solution that they are proposing. And it's an interesting one, right?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 863,
      "end": 868,
      "text": " It's a bit like Cloudflare workers. It was a different approach to serverless functions."
    },
    {
      "speakerLabel": "spk_1",
      "start": 868,
      "end": 875,
      "text": " This is a different approach to serverless databases as well, because it's actually built on top of SQLite as a database engine."
    },
    {
      "speakerLabel": "spk_1",
      "start": 875,
      "end": 878,
      "text": " So yeah, it would be very interesting to watch that. I haven't used it yet."
    },
    {
      "speakerLabel": "spk_1",
      "start": 878,
      "end": 881,
      "text": " I think it's still in early access, so you can sign up to the wait list."
    },
    {
      "speakerLabel": "spk_1",
      "start": 881,
      "end": 887,
      "text": " I'll wait to see what other people say first and take my guidance from them."
    },
    {
      "speakerLabel": "spk_1",
      "start": 887,
      "end": 891,
      "text": " So maybe slightly related, since we mentioned Kafka and Redis there a little bit,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 891,
      "end": 894,
      "text": " we covered this when we talked about event services."
    },
    {
      "speakerLabel": "spk_1",
      "start": 894,
      "end": 899,
      "text": " But you've also got things like Upstash for serverless Redis, which is really nice,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 899,
      "end": 904,
      "text": " and Confluent Cloud as well for Kafka and Upstash are doing Kafka as well."
    },
    {
      "speakerLabel": "spk_1",
      "start": 904,
      "end": 911,
      "text": " So those are definitely ones to check out if you're interested in Kafka and Redis."
    },
    {
      "speakerLabel": "spk_1",
      "start": 911,
      "end": 918,
      "text": " Since we were talking about databases, maybe it's a good idea to talk a little bit about the future direction of this."
    },
    {
      "speakerLabel": "spk_1",
      "start": 918,
      "end": 920,
      "text": " And I think this is something we've alluded to once or twice."
    },
    {
      "speakerLabel": "spk_1",
      "start": 920,
      "end": 927,
      "text": " We've got databases out there, but you still end up building what seems like the same crud code for every time you build an application."
    },
    {
      "speakerLabel": "spk_1",
      "start": 927,
      "end": 930,
      "text": " Everything seems to seem a little bit like a CMS at its heart."
    },
    {
      "speakerLabel": "spk_1",
      "start": 930,
      "end": 942,
      "text": " And I think we've mentioned things like Contentful, Firebase for headless CMSs, or even backend as a service."
    },
    {
      "speakerLabel": "spk_1",
      "start": 942,
      "end": 947,
      "text": " I always feel like this is the way the industry is going and should be going,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 947,
      "end": 951,
      "text": " but it's maybe not getting there quite as fast as I expected."
    },
    {
      "speakerLabel": "spk_1",
      "start": 951,
      "end": 959,
      "text": " I thought that maybe by 2022 more of us would be building systems on top of vendors that would provide just an API as a service,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 959,
      "end": 962,
      "text": " that we just give it our data, they give us an API back,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 962,
      "end": 971,
      "text": " and we don't have to worry too much about all the data access wiring and the query patterns and the optimization and the building indexes and normalization."
    },
    {
      "speakerLabel": "spk_1",
      "start": 971,
      "end": 974,
      "text": " But it still seems like we're still there, right?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 974,
      "end": 979,
      "text": " Especially if you adopt DynamoDB, it seems like people are actually getting deeper into the weeds now,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 979,
      "end": 984,
      "text": " and you have to gain a high level of proficiency with things like single table design to use it properly."
    },
    {
      "speakerLabel": "spk_1",
      "start": 984,
      "end": 990,
      "text": " But I think eventually we have to move away from that and start treating APIs as managed services,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 990,
      "end": 996,
      "text": " and maybe just build a definer schema and we get a GraphQL API and we don't know how it's stored anymore."
    },
    {
      "speakerLabel": "spk_1",
      "start": 996,
      "end": 999,
      "text": " What do you think? What are the alternatives out there? Is there anything that you can use today?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 999,
      "end": 1005,
      "text": " I think you make a very good point."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1005,
      "end": 1010,
      "text": " I agree that there was an explosion at some point a few years ago, I think about three or four years ago, of this kind of headless CMS."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1010,
      "end": 1017,
      "text": " And there was a lot of buzz around the jump stack and building static websites off of data managed by somebody else,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1017,
      "end": 1023,
      "text": " maybe in your team that is focused on content, and they will use this kind of CMS, static headless CMS UI,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1023,
      "end": 1029,
      "text": " while then you have developers using a build process to take all this data and build new versions of the website."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1029,
      "end": 1035,
      "text": " That seems to be the most likely future for building marketing web pages or product pages."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1035,
      "end": 1043,
      "text": " I agree with you that it doesn't feel like it has been adopted as much as we would have expected a few years ago."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1043,
      "end": 1047,
      "text": " That might change because I think there is still a big push for these companies,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1047,
      "end": 1053,
      "text": " and I think the market is starting to realize that there are many advantages in keeping your front end very simple and statically rendered,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1053,
      "end": 1058,
      "text": " while you still want to retain all the capabilities of managing data and changing things very quickly."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1058,
      "end": 1062,
      "text": " So I am still convinced that this is a good solution going forward."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1062,
      "end": 1068,
      "text": " But there is an interesting, I think, maybe it's an edge case, I'm not really sure,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1068,
      "end": 1076,
      "text": " but I think there are many cases where you want to build just a small website for even sometimes even for just a limited amount of time."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1076,
      "end": 1081,
      "text": " I'm thinking like, I don't know, event websites where, I don't know, for instance, like a conference,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1081,
      "end": 1086,
      "text": " where you want to showcase that this event is happening and there will be, let's say, speakers and people attending."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1086,
      "end": 1096,
      "text": " So there is some data to manage that and most likely want to use some sort of database to manage all the data as you keep building the whole event."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1096,
      "end": 1104,
      "text": " But at the same time, the website is going to be very simple so you can take advantage of statically rendering it and also do something like Netlify or Cell and so on."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1104,
      "end": 1110,
      "text": " And yeah, because most likely you're not going to have a very complex dataset,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1110,
      "end": 1118,
      "text": " I have seen cases and actually built something myself very successfully where you can use very simple data alternatives that are not really meant to be databases,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1118,
      "end": 1120,
      "text": " like, I don't know, a Google spreadsheet."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1120,
      "end": 1124,
      "text": " And because they offer APIs, you can just ask everything there in one page."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1124,
      "end": 1128,
      "text": " Most people would be comfortable enough with like inputting data there."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1128,
      "end": 1138,
      "text": " And then you can easily build an API, even just at build time, like if you have a static website, at build time you can just fetch the data through the API and use that as a mini database."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1138,
      "end": 1144,
      "text": " And if you don't like Google spreadsheet, because of course the APIs are not the most straightforward for this particular use case,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1144,
      "end": 1149,
      "text": " I think Airtable does kind of a better job in giving you slightly better APIs."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1149,
      "end": 1156,
      "text": " And also what I really like by Airtable is that when you open the document, you can really watch it in real time when new data comes in."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1156,
      "end": 1163,
      "text": " Like let's say that you also have a read-write pattern from the front end, maybe, I don't know, you're asking people, do you want to attend this event?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1163,
      "end": 1167,
      "text": " They can click a button and say yes and give you, I don't know, an email address or other information."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1167,
      "end": 1173,
      "text": " You can actually see in real time the data appearing in Airtable and there is like a nice highlight effect."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1173,
      "end": 1178,
      "text": " So it actually looks really nice then to use that as a back end to watch things changing."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1178,
      "end": 1185,
      "text": " And recently I had somebody mention that Notion is starting to put out APIs as well and they seem to be fairly good."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1185,
      "end": 1199,
      "text": " And because more and more people are using Notion as their own personal database for everything, I think that might become another alternative for simple cases to just use the data there, use the data through an API to build websites and experiences based on top of that data."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1199,
      "end": 1208,
      "text": " I like that. Yeah. I mean, I think Airtable was kind of designed almost as like an easy to use database with a spreadsheet kind of layer on top, wasn't it?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1208,
      "end": 1221,
      "text": " So I think it's a perfectly viable solution and it's good to see that going. I think maybe a few years ago there were a lot of companies building on top of Parse and Parse, it didn't end well because it ended up getting acquired and retired."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1221,
      "end": 1228,
      "text": " So a lot of people were left kind of hanging there. So maybe that's one of the reasons why this kind of thing didn't take off as it should."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1228,
      "end": 1233,
      "text": " People felt a little bit wounded. But I hope, I definitely hope there's options there in the future."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1233,
      "end": 1245,
      "text": " Maybe if we take it back to basics, at the start you mentioned a couple of things about the idea of getting into AWS and all the things you need to understand if you just want to get an EC2 instance up and running."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1245,
      "end": 1250,
      "text": " You can definitely do it quickly, but there's probably a lot you should be understanding, especially in terms of security and billing."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1250,
      "end": 1257,
      "text": " It's probably worth mentioning, we've covered DigitalOcean already. They've got a user experience that helps you get up and running pretty quickly there."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1257,
      "end": 1269,
      "text": " And there's other alternatives out there like Linode. And the idea with any of those specialists kind of providing simple instances, very well providers, is that you get more predictable cost generally."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1269,
      "end": 1282,
      "text": " And it's very easy to see what you're getting, to understand it, and there's not a lot of complexity with it because it's just, they're essentially just providing those basic elements for you and they're not trying to do 200 other services along with it like AWS."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1282,
      "end": 1290,
      "text": " Yeah, absolutely. I actually used Linode to host the website for my first startup. This was like seven years ago, I think now."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1290,
      "end": 1297,
      "text": " And at the time I didn't really know much about, OK, how do you run your own servers? How do you host products on a server and put them online?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1297,
      "end": 1302,
      "text": " I have to admit, I was quite scared about doing all of that. We were looking for like a sysadmin to help us."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1302,
      "end": 1310,
      "text": " But because we were a startup with a small budget, we couldn't afford that. And eventually we were like, OK, let's just eat the bullet and try to do it ourselves and see where we end up."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1310,
      "end": 1317,
      "text": " And I was actually very pleased. And this was already like seven years ago. So I assume now the experience is like much, much better."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1317,
      "end": 1323,
      "text": " How easy it was to really understand what were the building blocks? How do you start to create an instance? How do you provision software on that instance?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1323,
      "end": 1330,
      "text": " Then you have a very nice dashboard that allows you to see what are the performances that any bottleneck should increase something."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1330,
      "end": 1336,
      "text": " Is disk read and writing doing OK? Is network doing OK? And I really enjoyed that experience."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1336,
      "end": 1340,
      "text": " And I think at the end that the server was actually doing quite well, even in terms of performance."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1340,
      "end": 1348,
      "text": " And it was relatively cheap because we did go with a kind of a medium instance and one instance was good enough for that particular startup."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1348,
      "end": 1353,
      "text": " So it was very nice also for us started with a very small budget to have very predictable costs."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1353,
      "end": 1362,
      "text": " I think we were paying something like fifty dollars a month. So that was giving us a lot of confidence that that solution would be good enough for us in that period of time."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1362,
      "end": 1367,
      "text": " I think it's great to have that level of competition there. It's important that AWS doesn't completely run away with the market."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1367,
      "end": 1377,
      "text": " And maybe on that topic, we do see some services aiming to come in and replace or give a viable alternative to specific AWS services and being API compatible."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1377,
      "end": 1385,
      "text": " So one example of that is, again, Cloudflare, who introduced with a lot of fanfare, which is a replacement for S3."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1385,
      "end": 1391,
      "text": " So it's an API compatible drop in replacement. And one of the standard features of that was its pricing."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1391,
      "end": 1401,
      "text": " So the pricing, especially for data ingestion, sorry, for data extract, was vastly superior to Amazon's."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1401,
      "end": 1407,
      "text": " Amazon actually followed up with a significant change to the free tier for S3."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1407,
      "end": 1416,
      "text": " But they've also got workers. So as an alternative, perhaps, although they're slightly different to Lambda functions, you've got Cloudflare workers and they've got a database storage there as well."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1416,
      "end": 1422,
      "text": " So workers KV, it's called, key value store. So it might be kind of an alternative to DynamoDB global tables."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1422,
      "end": 1431,
      "text": " I think it's great to see that competition, especially if they're pushing AWS on price or features or performance, because it keeps them on their toes and it keeps everybody innovating, I hope."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1431,
      "end": 1442,
      "text": " So what do you think there? Would you be keen to adopt or to instead of S3, do you think, or other services that are just drop in replacements for AWS services?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1442,
      "end": 1452,
      "text": " Yeah, that's a good question. I have to admit that my experience with Cloudflare is kind of a little bit conflicted because there are things that I really like, like how easy it is to set up the CDN."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1452,
      "end": 1466,
      "text": " For instance, when you're building a static website hosted in GitHub pages, you can literally set up the integration with Cloudflare if you want that extra level of CDN and more configuration in terms of DNS and so on in literally minutes."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1466,
      "end": 1477,
      "text": " And it works really well. And most of the time it's going to be free because for most use cases, you don't even need to go and pay for the other, for the kind of the custom enterprise plan."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1477,
      "end": 1483,
      "text": " But when it comes to these other new services, I found the last time I tried to use them was probably six months ago."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1483,
      "end": 1489,
      "text": " So I hope now has improved. But I found that UI was a little bit confusing. It was a little bit complex to understand."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1489,
      "end": 1498,
      "text": " Okay, what if I want to invite people to help me with this project? And then do I need to switch to from a personal plan to an enterprise plan?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1498,
      "end": 1505,
      "text": " And then it seems that if you want to do that, you can. But there is no easy migration of your plan, or at least there wasn't."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1505,
      "end": 1514,
      "text": " So I think they still need to get the whole developer experience in terms of transforming Cloudflare from a CDN company to a more like cloud offering company."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1514,
      "end": 1521,
      "text": " I think there is work to do there, but definitely I love to see all the new products that they are pushing and to see that they are quite different from their territory."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1521,
      "end": 1524,
      "text": " So they're trying to innovate in the market and also that they are competing on price."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1524,
      "end": 1529,
      "text": " So I really love to see what is going to come out from Cloudflare in the near future."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1529,
      "end": 1533,
      "text": " And I think it's going to become a more and more prominent competitor in the cloud space."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1540,
      "end": 1554,
      "text": " If other people out there have seen third party services which they use instead of something we maybe you take for granted in AWS, we'd love to hear about it because we're definitely keen to explore other options, especially if it helps us achieve that kind of serverless vision where you're just offloading more and more effort to a cloud provider and just getting started in a very, very simple way."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1554,
      "end": 1558,
      "text": " That was great to talk through those. We'd love to hear your ideas. Thanks for listening."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1558,
      "end": 1565,
      "text": " Continue to listen to AWS Bites and follow us and subscribe to the YouTube channel and share the podcast with your friends and rate it and everything."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1565,
      "end": 1570,
      "text": " We really appreciate having you here with us and we'll see you in the next episode. Goodbye."
    }
  ]
}