{
 "speakers": {
  "spk_0": "spk_0",
  "spk_1": "spk_1"
 },
 "segments": [
  {
   "speakerLabel": "spk_0",
   "start": 0,
   "end": 14.16,
   "text": " Hello everyone and welcome to another episode of AWS Bites, the show where we discuss interesting"
  },
  {
   "speakerLabel": "spk_0",
   "start": 14.16,
   "end": 20.22,
   "text": " AWS questions in about five minutes. My name is Luciano Mamineo and today I am with Eoin"
  },
  {
   "speakerLabel": "spk_0",
   "start": 20.22,
   "end": 26.34,
   "text": " Shanaghi and the question of the day, it's a very interesting one, is what are your favorite"
  },
  {
   "speakerLabel": "spk_0",
   "start": 26.34,
   "end": 34.12,
   "text": " AWS services? So Eoin, if you should pick like your top three favorite services, what would"
  },
  {
   "speakerLabel": "spk_0",
   "start": 34.12,
   "end": 35.12,
   "text": " you pick?"
  },
  {
   "speakerLabel": "spk_0",
   "start": 35.12,
   "end": 42.6,
   "text": " Okay, so it's not an easy decision, but I've given this one some thought."
  },
  {
   "speakerLabel": "spk_1",
   "start": 42.6,
   "end": 50.28,
   "text": " For number three, I'm going to go with EventBridge and EventBridge is reasonably new. It came, it kind of spawned"
  },
  {
   "speakerLabel": "spk_1",
   "start": 50.28,
   "end": 55.84,
   "text": " out of a rebranded version of CloudWatch Events, but you got a lot of options for messaging"
  },
  {
   "speakerLabel": "spk_1",
   "start": 55.84,
   "end": 63.260000000000005,
   "text": " on AWS, SQS, SNS, they're all really good services, Kinesis also for streaming. I could"
  },
  {
   "speakerLabel": "spk_1",
   "start": 63.260000000000005,
   "end": 67.24000000000001,
   "text": " have gone with either of those really, but EventBridge for me is really good because"
  },
  {
   "speakerLabel": "spk_1",
   "start": 67.24000000000001,
   "end": 72.32000000000001,
   "text": " it's like the most serverless of services almost. There's so little to configure, you"
  },
  {
   "speakerLabel": "spk_1",
   "start": 72.32000000000001,
   "end": 76.60000000000001,
   "text": " can start publishing messages to it without provisioning anything and then you just create"
  },
  {
   "speakerLabel": "spk_1",
   "start": 76.60000000000001,
   "end": 81.80000000000001,
   "text": " rules with nice pattern matching if you want to consume these events. So that's why I've"
  },
  {
   "speakerLabel": "spk_1",
   "start": 81.8,
   "end": 86.32,
   "text": " gone for EventBridge and I think it's a really popular service and gaining more and more"
  },
  {
   "speakerLabel": "spk_1",
   "start": 86.32,
   "end": 87.84,
   "text": " traction."
  },
  {
   "speakerLabel": "spk_1",
   "start": 87.84,
   "end": 91.72,
   "text": " Number two, I'm going to go for Lambda. A lot of people might've expected I'd go for"
  },
  {
   "speakerLabel": "spk_1",
   "start": 91.72,
   "end": 98.52,
   "text": " it as number one, but I think we're going to see a lot more improvements to Lambda in"
  },
  {
   "speakerLabel": "spk_1",
   "start": 98.52,
   "end": 104.12,
   "text": " the coming years. It's already quite different than when it first launched. It really threw"
  },
  {
   "speakerLabel": "spk_1",
   "start": 104.12,
   "end": 110.4,
   "text": " out the rule book for how you do compute in the cloud and it's so scalable. It has so"
  },
  {
   "speakerLabel": "spk_1",
   "start": 110.4,
   "end": 114.28,
   "text": " many integrations into other services and because of how it runs, it's really easy to"
  },
  {
   "speakerLabel": "spk_1",
   "start": 114.28,
   "end": 120.44000000000001,
   "text": " monitor secure things and individual function level and scale things at a really fine grain"
  },
  {
   "speakerLabel": "spk_1",
   "start": 120.44000000000001,
   "end": 126.36000000000001,
   "text": " level. It's got an amazing number of features these days and I think it will really take"
  },
  {
   "speakerLabel": "spk_1",
   "start": 126.36000000000001,
   "end": 133.92000000000002,
   "text": " over compute into the future, especially if the pricing model changes to support longer"
  },
  {
   "speakerLabel": "spk_1",
   "start": 133.92000000000002,
   "end": 138.96,
   "text": " kind of more long running computational workloads. So that's number two."
  },
  {
   "speakerLabel": "spk_1",
   "start": 138.96,
   "end": 145.4,
   "text": " And then for my number one, probably not the most popular choice, but I think it's fundamental"
  },
  {
   "speakerLabel": "spk_1",
   "start": 145.4,
   "end": 153.24,
   "text": " if you're doing AWS in any really serious way and that's cloud formation. Continuous"
  },
  {
   "speakerLabel": "spk_1",
   "start": 153.24,
   "end": 158.08,
   "text": " deployment in the cloud is a must have and how you manage your deployments and your cloud"
  },
  {
   "speakerLabel": "spk_1",
   "start": 158.08,
   "end": 164.20000000000002,
   "text": " resources is really critical to how that works. So that means the features that cloud formation"
  },
  {
   "speakerLabel": "spk_1",
   "start": 164.2,
   "end": 169.39999999999998,
   "text": " gives you that other options don't give you like the ability to manage a stack as kind"
  },
  {
   "speakerLabel": "spk_1",
   "start": 169.39999999999998,
   "end": 174.88,
   "text": " of almost an atomic unit. You've got a collection of resources that AWS is going to deploy for"
  },
  {
   "speakerLabel": "spk_1",
   "start": 174.88,
   "end": 180.48,
   "text": " you based on added character template. Then you've got stack sets so you can see the different"
  },
  {
   "speakerLabel": "spk_1",
   "start": 180.48,
   "end": 185.39999999999998,
   "text": " change sets so you can see you can break things down into logical structures. You can see"
  },
  {
   "speakerLabel": "spk_1",
   "start": 185.39999999999998,
   "end": 192,
   "text": " how things will change before you deploy. It's very easy to underestimate the value"
  },
  {
   "speakerLabel": "spk_1",
   "start": 192,
   "end": 196.16,
   "text": " that cloud formation can bring to the table and it really gives you a lot of confidence"
  },
  {
   "speakerLabel": "spk_1",
   "start": 196.16,
   "end": 202.6,
   "text": " in your deployments. So those are my top three. What about you, Luciano? Are you going to"
  },
  {
   "speakerLabel": "spk_1",
   "start": 202.6,
   "end": 207.06,
   "text": " go for three completely different ones?"
  },
  {
   "speakerLabel": "spk_0",
   "start": 207.06,
   "end": 212.2,
   "text": " Yeah, I'll try to differentiate, but I'm glad that you mentioned cloud formation because it's an interesting one for me. I used to,"
  },
  {
   "speakerLabel": "spk_0",
   "start": 212.2,
   "end": 218.28,
   "text": " I don't want to say hate, but I'm going to say dislike cloud formation and I rather prefer"
  },
  {
   "speakerLabel": "spk_0",
   "start": 218.28,
   "end": 223.88,
   "text": " to use Terraform every chance I got. And I think it's just because of the syntax. Like"
  },
  {
   "speakerLabel": "spk_0",
   "start": 223.88,
   "end": 230.28,
   "text": " I found Terraform to be much more user-friendly and simple to understand and write. So in"
  },
  {
   "speakerLabel": "spk_0",
   "start": 230.28,
   "end": 235.16,
   "text": " the past I did use a lot of Terraform. Although I can see the value in cloud formation because"
  },
  {
   "speakerLabel": "spk_0",
   "start": 235.16,
   "end": 240.72,
   "text": " once you try to deploy with cloud formation, everything is done by AWS. Like you don't"
  },
  {
   "speakerLabel": "spk_0",
   "start": 240.72,
   "end": 244.92000000000002,
   "text": " need to manage your own secrets, your own state, which is something you have to take"
  },
  {
   "speakerLabel": "spk_0",
   "start": 244.92,
   "end": 249.78,
   "text": " care if you use Terraform. So I'm going to pick CDK, even though it's"
  },
  {
   "speakerLabel": "spk_0",
   "start": 249.78,
   "end": 255.72,
   "text": " not really a service, it's more of a tool that you get from AWS to use cloud formation."
  },
  {
   "speakerLabel": "spk_0",
   "start": 255.72,
   "end": 261.36,
   "text": " I'm cheating a little bit, but please allow me that because CDK, I found it to be like"
  },
  {
   "speakerLabel": "spk_0",
   "start": 261.36,
   "end": 266.91999999999996,
   "text": " the nice middle ground. Like you still get a very good experience in writing your infrastructure"
  },
  {
   "speakerLabel": "spk_0",
   "start": 266.91999999999996,
   "end": 273.12,
   "text": " as code, probably even better than Terraform, but again, take it as an opinion. But at the"
  },
  {
   "speakerLabel": "spk_0",
   "start": 273.12,
   "end": 278.18,
   "text": " same time, you get all the advantages of cloud formation because CDK will generate cloud"
  },
  {
   "speakerLabel": "spk_0",
   "start": 278.18,
   "end": 283.8,
   "text": " formation code for you. So at the end of the day, you also get all the benefits of that."
  },
  {
   "speakerLabel": "spk_0",
   "start": 283.8,
   "end": 290.88,
   "text": " So CDK, probably one of my three favorite services that I want to mention. The other"
  },
  {
   "speakerLabel": "spk_0",
   "start": 290.88,
   "end": 296.06,
   "text": " one is S3, which probably a little bit obvious, but the reason why I wanted to mention it"
  },
  {
   "speakerLabel": "spk_0",
   "start": 296.06,
   "end": 302.24,
   "text": " is because I have seen that it's kind of the entry point for many, many companies to AWS"
  },
  {
   "speakerLabel": "spk_0",
   "start": 302.24,
   "end": 309.36,
   "text": " and the cloud in general. It might seem surprising today that so many companies start to think"
  },
  {
   "speakerLabel": "spk_0",
   "start": 309.36,
   "end": 313.72,
   "text": " about the cloud when they think, okay, what are we going to do with all these files? Like"
  },
  {
   "speakerLabel": "spk_0",
   "start": 313.72,
   "end": 319.06,
   "text": " we don't trust our disks and our backups anymore. What do we do? How do we make them highly"
  },
  {
   "speakerLabel": "spk_0",
   "start": 319.06,
   "end": 325.04,
   "text": " available and resilient? And S3 then becomes kind of the gateway to the cloud for them."
  },
  {
   "speakerLabel": "spk_0",
   "start": 325.04,
   "end": 329.66,
   "text": " So definitely want to give it a shout out, even though it's, I think one of the oldest"
  },
  {
   "speakerLabel": "spk_0",
   "start": 329.66,
   "end": 336.48,
   "text": " services together with EC2 and has been there for a while. So maybe not unused, but still"
  },
  {
   "speakerLabel": "spk_0",
   "start": 336.48,
   "end": 343.08000000000004,
   "text": " very, very well-worked service to mention. And the last one I want to mention is ECS"
  },
  {
   "speakerLabel": "spk_0",
   "start": 343.08000000000004,
   "end": 348.72,
   "text": " and Fargate, which I will depict Lambda if you didn't do that already, but I've seen"
  },
  {
   "speakerLabel": "spk_0",
   "start": 348.72,
   "end": 355.52000000000004,
   "text": " that ECS and Fargate are very good replacement for Lambda, especially in cases where you"
  },
  {
   "speakerLabel": "spk_0",
   "start": 355.52,
   "end": 360.47999999999996,
   "text": " have an application that has been built for a number of years, maybe even before the cloud,"
  },
  {
   "speakerLabel": "spk_0",
   "start": 360.47999999999996,
   "end": 364.59999999999997,
   "text": " and you are trying to figure out, okay, what is the fastest and easiest way for me to bring"
  },
  {
   "speakerLabel": "spk_0",
   "start": 364.59999999999997,
   "end": 369.35999999999996,
   "text": " that application to the cloud? And if you know a little bit of Docker and you can write"
  },
  {
   "speakerLabel": "spk_0",
   "start": 369.35999999999996,
   "end": 375.76,
   "text": " a container for that application, ECS and Fargate will allow you to rather quickly deploy"
  },
  {
   "speakerLabel": "spk_0",
   "start": 375.76,
   "end": 381.64,
   "text": " all of that in the cloud. So another thing that kind of goes in tandem with my first"
  },
  {
   "speakerLabel": "spk_0",
   "start": 381.64,
   "end": 387.68,
   "text": " choice CDK is that I didn't like as much ECS and Fargate before CDK, because there is,"
  },
  {
   "speakerLabel": "spk_0",
   "start": 387.68,
   "end": 393.59999999999997,
   "text": " again, a lot of configuration you need to write, but with CDK, you get this library"
  },
  {
   "speakerLabel": "spk_0",
   "start": 393.59999999999997,
   "end": 399.76,
   "text": " of higher level constructs, which are called ECS patterns, and those will make your life"
  },
  {
   "speakerLabel": "spk_0",
   "start": 399.76,
   "end": 405.47999999999996,
   "text": " much, much simpler. Like you really need to write a very minimal amount of configuration."
  },
  {
   "speakerLabel": "spk_0",
   "start": 405.47999999999996,
   "end": 409.52,
   "text": " Of course, there are a lot of assumptions that are baked in in these patterns, but for"
  },
  {
   "speakerLabel": "spk_0",
   "start": 409.52,
   "end": 416.91999999999996,
   "text": " most use cases, you'll be able to ship things to production very quickly. So those are my"
  },
  {
   "speakerLabel": "spk_0",
   "start": 416.91999999999996,
   "end": 422.76,
   "text": " three picks. Is there anything you think is also worth a mention? Maybe let's do some"
  },
  {
   "speakerLabel": "spk_0",
   "start": 422.76,
   "end": 424.4,
   "text": " honorable mentions."
  },
  {
   "speakerLabel": "spk_1",
   "start": 424.4,
   "end": 433.18,
   "text": " Yeah, what didn't quite make the list? Yeah, I'm with you on S3 for sure is just outstanding"
  },
  {
   "speakerLabel": "spk_1",
   "start": 433.18,
   "end": 438.71999999999997,
   "text": " in what it can deliver. Yeah, I think one of the honorable mentions I'd have to mention"
  },
  {
   "speakerLabel": "spk_1",
   "start": 438.72,
   "end": 443.12,
   "text": " is CloudWatch, and this is another one that kind of flies under the radar quite a lot"
  },
  {
   "speakerLabel": "spk_1",
   "start": 443.12,
   "end": 449.08000000000004,
   "text": " because it's been there for a long time, but there's actually a constantly growing number"
  },
  {
   "speakerLabel": "spk_1",
   "start": 449.08000000000004,
   "end": 453.96000000000004,
   "text": " of components to CloudWatch. And over the last couple of years, I've found myself using"
  },
  {
   "speakerLabel": "spk_1",
   "start": 453.96000000000004,
   "end": 461.66,
   "text": " CloudWatch logs insights, like to do powerful distributed log querying really frequently"
  },
  {
   "speakerLabel": "spk_1",
   "start": 461.66,
   "end": 467.16,
   "text": " without having to go to third parties for decentralized logging solutions. But we also"
  },
  {
   "speakerLabel": "spk_1",
   "start": 467.16,
   "end": 473,
   "text": " use metrics and alarms. I think CloudWatch can be really powerful for creating your own"
  },
  {
   "speakerLabel": "spk_1",
   "start": 473,
   "end": 479.24,
   "text": " customer application metrics and alarms as well. And with the right setup, you can go"
  },
  {
   "speakerLabel": "spk_1",
   "start": 479.24,
   "end": 484.40000000000003,
   "text": " really far with it. And we should probably also mention the open source project we've"
  },
  {
   "speakerLabel": "spk_1",
   "start": 484.40000000000003,
   "end": 489.34000000000003,
   "text": " been working on called SlickWatch, which allows you to create a lot of those resources automatically"
  },
  {
   "speakerLabel": "spk_1",
   "start": 489.34000000000003,
   "end": 495.40000000000003,
   "text": " for your applications. So I'd give CloudWatch as my honorable mention. What about you, Luciano?"
  },
  {
   "speakerLabel": "spk_1",
   "start": 495.4,
   "end": 498.64,
   "text": " Do you have another one? Yeah, that's a good one."
  },
  {
   "speakerLabel": "spk_0",
   "start": 498.64,
   "end": 504.79999999999995,
   "text": " I'm going to just mention really quickly IAM because it's one of those unescapable services that you need"
  },
  {
   "speakerLabel": "spk_0",
   "start": 504.79999999999995,
   "end": 511.4,
   "text": " to learn. Again, not the easiest. Initially, I had a little bit of love and hate relationship"
  },
  {
   "speakerLabel": "spk_0",
   "start": 511.4,
   "end": 516.4,
   "text": " with it, but once you understand the building blocks and how well integrated it is with"
  },
  {
   "speakerLabel": "spk_0",
   "start": 516.4,
   "end": 521.92,
   "text": " every single service, then yeah, you really get the value out of it and it's something"
  },
  {
   "speakerLabel": "spk_0",
   "start": 521.92,
   "end": 527.0799999999999,
   "text": " you really need to use, you cannot avoid. So definitely a good service. If you haven't"
  },
  {
   "speakerLabel": "spk_0",
   "start": 527.0799999999999,
   "end": 532.1999999999999,
   "text": " paid too much attention to it, I would encourage you to have a second look and try to understand"
  },
  {
   "speakerLabel": "spk_0",
   "start": 532.1999999999999,
   "end": 538.4,
   "text": " better all the different concepts around it. And with that, I think we are at time for"
  },
  {
   "speakerLabel": "spk_0",
   "start": 538.4,
   "end": 543.68,
   "text": " today. So thank you very much for following us. I'm really curious to know what are your"
  },
  {
   "speakerLabel": "spk_0",
   "start": 543.68,
   "end": 548.88,
   "text": " favorite services. So if you want to leave us a comment or connect with us on Twitter,"
  },
  {
   "speakerLabel": "spk_0",
   "start": 548.88,
   "end": 555.24,
   "text": " please send us your top three and we'll probably make some statistics with that. That will"
  },
  {
   "speakerLabel": "spk_0",
   "start": 555.24,
   "end": 560.4399999999999,
   "text": " be an interesting experiment. So thank you very much. Make sure to follow us and give"
  },
  {
   "speakerLabel": "spk_0",
   "start": 560.4399999999999,
   "end": 566.56,
   "text": " us a like, thumbs up, follow us in your favorite podcast software and we'll see you at the"
  },
  {
   "speakerLabel": "spk_0",
   "start": 566.56,
   "end": 582.52,
   "text": " next episode. Bye."
  }
 ]
}