{
  "speakers": {
    "spk_0": "Luciano",
    "spk_1": "Eoin"
  },
  "segments": [
    {
      "speakerLabel": "spk_0",
      "start": 0,
      "end": 5,
      "text": " The World Wide Web could have been something great, something to move humanity forward."
    },
    {
      "speakerLabel": "spk_0",
      "start": 5,
      "end": 11,
      "text": " Instead, it turned out to be a place where we spend our time slacking off and looking at cat pictures and videos."
    },
    {
      "speakerLabel": "spk_0",
      "start": 11,
      "end": 16,
      "text": " But honestly, that's actually cool. We can actually use it to our advantage."
    },
    {
      "speakerLabel": "spk_0",
      "start": 16,
      "end": 21,
      "text": " And yes, I promise you, we can learn about AWS while having fun with kitties."
    },
    {
      "speakerLabel": "spk_0",
      "start": 21,
      "end": 32,
      "text": " This is Luciano and Eoin and another episode of AWS Bites podcast for you."
    },
    {
      "speakerLabel": "spk_0",
      "start": 32,
      "end": 41,
      "text": " OK, after this intro, I feel that I need to be a little bit more serious, but we really want to talk about AWS and ways that you can actually learn more about AWS."
    },
    {
      "speakerLabel": "spk_0",
      "start": 41,
      "end": 49,
      "text": " And we believe that you should be building projects on AWS to actually learn really what it takes to be successful with AWS."
    },
    {
      "speakerLabel": "spk_0",
      "start": 49,
      "end": 54,
      "text": " And of course, when you build projects, we can also have fun. So we can build projects that involve kitties."
    },
    {
      "speakerLabel": "spk_0",
      "start": 54,
      "end": 69,
      "text": " And we have actually prepared a list with four different project ideas that you can build on AWS so that you can practice different skills, different architectures and grow in parts like application development, data science, DevOps and even machine learning."
    },
    {
      "speakerLabel": "spk_0",
      "start": 69,
      "end": 84,
      "text": " Again, this is just in the idea that on one side it's good to know the theory, maybe get some certification, but you really need to put those skills into practice if you really want to remember and learn deeply what it takes to build applications and projects on AWS."
    },
    {
      "speakerLabel": "spk_0",
      "start": 84,
      "end": 89,
      "text": " Before we get into the first project, I want to mention that AWS Bites is sponsored by fourTheorem."
    },
    {
      "speakerLabel": "spk_0",
      "start": 89,
      "end": 96,
      "text": " fourTheorem is an AWS consulting partner that offers training, cloud migrations and modern application architecture."
    },
    {
      "speakerLabel": "spk_0",
      "start": 96,
      "end": 101,
      "text": " You can find out more at fourtheorem.com and there will be a link in the show notes."
    },
    {
      "speakerLabel": "spk_0",
      "start": 101,
      "end": 107,
      "text": " Okay, with that being said, Eoin, what do you think? Should we start to discuss the first project?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 107,
      "end": 115,
      "text": " Yeah, the first project I really like and it's one that our colleague Peter Elger came up with for the book that I co-wrote with him, AI as a Service."
    },
    {
      "speakerLabel": "spk_1",
      "start": 115,
      "end": 127,
      "text": " And it's a cat detector project and it's a good bit of fun, but it's actually a really good learning one for people who are getting into AWS and maybe exploring some of the newer capabilities that you have there."
    },
    {
      "speakerLabel": "spk_1",
      "start": 127,
      "end": 133,
      "text": " Things like serverless technology, infrastructure as code, but also some of the machine learning services."
    },
    {
      "speakerLabel": "spk_1",
      "start": 133,
      "end": 143,
      "text": " And you do not have to be, like this might be useful for people interested in machine learning or computer vision, but it's certainly not a prerequisite that you have to have any specialty there."
    },
    {
      "speakerLabel": "spk_1",
      "start": 143,
      "end": 148,
      "text": " That's the whole point of these managed machine learning services that anybody can use them for use cases like this."
    },
    {
      "speakerLabel": "spk_1",
      "start": 148,
      "end": 155,
      "text": " So obviously the use case here is a really critically important one that is detecting pictures of cats on the internet."
    },
    {
      "speakerLabel": "spk_1",
      "start": 155,
      "end": 158,
      "text": " So let me talk through briefly how this works."
    },
    {
      "speakerLabel": "spk_1",
      "start": 158,
      "end": 168,
      "text": " So there's a couple of services here, right? It uses things like AWS Lambda, SQS, Rekognition, that's the machine learning service, and API Gateway as well as S3."
    },
    {
      "speakerLabel": "spk_1",
      "start": 168,
      "end": 173,
      "text": " And it shows you how to build up this architecture slowly piece by piece."
    },
    {
      "speakerLabel": "spk_1",
      "start": 173,
      "end": 180,
      "text": " Now we've got a workshop as well. So there is a GitHub repo with a workshop that goes through this step by step."
    },
    {
      "speakerLabel": "spk_1",
      "start": 180,
      "end": 185,
      "text": " You can have a look at the book if you want to, but you can just follow the workshop as well and you can see the code."
    },
    {
      "speakerLabel": "spk_1",
      "start": 185,
      "end": 197,
      "text": " So it brings it through fairly step by step. And it's not a particularly complicated architecture, but it shows you a couple of things like event driven communication over SQS, as well as showing you how Rekognition works."
    },
    {
      "speakerLabel": "spk_1",
      "start": 197,
      "end": 201,
      "text": " And the Rekognition part is actually quite simple. Everything is really managed for you."
    },
    {
      "speakerLabel": "spk_1",
      "start": 201,
      "end": 209,
      "text": " So what this application does is it allows you to bring up a front end, very simple web page where you can enter a URL."
    },
    {
      "speakerLabel": "spk_1",
      "start": 209,
      "end": 218,
      "text": " We'll go off to that URL in Lambda, pull down the HTML, find images on that web page, and then we'll take the images and put them on S3."
    },
    {
      "speakerLabel": "spk_1",
      "start": 218,
      "end": 222,
      "text": " And then we'll submit the images to Rekognition and it will identify objects in that."
    },
    {
      "speakerLabel": "spk_1",
      "start": 222,
      "end": 227,
      "text": " And then the back end will also kind of generate a word cloud based on the objects detected in the image."
    },
    {
      "speakerLabel": "spk_1",
      "start": 227,
      "end": 236,
      "text": " So hopefully cats. And it will also like generate, use the confidence of objects that it has found to generate that word cloud."
    },
    {
      "speakerLabel": "spk_1",
      "start": 236,
      "end": 243,
      "text": " So then in the front end, it'll be able to render the image and what it's found. So hopefully you'll see cat and you might even see things like the breed of cat as well."
    },
    {
      "speakerLabel": "spk_1",
      "start": 243,
      "end": 252,
      "text": " So this is something you could probably work through in a couple of hours. I know Peter and myself have presented this workshop at various conferences and things."
    },
    {
      "speakerLabel": "spk_1",
      "start": 252,
      "end": 260,
      "text": " And it only takes a couple of hours to get through. I think it's really nice one to just get a feel for what modern application development is like on AWS."
    },
    {
      "speakerLabel": "spk_1",
      "start": 260,
      "end": 268,
      "text": " Yeah, I really like this one. I remember that I saw a similar one. There is a website called Kaggle.com where you can find interesting datasets."
    },
    {
      "speakerLabel": "spk_0",
      "start": 268,
      "end": 274,
      "text": " And one of the datasets, we'll put the link in the show notes, is basically a dataset where you have pictures of cats and dogs."
    },
    {
      "speakerLabel": "spk_0",
      "start": 274,
      "end": 279,
      "text": " And basically you can use that idea to try to build a classifier and distinguish between the two."
    },
    {
      "speakerLabel": "spk_0",
      "start": 279,
      "end": 286,
      "text": " So there could be an alternative project that you can build to try to develop the same skills of the project we just mentioned."
    },
    {
      "speakerLabel": "spk_0",
      "start": 286,
      "end": 293,
      "text": " But moving on to project number two, what you could build is HTTP cat clone."
    },
    {
      "speakerLabel": "spk_0",
      "start": 293,
      "end": 299,
      "text": " And if you don't know HTTP cat or HTTP dot cat, that's literally my favorite website ever."
    },
    {
      "speakerLabel": "spk_0",
      "start": 299,
      "end": 308,
      "text": " And it's basically a website that is built to make sure that you easily remember what is the meaning of HTTP status code."
    },
    {
      "speakerLabel": "spk_0",
      "start": 308,
      "end": 315,
      "text": " So if you really want to have a quick feeling, what does that mean? Can you remember what is the meaning of the status code for one eight?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 315,
      "end": 320,
      "text": " I can never remember. You always find it referenced everywhere because it's kind of a web joke."
    },
    {
      "speakerLabel": "spk_0",
      "start": 320,
      "end": 325,
      "text": " So if you just want to find out, just go to HTTP dot cat slash four one eight."
    },
    {
      "speakerLabel": "spk_0",
      "start": 325,
      "end": 333,
      "text": " And what happens is that you will get a funny picture with a cat. But that picture also describes the meaning of the four one eight HTTP status code."
    },
    {
      "speakerLabel": "spk_0",
      "start": 333,
      "end": 342,
      "text": " So the idea is, OK, what would it take to try to rebuild the same website, literally a clone of this website by using AWS?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 342,
      "end": 347,
      "text": " And I have at least three different solutions in mind and we can talk through them."
    },
    {
      "speakerLabel": "spk_0",
      "start": 347,
      "end": 354,
      "text": " And I think every different solution tries to exercise different architectures and different services you can use in AWS."
    },
    {
      "speakerLabel": "spk_0",
      "start": 354,
      "end": 359,
      "text": " So I'm not going to be mandating which one is better. I think they are all equally viable."
    },
    {
      "speakerLabel": "spk_0",
      "start": 359,
      "end": 365,
      "text": " It's going to be more on you to decide which kind of tools we want to practice with and then maybe pick one approach or the other."
    },
    {
      "speakerLabel": "spk_0",
      "start": 365,
      "end": 371,
      "text": " So the first approach would be we could build this website literally as a static website."
    },
    {
      "speakerLabel": "spk_0",
      "start": 371,
      "end": 376,
      "text": " At the end of the day, there isn't really anything dynamic. It's just a collection of pictures mainly."
    },
    {
      "speakerLabel": "spk_0",
      "start": 376,
      "end": 387,
      "text": " But we have some HTML and CSS. So once you create all of that and you can use any static site generator, for instance, like Astro 11, whatever you like."
    },
    {
      "speakerLabel": "spk_0",
      "start": 387,
      "end": 395,
      "text": " There are hundreds of them at this stage. You will be able to eventually will have a collection of assets, HTML, CSS, images."
    },
    {
      "speakerLabel": "spk_0",
      "start": 395,
      "end": 402,
      "text": " So you need to figure out, OK, how do I put this asset into production so that I can have a public URL that other people can visit?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 402,
      "end": 407,
      "text": " And one of the simplest solutions is you could be hosting all these assets in S3."
    },
    {
      "speakerLabel": "spk_0",
      "start": 407,
      "end": 411,
      "text": " So that becomes kind of your place where you put all the files."
    },
    {
      "speakerLabel": "spk_0",
      "start": 411,
      "end": 415,
      "text": " But then you need to figure out a way to serve all these files as a website."
    },
    {
      "speakerLabel": "spk_0",
      "start": 415,
      "end": 419,
      "text": " And with S3, you can easily enable a feature that is called S3 websites."
    },
    {
      "speakerLabel": "spk_0",
      "start": 419,
      "end": 425,
      "text": " But that feature, although it works and for a website like this, it might be just enough, it doesn't support HTTPS."
    },
    {
      "speakerLabel": "spk_0",
      "start": 425,
      "end": 431,
      "text": " So if you also want to test how to make a static website and serve it over HTTPS, you can also use CloudFront."
    },
    {
      "speakerLabel": "spk_0",
      "start": 431,
      "end": 438,
      "text": " And serve the website through CloudFront, which also gives you additional advantages because CloudFront is a CDN."
    },
    {
      "speakerLabel": "spk_0",
      "start": 438,
      "end": 443,
      "text": " So you are actually replicating all these assets around the world and reducing the latency with the actual users."
    },
    {
      "speakerLabel": "spk_0",
      "start": 443,
      "end": 448,
      "text": " So that could be approach number one, a static website, S3 and optionally CloudFront."
    },
    {
      "speakerLabel": "spk_0",
      "start": 448,
      "end": 452,
      "text": " Another approach could be you could build this as a more traditional website."
    },
    {
      "speakerLabel": "spk_0",
      "start": 452,
      "end": 455,
      "text": " While it's true that there isn't really a lot of dynamic stuff,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 455,
      "end": 463,
      "text": " nothing is stopping you to still build a web server that is there, accepting requests and deciding which assets should be served back to the user."
    },
    {
      "speakerLabel": "spk_0",
      "start": 463,
      "end": 466,
      "text": " And to do that, you have a number of different options in AWS."
    },
    {
      "speakerLabel": "spk_0",
      "start": 466,
      "end": 472,
      "text": " For instance, you are free to pick whatever web framework, web application framework you like."
    },
    {
      "speakerLabel": "spk_0",
      "start": 472,
      "end": 476,
      "text": " If you are in Node.js, for instance, you could be using Express or Fastify."
    },
    {
      "speakerLabel": "spk_0",
      "start": 476,
      "end": 479,
      "text": " If you are using Python, you can be using Django."
    },
    {
      "speakerLabel": "spk_0",
      "start": 479,
      "end": 482,
      "text": " Any language really has a lot of options for web servers."
    },
    {
      "speakerLabel": "spk_0",
      "start": 482,
      "end": 489,
      "text": " At that point, it's up to you to build the application and then decide how do we ship the complete application with all the assets to AWS."
    },
    {
      "speakerLabel": "spk_0",
      "start": 489,
      "end": 491,
      "text": " And again, different options."
    },
    {
      "speakerLabel": "spk_0",
      "start": 491,
      "end": 501,
      "text": " You can just go for an EC2, figure out a way to just copy all the necessary software and code into an EC2, spin it up, connect a DNS."
    },
    {
      "speakerLabel": "spk_0",
      "start": 501,
      "end": 508,
      "text": " And at that point, you basically serve traffic on the public web using an EC2 as a backend."
    },
    {
      "speakerLabel": "spk_0",
      "start": 508,
      "end": 517,
      "text": " Similarly, you could be using Fargate. So if you prefer to containerize all of this code, you can go and deploy it on Fargate."
    },
    {
      "speakerLabel": "spk_0",
      "start": 517,
      "end": 525,
      "text": " Or other alternatives could be you could be using something that is more of an application backend like Elastic Beanstalk or AppRunner"
    },
    {
      "speakerLabel": "spk_0",
      "start": 525,
      "end": 533,
      "text": " that will give you a bunch of tooling already out of the box when it comes to facilitating deployment or scaling things up if you get a lot of traffic."
    },
    {
      "speakerLabel": "spk_0",
      "start": 533,
      "end": 540,
      "text": " So those could be other options to explore when you want something a little bit more out of the box and more kind of production ready."
    },
    {
      "speakerLabel": "spk_0",
      "start": 540,
      "end": 548,
      "text": " And the third approach could be you could imagine this website a little bit as an API and build it with Lambda and API Gateway."
    },
    {
      "speakerLabel": "spk_0",
      "start": 548,
      "end": 558,
      "text": " There are interesting concerns that comes in at that point because with Lambda and API Gateway, it's very easy to serve JSON or kind of structured responses."
    },
    {
      "speakerLabel": "spk_0",
      "start": 558,
      "end": 567,
      "text": " When it comes to serving files, you have a bunch of limits. For instance, your payload cannot be more than six megabytes, which should be enough for this kind of website."
    },
    {
      "speakerLabel": "spk_0",
      "start": 567,
      "end": 575,
      "text": " I don't expect the images will be more than six megabytes, but still you need to figure out how do I encode a response that contains a binary payload like an image."
    },
    {
      "speakerLabel": "spk_0",
      "start": 575,
      "end": 587,
      "text": " So there are different approaches there. Again, you can just use S3 and maybe create presigned URLs, or maybe you can just use S3 and CloudFront and then serve the images of all the other static assets from CloudFront."
    },
    {
      "speakerLabel": "spk_0",
      "start": 587,
      "end": 592,
      "text": " But again, it's up to you to experiment and figure out how practical this solution is."
    },
    {
      "speakerLabel": "spk_0",
      "start": 592,
      "end": 597,
      "text": " But if you really want to use Lambda and API Gateway, I think there are ways to make all of that work."
    },
    {
      "speakerLabel": "spk_0",
      "start": 597,
      "end": 605,
      "text": " Now, one interesting thing is that if you go for option two or three, because you have a backend at that point, you can start to do something a little bit more dynamic."
    },
    {
      "speakerLabel": "spk_0",
      "start": 605,
      "end": 611,
      "text": " For instance, you could create an endpoint called slash random that just gives you a random image every time."
    },
    {
      "speakerLabel": "spk_0",
      "start": 611,
      "end": 616,
      "text": " And you could use it for fun just to discover new status codes that maybe you're not aware about."
    },
    {
      "speakerLabel": "spk_0",
      "start": 616,
      "end": 629,
      "text": " And you could also consider doing that with option one if you really want, maybe trying to use something like Lambda at Edge to kind of intercept specific requests to CloudFront and then serve that response dynamically using Lambda at Edge."
    },
    {
      "speakerLabel": "spk_0",
      "start": 629,
      "end": 638,
      "text": " So again, option number one, even though it seems very static, you can still do something more dynamic if you really want and you have an opportunity to explore Lambda at Edge."
    },
    {
      "speakerLabel": "spk_0",
      "start": 638,
      "end": 648,
      "text": " So, yeah, I think that's probably more than enough ideas for how to build applications and websites on AWS with a bunch of different architectures."
    },
    {
      "speakerLabel": "spk_0",
      "start": 648,
      "end": 652,
      "text": " So I guess let's move to project number three."
    },
    {
      "speakerLabel": "spk_0",
      "start": 652,
      "end": 658,
      "text": " Just before we do, it's probably worth stating in the interest of fairness that there's also a HTTP.dog."
    },
    {
      "speakerLabel": "spk_1",
      "start": 658,
      "end": 670,
      "text": " If you want to go down a more data science path and learn how to store structured data on AWS and run analytics queries, there's a huge amount to learn here and I think this is a really big growth area and one where there's a lot of skills sought."
    },
    {
      "speakerLabel": "spk_1",
      "start": 670,
      "end": 672,
      "text": " So it's really one good one to get into."
    },
    {
      "speakerLabel": "spk_1",
      "start": 672,
      "end": 677,
      "text": " So we found a cat breed dataset on Kaggle again with more than 65,000 records and pictures."
    },
    {
      "speakerLabel": "spk_1",
      "start": 677,
      "end": 679,
      "text": " There's a link in the description."
    },
    {
      "speakerLabel": "spk_1",
      "start": 679,
      "end": 688,
      "text": " This dataset can be used to train ML models, but since we have a lot of data, we can also use it to just try out some data analytics and exercise those data analytics muscles."
    },
    {
      "speakerLabel": "spk_1",
      "start": 688,
      "end": 700,
      "text": " So we could take the index CSV file where every record will reference a cat picture and provide other labels like the breed of cat, age, gender, size and coat."
    },
    {
      "speakerLabel": "spk_1",
      "start": 700,
      "end": 703,
      "text": " So let's say, what could we do with this data?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 703,
      "end": 707,
      "text": " We might want to run some queries and find out what's the most or least common age in this dataset."
    },
    {
      "speakerLabel": "spk_1",
      "start": 707,
      "end": 709,
      "text": " What's the distribution of gender and size?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 709,
      "end": 714,
      "text": " Or we could even try to combine different attributes and figure out what is the most and least common combination of breed and gender."
    },
    {
      "speakerLabel": "spk_1",
      "start": 714,
      "end": 718,
      "text": " So some very simple statistical operations."
    },
    {
      "speakerLabel": "spk_1",
      "start": 718,
      "end": 720,
      "text": " Now, of course, this is not big data."
    },
    {
      "speakerLabel": "spk_1",
      "start": 720,
      "end": 722,
      "text": " You don't necessarily need to rely on the power of cloud."
    },
    {
      "speakerLabel": "spk_1",
      "start": 722,
      "end": 725,
      "text": " You could do this in Excel probably pretty easily."
    },
    {
      "speakerLabel": "spk_1",
      "start": 725,
      "end": 730,
      "text": " Or you could write a local script or a notebook using Python and pandas and process a CSV file that way."
    },
    {
      "speakerLabel": "spk_1",
      "start": 730,
      "end": 741,
      "text": " But you can still use these small datasets and use very powerful cloud services just to get really quick results and then try and think about experimenting with larger datasets."
    },
    {
      "speakerLabel": "spk_1",
      "start": 741,
      "end": 749,
      "text": " There's lots of datasets out there, including Amazon has a public open dataset with a public bucket where you can pull down much, much larger datasets."
    },
    {
      "speakerLabel": "spk_1",
      "start": 749,
      "end": 752,
      "text": " So this is more like step one on your journey."
    },
    {
      "speakerLabel": "spk_1",
      "start": 752,
      "end": 756,
      "text": " So since you're here to learn about AWS, what could you do with this in the cloud?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 756,
      "end": 760,
      "text": " So some options would be option one, say, sticking with the idea of a simple notebook."
    },
    {
      "speakerLabel": "spk_1",
      "start": 760,
      "end": 768,
      "text": " You can use SageMaker Studio or SageMaker notebooks and load in the CSV file using pandas and some of the Python data science kit."
    },
    {
      "speakerLabel": "spk_1",
      "start": 768,
      "end": 773,
      "text": " Maybe if you're into R, you can also do RStudio now in SageMaker as well."
    },
    {
      "speakerLabel": "spk_1",
      "start": 773,
      "end": 777,
      "text": " Option two would be to put the data in an S3 bucket then and to use other services."
    },
    {
      "speakerLabel": "spk_1",
      "start": 777,
      "end": 780,
      "text": " Athena being the probably the most obvious example."
    },
    {
      "speakerLabel": "spk_1",
      "start": 780,
      "end": 785,
      "text": " So you would create like an external table in Athena and then you could start running queries there."
    },
    {
      "speakerLabel": "spk_1",
      "start": 785,
      "end": 791,
      "text": " Again, with a small dataset, you're not really showcasing the power of Athena, but you're showing how you can query data on S3."
    },
    {
      "speakerLabel": "spk_1",
      "start": 791,
      "end": 795,
      "text": " These projects are always a little bit more fun if you can add some visuals in there as well."
    },
    {
      "speakerLabel": "spk_1",
      "start": 795,
      "end": 804,
      "text": " So apart from visualizing things in your notebook, you might also want to try some BI dashboards and spin up QuickSight on Amazon as well and try some data visualizations."
    },
    {
      "speakerLabel": "spk_1",
      "start": 804,
      "end": 806,
      "text": " You can do some really cool stuff there as well."
    },
    {
      "speakerLabel": "spk_1",
      "start": 806,
      "end": 812,
      "text": " So for people who are looking to kind of get into basic data analytics and progress a career and look at data science and data engineering on AWS,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 812,
      "end": 819,
      "text": " it's a good place to start and you can grow from there and then start looking at all the other services like Glue and Elastic MapReduce,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 819,
      "end": 826,
      "text": " EMR and many more, even things like Lake Formation if you're getting into enterprise data engineering."
    },
    {
      "speakerLabel": "spk_1",
      "start": 826,
      "end": 833,
      "text": " So I think that's number three covered. What have we got for our final exercise?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 833,
      "end": 843,
      "text": " So another idea could be still focusing on the realm of application development, more specifically in the realm of APIs development on AWS."
    },
    {
      "speakerLabel": "spk_0",
      "start": 843,
      "end": 850,
      "text": " We could still use the same cat breed CSV file that we mentioned in the previous idea,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 850,
      "end": 855,
      "text": " but this time, rather than just using for data analytics, we could use it as a data source and build an API on top of it."
    },
    {
      "speakerLabel": "spk_0",
      "start": 855,
      "end": 859,
      "text": " So we could expose some of this data to a RESTful API."
    },
    {
      "speakerLabel": "spk_0",
      "start": 859,
      "end": 863,
      "text": " And one idea could be, OK, what kind of APIs can we expose?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 863,
      "end": 870,
      "text": " For instance, people might want to know what are all the different breeds of cats that are known, at least in this dataset."
    },
    {
      "speakerLabel": "spk_0",
      "start": 870,
      "end": 877,
      "text": " So we could create an endpoint called slash breeds. When you call it, you get this list with all the names of the different breeds."
    },
    {
      "speakerLabel": "spk_0",
      "start": 877,
      "end": 882,
      "text": " Then because this dataset has pictures, maybe you also want to list all the pictures for a specific breed."
    },
    {
      "speakerLabel": "spk_0",
      "start": 882,
      "end": 892,
      "text": " That could be funny. I don't know if you're trying to allow other people to build a mobile application where you can see which breed is the cutest or something like that."
    },
    {
      "speakerLabel": "spk_0",
      "start": 892,
      "end": 895,
      "text": " Maybe you can display pictures and create a little game that way."
    },
    {
      "speakerLabel": "spk_0",
      "start": 895,
      "end": 903,
      "text": " So if you're trying to build the API behind it, an endpoint could be slash breeds slash breed ID and then slash pictures."
    },
    {
      "speakerLabel": "spk_0",
      "start": 903,
      "end": 908,
      "text": " And that should give you a list with all the pictures that are available in the dataset for that particular breed."
    },
    {
      "speakerLabel": "spk_0",
      "start": 908,
      "end": 915,
      "text": " And of course, you might also think how to make those APIs paginated. This is on you to decide exactly what the shape of the API will look like."
    },
    {
      "speakerLabel": "spk_0",
      "start": 915,
      "end": 923,
      "text": " And finally, again, there could be another idea that you can just have a /random endpoint that just gives you a random picture and the details of that picture."
    },
    {
      "speakerLabel": "spk_0",
      "start": 923,
      "end": 929,
      "text": " So how can we build this API? We already mentioned API Gateway and Lambda, and this is definitely a very valid solution."
    },
    {
      "speakerLabel": "spk_0",
      "start": 929,
      "end": 934,
      "text": " But there is an opportunity here to experiment a little bit more. And you are not limited to REST."
    },
    {
      "speakerLabel": "spk_0",
      "start": 934,
      "end": 942,
      "text": " So why not try something like GraphQL? So maybe you can also think about AppSync, for instance, as a way to build an equivalent version of this API,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 942,
      "end": 948,
      "text": " but that exposes the data through GraphQL. In both cases, you still need to think about the data."
    },
    {
      "speakerLabel": "spk_0",
      "start": 948,
      "end": 955,
      "text": " Where do we store all this data? Right. And it will be fine to store it in a stream, but every single time there is a request,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 955,
      "end": 960,
      "text": " of course, you don't want to load a big multiple megabytes CSV and manipulate it in real time."
    },
    {
      "speakerLabel": "spk_0",
      "start": 960,
      "end": 965,
      "text": " You probably want something a little bit more structured so that you can respond to the APIs very, very quickly."
    },
    {
      "speakerLabel": "spk_0",
      "start": 965,
      "end": 972,
      "text": " So an idea here is why not use DynamoDB? So that could be an opportunity to try to figure out, OK, given a bunch of data,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 972,
      "end": 978,
      "text": " how do I store it in DynamoDB so that I can query it efficiently for this particular use cases that I have in mind?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 978,
      "end": 986,
      "text": " Or again, you can still think about, OK, I'm going to be a little bit more traditional, spin up an RDS, put the data there and then query through SQL."
    },
    {
      "speakerLabel": "spk_0",
      "start": 986,
      "end": 991,
      "text": " It's really up to you to decide how do you want to store the data and how do you want to consume it?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 991,
      "end": 997,
      "text": " And another thing that you could do is, again, try to think, how do I serve all the pictures?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 997,
      "end": 1003,
      "text": " Because, of course, this is going to be the majority of your traffic. If people are using this API and then they want to eventually have access to all the pictures,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1003,
      "end": 1010,
      "text": " you still need to be able to provide those pictures. There is a little bit of a shortcut there, because if you look at the CSV,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1010,
      "end": 1016,
      "text": " in the fields that you have for every record, one of the fields is a public URL that is already on CloudFront."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1016,
      "end": 1020,
      "text": " Then you can just use that URL to provide access to the actual picture."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1020,
      "end": 1026,
      "text": " But it might be interesting to try to think, OK, what if I had to do that myself? How do I actually expose this information?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1026,
      "end": 1035,
      "text": " And again, you can just go down the route of, OK, I'm going to put all this data in S3, then I'm going to use CloudFront as a way to efficiently serve all the data."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1035,
      "end": 1039,
      "text": " And then you can get links directly from CloudFront."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1039,
      "end": 1045,
      "text": " There are additional concerns that you might try to think about and see what kind of solutions are available on AWS."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1045,
      "end": 1054,
      "text": " For instance, one would be authentication. What if you want to allow only authenticated users to consume this particular API?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1054,
      "end": 1059,
      "text": " And of course, if you are hosting all of this, you will have to pay the bill on AWS."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1059,
      "end": 1067,
      "text": " So maybe you want to offload some of that cost to your users. That's why they might be needing to have an authentication so that you can actually track the usage."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1067,
      "end": 1075,
      "text": " And it's actually really cool if you use API Gateway that you can easily create API keys and then you can create usage plans attached to those API keys."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1075,
      "end": 1083,
      "text": " And that way you can make sure that a user is not abusing the system and making too many API calls that will result in an increased bill on your side."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1083,
      "end": 1088,
      "text": " So you can experiment with all these ideas. Similarly, you can experiment with documentation."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1088,
      "end": 1099,
      "text": " How do you serve a documentation to the users? And again, API Gateway supports some degree of Swagger based or an open API based documentation formats."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1099,
      "end": 1105,
      "text": " So you can try to experiment with those as well. And there are other topics like, for instance, can we do caching?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1105,
      "end": 1111,
      "text": " This data is quite static at the end of the day. So maybe it makes sense to think about should we be using a layer of caching?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1111,
      "end": 1115,
      "text": " And again, API Gateway has some options that you can explore."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1115,
      "end": 1125,
      "text": " So I think this is just a very interesting project. And it's if you are coming into AWS as an application developer, I think it's very important to understand how do you build an API on AWS?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1125,
      "end": 1131,
      "text": " Because this is one of the most common topics as a developer that you will need to face when building projects on AWS."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1131,
      "end": 1140,
      "text": " So really recommend that to try to experiment with this idea if you're going down that path of learning AWS as a web application developer."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1140,
      "end": 1147,
      "text": " So this is all we have. These are just four projects that you can try to experiment with if you want to learn more about AWS."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1147,
      "end": 1163,
      "text": " Let us know if you like them. Let us know if you come up with some variations of these ideas or maybe if you don't like cats and you prefer other pets, definitely send us links for your projects if you end up implementing them, because we would be really, really curious to see them live and working."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1163,
      "end": 1183,
      "text": " And one last thing that I want to mention is that if all these projects are a little bit scary to you because you don't really know where to start and you want something a little bit more guided, like you want to see somebody actually building something on AWS to give you the confidence that you know which steps you need to follow and you have some ideas on how to go from zero to something actually working."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1183,
      "end": 1197,
      "text": " We actually did a series of live streams where we built an application that is like Dropbox Transfer or basically an application that allows you to upload files in S3, get back a link and then use that link to share the file with somebody else."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1197,
      "end": 1212,
      "text": " This is an application we built live so you can see all the live recording. We will put a link on the description and that can be another thing that you can try to rebuild yourself as another exercise to learn more about AWS and some of the more common services that people use on AWS."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1212,
      "end": 1222,
      "text": " So with that being said, thank you very much for being with us. Remember to like and subscribe and give us reviews and feedback and we will see you at the next episode."
    }
  ]
}
