{
  "speakers": {
    "spk_0": "spk_0",
    "spk_1": "spk_1"
  },
  "segments": [
    {
      "speakerLabel": "spk_0",
      "start": 0,
      "end": 4,
      "text": " The definition of serverless has already changed in a few years since it first emerged."
    },
    {
      "speakerLabel": "spk_0",
      "start": 4,
      "end": 8,
      "text": " There have been many success stories using serverless in startups and in the enterprise."
    },
    {
      "speakerLabel": "spk_0",
      "start": 8,
      "end": 15,
      "text": " But what comes next? By the end of this episode, you'll have heard our thoughts and predictions on what serverless 2.0 will look like."
    },
    {
      "speakerLabel": "spk_0",
      "start": 15,
      "end": 22,
      "text": " We'll also reveal who we think will be the main challenger to AWS for domination of serverless as it goes mainstream."
    },
    {
      "speakerLabel": "spk_0",
      "start": 22,
      "end": 33,
      "text": " I'm Eoin, I'm here with Luciano and this is AWS Bites."
    },
    {
      "speakerLabel": "spk_0",
      "start": 33,
      "end": 38,
      "text": " There are a couple of ways to look at serverless today and the term itself is a bit problematic."
    },
    {
      "speakerLabel": "spk_0",
      "start": 38,
      "end": 44,
      "text": " But you have to say that the trend towards serverless is very real. Luciano, what are some of the ways that you can define serverless?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 44,
      "end": 46,
      "text": " Yeah, you're absolutely right."
    },
    {
      "speakerLabel": "spk_1",
      "start": 46,
      "end": 52,
      "text": " One of the problems with serverless is that there isn't really a clear definition. There are many definitions."
    },
    {
      "speakerLabel": "spk_1",
      "start": 52,
      "end": 60,
      "text": " So I'm going to try to summarize all the definitions I know and maybe come up with a somewhat useful definition of serverless."
    },
    {
      "speakerLabel": "spk_1",
      "start": 60,
      "end": 65,
      "text": " But yeah, the first one that at least historically has been around is the concept of function as a service."
    },
    {
      "speakerLabel": "spk_1",
      "start": 65,
      "end": 73,
      "text": " So that whole idea that you can just write a function, it's event based, somebody is triggering your function, you run some code, you get stuff done that way."
    },
    {
      "speakerLabel": "spk_1",
      "start": 73,
      "end": 78,
      "text": " For a long time at the very beginning of the serverless trend, that was serverless in itself."
    },
    {
      "speakerLabel": "spk_1",
      "start": 78,
      "end": 84,
      "text": " That's what people associated when they were talking about serverless, they were immediately thinking about function as a service."
    },
    {
      "speakerLabel": "spk_1",
      "start": 84,
      "end": 89,
      "text": " But in reality, I believe that there is a lot more to it. Like it's not just function as a service."
    },
    {
      "speakerLabel": "spk_1",
      "start": 89,
      "end": 95,
      "text": " Even though function as a service is probably one of the biggest part of the serverless revolution."
    },
    {
      "speakerLabel": "spk_1",
      "start": 95,
      "end": 107,
      "text": " So I suppose in a more generical sense, you want to focus on trying to reduce the amount of code and the amount of operations and maintenance that you are doing when building something."
    },
    {
      "speakerLabel": "spk_1",
      "start": 107,
      "end": 110,
      "text": " And you can do that by using more managed services."
    },
    {
      "speakerLabel": "spk_1",
      "start": 110,
      "end": 122,
      "text": " So basically you want to try to stay as close as possible to the business needs and delegate all these concerns that are more on the infrastructure, on the scalability side, on the security side."
    },
    {
      "speakerLabel": "spk_1",
      "start": 122,
      "end": 128,
      "text": " And that's not just from a development perspective, but also from a cost perspective."
    },
    {
      "speakerLabel": "spk_1",
      "start": 128,
      "end": 136,
      "text": " Because you want to pay for what you use, you don't want to pre-allocate a bunch of money somewhere in a pool and just say,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 136,
      "end": 138,
      "text": " okay, this is going to be there for my cloud spending."
    },
    {
      "speakerLabel": "spk_1",
      "start": 138,
      "end": 143,
      "text": " Or you actually want to organically grow your spending as your business gets more and more successful."
    },
    {
      "speakerLabel": "spk_1",
      "start": 143,
      "end": 146,
      "text": " So that's another very important idea for serverless."
    },
    {
      "speakerLabel": "spk_1",
      "start": 146,
      "end": 153,
      "text": " Giving you that elasticity in pricing, you start very, very low, possibly zero when you are experimenting with a new business idea."
    },
    {
      "speakerLabel": "spk_1",
      "start": 153,
      "end": 163,
      "text": " And then as you grow and as you are more successful in the market, there should be there the opportunity to grow your cost organically with your success."
    },
    {
      "speakerLabel": "spk_1",
      "start": 163,
      "end": 170,
      "text": " Other than that, in general, when we talk about managed services, we can distinguish that in different areas."
    },
    {
      "speakerLabel": "spk_1",
      "start": 170,
      "end": 176,
      "text": " We can talk about compute, databases, file storage, event API, scheduling and orchestration."
    },
    {
      "speakerLabel": "spk_1",
      "start": 176,
      "end": 180,
      "text": " All these things are at the end of the day tools that you need to build your applications."
    },
    {
      "speakerLabel": "spk_1",
      "start": 180,
      "end": 185,
      "text": " And cloud providers should kind of lower down the barrier to entry in this concept of serverless."
    },
    {
      "speakerLabel": "spk_1",
      "start": 185,
      "end": 194,
      "text": " Because again, the definition is that you focus on building things that the business needs, not necessarily on the how and supporting that."
    },
    {
      "speakerLabel": "spk_1",
      "start": 194,
      "end": 198,
      "text": " But more on let's serve the business, let's make it grow."
    },
    {
      "speakerLabel": "spk_1",
      "start": 198,
      "end": 201,
      "text": " Everything else is something that we just buy when we need it."
    },
    {
      "speakerLabel": "spk_1",
      "start": 201,
      "end": 209,
      "text": " So that would be my definition of serverless. It doesn't really mean that there are no servers, but it's what we don't think as much about servers."
    },
    {
      "speakerLabel": "spk_1",
      "start": 209,
      "end": 214,
      "text": " We think more about business capabilities and how them support the business."
    },
    {
      "speakerLabel": "spk_1",
      "start": 214,
      "end": 219,
      "text": " So what do you think are the challenges that serverless is facing today?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 219,
      "end": 222,
      "text": " I completely agree with your definitions there."
    },
    {
      "speakerLabel": "spk_0",
      "start": 222,
      "end": 228,
      "text": " I think some of the challenges we see today are not everything is available in proper full serverless mode."
    },
    {
      "speakerLabel": "spk_0",
      "start": 228,
      "end": 234,
      "text": " So if you look at AWS, we can still see that with serverless search, we don't really have a good solution."
    },
    {
      "speakerLabel": "spk_0",
      "start": 234,
      "end": 238,
      "text": " Databases are getting there, but sometimes it's more of a miss than a hit."
    },
    {
      "speakerLabel": "spk_0",
      "start": 238,
      "end": 242,
      "text": " Aurora serverless isn't quite there yet fully."
    },
    {
      "speakerLabel": "spk_0",
      "start": 242,
      "end": 247,
      "text": " Neptune, the recent announcements, kind of frustrated people because it doesn't seem very serverless."
    },
    {
      "speakerLabel": "spk_0",
      "start": 247,
      "end": 250,
      "text": " Things don't seem to scale to zero in terms of cost."
    },
    {
      "speakerLabel": "spk_0",
      "start": 250,
      "end": 256,
      "text": " We could really do with an elastic cache serverless version or some sort of cache that's fast and serverless."
    },
    {
      "speakerLabel": "spk_0",
      "start": 256,
      "end": 261,
      "text": " And Kinesis, although we have Kinesis serverless, it's still not quite there yet in terms of scaling to zero."
    },
    {
      "speakerLabel": "spk_0",
      "start": 261,
      "end": 265,
      "text": " So you kind of have to look to third parties for things like that."
    },
    {
      "speakerLabel": "spk_0",
      "start": 265,
      "end": 269,
      "text": " And it's kind of early days, but there's a lot of third parties trying to fill the gap there."
    },
    {
      "speakerLabel": "spk_0",
      "start": 269,
      "end": 271,
      "text": " So that's one of the challenges. Now, complexity."
    },
    {
      "speakerLabel": "spk_0",
      "start": 271,
      "end": 276,
      "text": " People talk a lot about complexity with serverless, especially when you start out thinking it's simple."
    },
    {
      "speakerLabel": "spk_0",
      "start": 276,
      "end": 282,
      "text": " You dive straight into it and all of a sudden you realize there are wires all over the place and you don't really understand how things are connected together."
    },
    {
      "speakerLabel": "spk_0",
      "start": 282,
      "end": 290,
      "text": " So you have to realize that with serverless, you're building a decoupled, scalable, on demand system made up of these small cloud components."
    },
    {
      "speakerLabel": "spk_0",
      "start": 290,
      "end": 298,
      "text": " So you ended up with a highly distributed system that's inherently more complex to manage than a less scalable, but more cohesive monolith."
    },
    {
      "speakerLabel": "spk_0",
      "start": 298,
      "end": 305,
      "text": " So you have to then understand all the nuances, the restrictions and the controls from the cloud vendor, like identity and access management, infrastructure as code."
    },
    {
      "speakerLabel": "spk_0",
      "start": 305,
      "end": 307,
      "text": " Deployment."
    },
    {
      "speakerLabel": "spk_0",
      "start": 307,
      "end": 320,
      "text": " So if we look at the cloud serverless serverless, right, like Lambda, DynamoDB, AppSync, Step Functions, API Gateway, they all require a pretty good amount of knowledge and technical expertise if you really want to run them in production."
    },
    {
      "speakerLabel": "spk_0",
      "start": 320,
      "end": 326,
      "text": " DynamoDB is a prime example here. It doesn't take a lot of skill to put an entry in a DynamoDB table and take it out again."
    },
    {
      "speakerLabel": "spk_0",
      "start": 326,
      "end": 337,
      "text": " But if you want to actually scale that in production over time, then you really have to understand the cost, performance, scalability, how to design indexes, partitions, and if you're really going to make it work well."
    },
    {
      "speakerLabel": "spk_0",
      "start": 337,
      "end": 343,
      "text": " So it's almost deceptively simple, but you have to understand what the long term impact is going to be like."
    },
    {
      "speakerLabel": "spk_0",
      "start": 343,
      "end": 346,
      "text": " Another one of the challenges, local development and testing."
    },
    {
      "speakerLabel": "spk_0",
      "start": 346,
      "end": 351,
      "text": " So I think that's when I look at the surveys around challenges and servers, I think this is one that comes out top."
    },
    {
      "speakerLabel": "spk_0",
      "start": 351,
      "end": 362,
      "text": " You rely on full cloud environment to really replicate your production environment. There is no like for like local replica mechanism."
    },
    {
      "speakerLabel": "spk_0",
      "start": 362,
      "end": 375,
      "text": " So running locally really requires you to under structure your code and set up tests in a way that you can run some parts of your code locally, but that if you really want to test it, integrated or end to end, you have to deploy to the cloud."
    },
    {
      "speakerLabel": "spk_0",
      "start": 375,
      "end": 384,
      "text": " So it all places this obligation on you to put in place more effective testing and testing asynchronous event driven distributed systems is hard. There's no escaping that."
    },
    {
      "speakerLabel": "spk_0",
      "start": 384,
      "end": 394,
      "text": " So the tooling has to improve there. Another one is that I suppose there's a lack of standards. So every cloud does it differently. Every vendor, Azure, AWS, Google Cloud, all the others."
    },
    {
      "speakerLabel": "spk_0",
      "start": 394,
      "end": 400,
      "text": " They do things like serverless services differently. They do their functions differently. So there's a learning curve."
    },
    {
      "speakerLabel": "spk_0",
      "start": 400,
      "end": 411,
      "text": " You might also be concerned about the stability of interfaces. So the way we develop serverless applications today is at the same as with the way you're going to do it in three years. Will your code still last or will it gather dust?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 411,
      "end": 419,
      "text": " So all of this is possible to overcome, but you know, you need good training, best practices, expertise, standards and high levels of automation."
    },
    {
      "speakerLabel": "spk_0",
      "start": 419,
      "end": 429,
      "text": " And this is probably one of the reasons why serverless adoption, somewhat surprisingly, is less than expected in startups and more than expected in enterprise in large companies."
    },
    {
      "speakerLabel": "spk_0",
      "start": 429,
      "end": 438,
      "text": " Now usually the startups were the early adopters. That was the case for to a certain extent with serverless, but generally startups are trying to get time to market so they stick with the tools they know."
    },
    {
      "speakerLabel": "spk_0",
      "start": 438,
      "end": 445,
      "text": " That's the way it should happen generally, but enterprises can afford the time and investment to invest in the tooling for this next generation of technology."
    },
    {
      "speakerLabel": "spk_0",
      "start": 445,
      "end": 452,
      "text": " So you do see some of the more innovative big companies moving forward with serverless and investing in the training and the tooling."
    },
    {
      "speakerLabel": "spk_0",
      "start": 452,
      "end": 459,
      "text": " So I guess with all that said, what do we think we need from the next generation of serverless or serverless 2.0?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 459,
      "end": 466,
      "text": " Yeah, I think I'm going to repeat some of your points because you definitely highlighted some of the major weaknesses of serverless today."
    },
    {
      "speakerLabel": "spk_1",
      "start": 466,
      "end": 473,
      "text": " So on the other hand, serverless v2 is going to try to resolve all these issues or at least some of them."
    },
    {
      "speakerLabel": "spk_1",
      "start": 473,
      "end": 494,
      "text": " So the main one that we mentioned is that there are lots of different services for different types of tasks, but at the end of the day, not all of them are truly serverless in that essence that you don't have to focus on managing the service itself, scaling it, and also in terms of pricing that it doesn't scale to zero."
    },
    {
      "speakerLabel": "spk_1",
      "start": 494,
      "end": 510,
      "text": " I don't know, it forces you to think about like instance sizes rather than how much am I using this particular service. So definitely we need more of these serverless, first I'm going to call them, services for everything like caching, orchestration, high performance computing,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 510,
      "end": 518,
      "text": " so that coming to a new project, you don't really have to think this part is serverless, all these other parts is not serverless because there isn't a solution yet."
    },
    {
      "speakerLabel": "spk_1",
      "start": 518,
      "end": 523,
      "text": " It's like you should be able to embrace serverless 100% in your architecture."
    },
    {
      "speakerLabel": "spk_1",
      "start": 523,
      "end": 540,
      "text": " Similarly, you mentioned for instance DynamoDB and how misleading can that be. So, and I want to definitely echo that feeling. I am the first one that says that DynamoDB is really, really good when you know exactly how it works and when you figure out all the access patterns to your data."
    },
    {
      "speakerLabel": "spk_1",
      "start": 540,
      "end": 557,
      "text": " But the truth is that if you're working in a new project, most of the time you don't know in advance of the access patterns for the future years, so it becomes very easy at the beginning to adopt but then later on, it might trick you in different ways and it's very hard to change the data as you go and implement new access patterns."
    },
    {
      "speakerLabel": "spk_1",
      "start": 557,
      "end": 571,
      "text": " So definitely, and this is just not to mention all the amount of configuration that you have to put into it anyway because even if you don't have to think about databases, you just think about tables, you still need to put a decent amount of configuration in every table you create."
    },
    {
      "speakerLabel": "spk_1",
      "start": 571,
      "end": 583,
      "text": " And that might not be obvious at all to understand how that configuration will convert into scalability capabilities, or the ability to change the data as you go or the ability to perform different kinds of queries."
    },
    {
      "speakerLabel": "spk_1",
      "start": 583,
      "end": 596,
      "text": " That requires a lot of expertise and again, it kind of conflicts a little bit with that idea of servers that you want to think more about business logic rather than all these details that are more operational details."
    },
    {
      "speakerLabel": "spk_1",
      "start": 596,
      "end": 616,
      "text": " So I suppose that one idea there for Serverless V2 would be, can I just have a default table where I can store data and it's going to automatically scale and deal with in a way that allow me to support different kinds of query capabilities without having to think, now I need to create a new index or now I need to replicate this data in a different shape somewhere else."
    },
    {
      "speakerLabel": "spk_1",
      "start": 616,
      "end": 626,
      "text": " Hopefully all this stuff can be somewhat automated and give the users just the ability to think more about the data rather than how to make it work at scale."
    },
    {
      "speakerLabel": "spk_1",
      "start": 626,
      "end": 628,
      "text": " Nice."
    },
    {
      "speakerLabel": "spk_0",
      "start": 628,
      "end": 641,
      "text": " Other than that, another topic is probably observability. It's something we covered in the past in other episodes and we also invested in some ways that allow people to automate all the observability concerns."
    },
    {
      "speakerLabel": "spk_1",
      "start": 641,
      "end": 648,
      "text": " By the way, if you're curious, check out SlickWatch on GitHub. We'll give you a link on the show notes."
    },
    {
      "speakerLabel": "spk_1",
      "start": 648,
      "end": 657,
      "text": " But the idea is that if you want to do good observability today, it's definitely possible. There are lots of tools in AWS and all these tools are actually quite good."
    },
    {
      "speakerLabel": "spk_1",
      "start": 657,
      "end": 665,
      "text": " It just takes a lot of time to configure all of them correctly and connect all of them together and instrument all your code to really take advantage of these tools."
    },
    {
      "speakerLabel": "spk_1",
      "start": 665,
      "end": 673,
      "text": " There is very little automation and with the experiments that we have done, with the research we have done, we realized that there is a lot of room for automation."
    },
    {
      "speakerLabel": "spk_1",
      "start": 673,
      "end": 681,
      "text": " It's just AWS is not investing enough in this area yet. So this is the reason that we hope to see more in serverless v2."
    },
    {
      "speakerLabel": "spk_1",
      "start": 681,
      "end": 692,
      "text": " And similarly, this is also another topic we discussed about in the past. As a developer, there is this kind of developer experience where on one side you are feeling, okay, I'm just writing functions."
    },
    {
      "speakerLabel": "spk_1",
      "start": 692,
      "end": 703,
      "text": " And I feel a lot more able to focus on the business logic when I'm writing this one function that really encodes a specific workflow and I don't have to think about everything else."
    },
    {
      "speakerLabel": "spk_1",
      "start": 703,
      "end": 715,
      "text": " But then in reality, when you go and deploy that function, it never really works the first time because one time you forgot a permission. Another time, maybe you didn't configure the networking correctly."
    },
    {
      "speakerLabel": "spk_1",
      "start": 715,
      "end": 722,
      "text": " There are so many things that can go wrong from how that particular function is wired into the rest of the cloud environment."
    },
    {
      "speakerLabel": "spk_1",
      "start": 722,
      "end": 737,
      "text": " So one solution to this problem could be that you have a better tooling that can somehow look at your code and also look at the rest of your architecture and your environments and make sense of maybe you are forgetting to create a policy and can tell you in advance,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 737,
      "end": 748,
      "text": " maybe before you deploy, you are using this SDK call that is going to require you S3 access. I don't see any policy attached to this function that gives you S3 access. Are you sure this is really what you want to do?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 748,
      "end": 762,
      "text": " Something like that would be already very useful. And I saw that some time ago on GitHub, somebody was trying to build something like that, but it feels like the need is clear, but still not."
    },
    {
      "speakerLabel": "spk_1",
      "start": 762,
      "end": 770,
      "text": " We are not seeing a lot of investment in that direction. And hopefully, again, wishes are that serverless v2 will address also this problem as well."
    },
    {
      "speakerLabel": "spk_1",
      "start": 770,
      "end": 781,
      "text": " Then I have other one. I'm going to go quickly through them. Faster deployments. We know that deploying a significantly big serverless application might take, I don't know, even 15 minutes or more."
    },
    {
      "speakerLabel": "spk_1",
      "start": 781,
      "end": 799,
      "text": " And you don't want to be spending 15 minutes every time you are doing a deployment. Imagine you are fixing a very bad issue in production. You want to deploy it as quick as possible. You don't want to be waiting for a pipeline to trigger and then spending the next 15 minutes looking at it, hoping it will go faster."
    },
    {
      "speakerLabel": "spk_1",
      "start": 799,
      "end": 814,
      "text": " And similarly, infrastructure as code, it's an area that we have seen a lot of innovation, actually, if we think about serverless framework, some, but all this innovation seems to have focus around the function as a service aspect of serverless."
    },
    {
      "speakerLabel": "spk_1",
      "start": 814,
      "end": 825,
      "text": " It's making it easier to configure everything related to functions. But for everything else, you are still writing like barebone infrastructure as code where you need to specify every single detail."
    },
    {
      "speakerLabel": "spk_1",
      "start": 825,
      "end": 844,
      "text": " So hopefully the same trend that we saw around functions to making them simple, how to generate some policies, how to generate some of the wiring around networking and security, maybe we can see the same also for other parts of the infrastructure of different kinds of serverless architectures."
    },
    {
      "speakerLabel": "spk_1",
      "start": 844,
      "end": 858,
      "text": " So given what we just said, what do we think is going to happen there? Is this something that, I don't know, today we are seeing somebody in this space already addressing some of these concerns?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 858,
      "end": 870,
      "text": " Yeah, I think there are examples, right? If we look to some of the third parties, we can see innovation that is already maybe a generation ahead of the cloud vendors in terms of the serverless offerings."
    },
    {
      "speakerLabel": "spk_0",
      "start": 870,
      "end": 882,
      "text": " And maybe this has already been the case. Like we can see from the history, we had Heroku and Parse and all these other players building platforms as a service that try to make it easier for developers to adopt new technologies."
    },
    {
      "speakerLabel": "spk_0",
      "start": 882,
      "end": 891,
      "text": " And we're seeing examples of that in the serverless space now. So they might provide us with some kind of clues as to where the next version of serverless is coming from."
    },
    {
      "speakerLabel": "spk_0",
      "start": 891,
      "end": 901,
      "text": " Okay, so let's look at a few examples. Vercel is one that immediately jumps to mind. So it's mainly for front end and agile functions, sorry, agile functions, edge functions."
    },
    {
      "speakerLabel": "spk_0",
      "start": 901,
      "end": 916,
      "text": " But they've really had success in terms of adoption because they made it easy for developers to connect a repo, get automatic deployments, monitoring environments, branch previews, and just make that experience really simple."
    },
    {
      "speakerLabel": "spk_0",
      "start": 916,
      "end": 925,
      "text": " So whoever is looking at product management in these cloud vendors, I'm sure they're looking at these as ways they can simplify the whole process."
    },
    {
      "speakerLabel": "spk_0",
      "start": 925,
      "end": 932,
      "text": " And you mentioned serverless framework. And I think this year, maybe late last year, they launched their serverless cloud."
    },
    {
      "speakerLabel": "spk_0",
      "start": 932,
      "end": 940,
      "text": " And that's also trying to address all of these same challenges, right? With faster deployment, seamless local front end with a cloud backend."
    },
    {
      "speakerLabel": "spk_0",
      "start": 940,
      "end": 947,
      "text": " So you can do front end development and integrate it into your cloud, but it's all updated locally."
    },
    {
      "speakerLabel": "spk_0",
      "start": 947,
      "end": 955,
      "text": " Getting rid of the YAML configuration altogether, simplifying data storage and access like we talked about, simplifying events as well."
    },
    {
      "speakerLabel": "spk_0",
      "start": 955,
      "end": 964,
      "text": " And their approach is basically they'll do that for you and run it in their cloud infrastructure, which is going to run on top of a public cloud anyway, but it's all abstracted away from you."
    },
    {
      "speakerLabel": "spk_0",
      "start": 964,
      "end": 968,
      "text": " So you don't see what the raw resources are under the hood."
    },
    {
      "speakerLabel": "spk_0",
      "start": 968,
      "end": 972,
      "text": " On the other hand, you have examples like SST from the serverless stack."
    },
    {
      "speakerLabel": "spk_0",
      "start": 972,
      "end": 981,
      "text": " And when I started learning serverless and experimenting with serverless years and years ago, I was using the serverless stack tutorials, which are really, really excellent documentation on getting up to speed with serverless."
    },
    {
      "speakerLabel": "spk_0",
      "start": 981,
      "end": 987,
      "text": " I'm really happy to see them continually innovating. And the SST tool is really taking off."
    },
    {
      "speakerLabel": "spk_0",
      "start": 987,
      "end": 990,
      "text": " I really want to watch right now. Right. So this is open source tooling."
    },
    {
      "speakerLabel": "spk_0",
      "start": 990,
      "end": 995,
      "text": " It provides a simpler level of abstraction for billing applications than we're used to."
    },
    {
      "speakerLabel": "spk_0",
      "start": 995,
      "end": 1000,
      "text": " But it's still your account and your resources. So it's still creating Lambda functions and everything under the hood."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1000,
      "end": 1003,
      "text": " It builds on top of the CDK, adds a nice UI."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1003,
      "end": 1010,
      "text": " They've got loads of starter examples and all in all tries to make the experience a little simpler, like with Vercel or with serverless cloud."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1010,
      "end": 1016,
      "text": " But you still have your own infrastructure and you can still see what the raw pieces are under the hood."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1016,
      "end": 1022,
      "text": " Another one that you might take inspiration from, just because I suppose it's so futuristic in some ways, is Darklang."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1022,
      "end": 1027,
      "text": " And Darklang is, I almost see it like a concept car, whereas it's not a car you're ever going to buy."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1027,
      "end": 1034,
      "text": " But it might give you some kind of indication as to where the future is headed, because the interface is very different."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1034,
      "end": 1038,
      "text": " They're trying to provide a UI and a back end and everything all in one application."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1038,
      "end": 1042,
      "text": " So you don't use your normal editor or your source provider. It's all in Darklang."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1042,
      "end": 1046,
      "text": " And you code up to data sources in this kind of visual editor."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1046,
      "end": 1054,
      "text": " The whole point that they're trying to push towards is zero deployment time. So sub 20 millisecond deployment time."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1054,
      "end": 1059,
      "text": " So as soon as you edit your code, it's already deployed and you just turn it on with a feature flag."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1059,
      "end": 1066,
      "text": " The appeal of that is massive for me, because I think because local development in serverless isn't really possible,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1066,
      "end": 1069,
      "text": " you spend your time trying to optimize your deployment of the cloud."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1069,
      "end": 1075,
      "text": " Getting it down from 30 seconds or 45 seconds down to zero seconds would be a big win."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1075,
      "end": 1080,
      "text": " And the last thing I suppose we could mention, just in terms of looking at where the innovators are coming from,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1080,
      "end": 1084,
      "text": " there's a load of serverless databases coming out all the time now."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1084,
      "end": 1089,
      "text": " And I think they're really pushing the simplification of data storage and data access and data scalability."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1089,
      "end": 1094,
      "text": " So some dimension are FaunaDB, which is really big in the serverless space."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1094,
      "end": 1098,
      "text": " Firestore from Firebase is, has been around quite a long time, actually,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1098,
      "end": 1102,
      "text": " but it's a good example of making that developer experience simpler."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1102,
      "end": 1107,
      "text": " CockroachDB is another one. And then you have lots of kind of domain specific databases, if you like,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1107,
      "end": 1115,
      "text": " like content backends, headless CMSs like Sanity. I think we covered some of those on previous podcasts."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1115,
      "end": 1123,
      "text": " Yeah, I really like that you kind of somehow underlined that there are these two different approaches where on one side,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1123,
      "end": 1127,
      "text": " you are trying to simplify the space and make it more managed."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1127,
      "end": 1132,
      "text": " But at the same time, you are abstracting a lot like it's not clear what's actually running under the hood."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1132,
      "end": 1136,
      "text": " While there are other approaches that are just giving you extra layers that are simpler."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1136,
      "end": 1141,
      "text": " But then at the end of the day, it's very clear how these layers translate to actual infrastructure."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1141,
      "end": 1148,
      "text": " You are still in control of that infrastructure. So it feels like more tooling than actual new solutions."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1148,
      "end": 1151,
      "text": " And I really like that. I'm not sure if I have a preference for one or another."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1151,
      "end": 1156,
      "text": " But I think at the end of the day, they both try to improve the developer experience in different ways."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1156,
      "end": 1161,
      "text": " Given also what you said, looking at all of this innovation,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1161,
      "end": 1170,
      "text": " we mentioned that there will be players competing outside the main cloud vendors,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1170,
      "end": 1174,
      "text": " but also the cloud vendors could be doing something in this space to improve themselves."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1174,
      "end": 1177,
      "text": " So what do you think will happen in the future?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1177,
      "end": 1182,
      "text": " You're going to see a mix because different people require different modes, depending on the context."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1182,
      "end": 1188,
      "text": " If you're a startup and you're just focused on speed, time to market, then simple tooling that abstracts everything for you."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1188,
      "end": 1192,
      "text": " And you don't have to look at all of the complexity under the hood might make a lot of sense."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1192,
      "end": 1197,
      "text": " Or even for enterprises building line of business apps where it's just low code."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1197,
      "end": 1201,
      "text": " They're just looking for low code, simple applications."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1201,
      "end": 1207,
      "text": " I would still say like cloud vendors are going to grow the serverless offerings and hopefully simplify both the services and the tooling."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1207,
      "end": 1210,
      "text": " We mentioned that AWS SAM is kind of going in the right direction."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1210,
      "end": 1214,
      "text": " That should make serverless more compelling for startups and enterprises."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1214,
      "end": 1220,
      "text": " But we can also see services are getting simpler, especially the newer services like EventBridge, Step Functions."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1220,
      "end": 1223,
      "text": " These are really changing how we think about serverless, right?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1223,
      "end": 1226,
      "text": " Because they're completely different offerings."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1226,
      "end": 1233,
      "text": " They have loads and loads of features, but they're not as complex to manage as some of the services that have come before."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1233,
      "end": 1237,
      "text": " So I think we can expect a lot more of both types of innovation from the cloud vendors."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1237,
      "end": 1242,
      "text": " And as well then with the startups and the innovators, third parties."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1242,
      "end": 1249,
      "text": " The issue there, I guess, is that not a lot of large companies are going to build critical infrastructure on top of platforms from startups."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1249,
      "end": 1252,
      "text": " Because of the perceived risk there."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1252,
      "end": 1258,
      "text": " Unless those startups then go and get acquired by the major cloud vendors and get strengthened and grown from there."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1258,
      "end": 1263,
      "text": " So that's going to be a challenge for some of the players like serverless cloud and also some of the serverless database vendors."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1263,
      "end": 1269,
      "text": " They have to mature and validate their offering and reach a certain critical mass before lots of people will flock to them."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1269,
      "end": 1274,
      "text": " We've been here before with Parse, where it was acquired by Facebook and later shut down."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1274,
      "end": 1279,
      "text": " And people have built on top of that mobile backend and lost out as a result."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1279,
      "end": 1282,
      "text": " It does lead us to that initial tease, right?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1282,
      "end": 1287,
      "text": " Who is the best placed challenger for AWS when it comes to the next wave of serverless?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1287,
      "end": 1291,
      "text": " And I throw it out there that the most likely challenger is Microsoft."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1291,
      "end": 1295,
      "text": " And it's not because of Azure, although that is certainly a strong challenger."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1295,
      "end": 1302,
      "text": " But since Microsoft released VS Code and acquired GitHub and then NPM became part of that ecosystem as well,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1302,
      "end": 1307,
      "text": " they've invested a lot in developer tooling and in owning the places where developers live."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1307,
      "end": 1313,
      "text": " So now you can develop code with cloud-based editor or with VS Code on your desktop."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1313,
      "end": 1317,
      "text": " You can build and deploy with GitHub actions to a GitHub repository."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1317,
      "end": 1322,
      "text": " You can have copilot write half the code for you, albeit with some dubious results."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1322,
      "end": 1331,
      "text": " But it's not a big leap for Microsoft or GitHub to add lower code compute and database and keep building out that developer-centric ecosystem."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1331,
      "end": 1335,
      "text": " And it makes perfect sense for that to be very serverless in nature."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1335,
      "end": 1340,
      "text": " So it might be through Azure or it might be done with different branding or a different take."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1340,
      "end": 1343,
      "text": " But I think Microsoft have positioned themselves very well here."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1343,
      "end": 1351,
      "text": " And while AWS is obviously a strong market leader, I think there's a good challenge there."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1351,
      "end": 1355,
      "text": " Microsoft have been smart in how they've aligned themselves well with the developer community."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1355,
      "end": 1358,
      "text": " What do you think? Do you have any other challengers to AWS?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1358,
      "end": 1366,
      "text": " I like your idea that Microsoft maybe, if you look at Azure, I don't know if I would agree, like the state of Azure right now."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1366,
      "end": 1371,
      "text": " But given how Microsoft is positioned more globally, I absolutely agree with your assessment."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1371,
      "end": 1375,
      "text": " They are in a unique position to build something new."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1375,
      "end": 1381,
      "text": " And if they connect all the dots that they already have there and make them even better, I think they are up to something really, really interesting."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1381,
      "end": 1387,
      "text": " So I think it's a good bet. But I have maybe a little bit more controversial one."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1387,
      "end": 1391,
      "text": " And I've been really looking at DigitalOcean in the last few years."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1391,
      "end": 1397,
      "text": " And I think it's an interesting one, even though you wouldn't really associate them with serverless today."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1397,
      "end": 1402,
      "text": " But I really like their approach. They started by just giving you visual machines. It was very simple to get one."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1402,
      "end": 1405,
      "text": " The documentation and the all-over user experience was really, really good."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1405,
      "end": 1408,
      "text": " They put a lot of effort into designing all of that experience."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1408,
      "end": 1413,
      "text": " They put a lot of effort into creating guides, tutorials, case studies."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1413,
      "end": 1416,
      "text": " Also, the pricing model is extremely simplified."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1416,
      "end": 1421,
      "text": " They never really wanted to give you anything that could scale to massive levels."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1421,
      "end": 1427,
      "text": " But for starting, building a small startup, you always got a good offering."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1427,
      "end": 1433,
      "text": " And over the years, they have kept the identity where everything is simple, everything is accessible, the pricing is clear."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1433,
      "end": 1436,
      "text": " Lots of tutorials and good development experience."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1436,
      "end": 1439,
      "text": " But interestingly enough, they also started to expand their own offering."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1439,
      "end": 1443,
      "text": " They started to give databases, Kubernetes, functions as a service."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1443,
      "end": 1448,
      "text": " So it's really interesting to see if they start to invest more into this serverless space."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1448,
      "end": 1453,
      "text": " What's going to happen in the future? Because I really like the way that they're focusing on the developer experience."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1453,
      "end": 1457,
      "text": " So probably they are in a position to address some of the challenges that we just described."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1457,
      "end": 1462,
      "text": " Which at the end of the day, they are mostly all around the developer experience."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1462,
      "end": 1466,
      "text": " And now developers are empowered to actually build cool stuff."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1466,
      "end": 1469,
      "text": " So that's my bet."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1469,
      "end": 1475,
      "text": " I might have other ones. For instance, I really like the direction of things like Code Sandbox or similar tools."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1475,
      "end": 1480,
      "text": " But you might argue that what GitHub is already doing with Codespaces is pretty much in line with that."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1480,
      "end": 1484,
      "text": " So that might be just a component that maybe somebody else is going to acquire."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1484,
      "end": 1489,
      "text": " It's going to require one of the successful comps to be more competitive in that particular direction."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1489,
      "end": 1492,
      "text": " I really like that. It's a really interesting alternative option."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1492,
      "end": 1496,
      "text": " I think all this competition in space hopefully makes it better for everybody."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1496,
      "end": 1498,
      "text": " And that's something that we really need."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1498,
      "end": 1501,
      "text": " So I guess the question as we finish up here is where would you place your bet?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1501,
      "end": 1504,
      "text": " On AWS, DigitalOcean or something else completely?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1504,
      "end": 1506,
      "text": " And what do you think is the future for serverless?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1506,
      "end": 1510,
      "text": " Thanks very much for joining us today. Let us know all your comments on Twitter."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1510,
      "end": 1514,
      "text": " Let us know what you think of all those questions. And thanks for joining us again."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1514,
      "end": 1535,
      "text": " That's all for today. We'll see you next week."
    }
  ]
}