{
  "speakers": {
    "spk_0": "spk_0",
    "spk_1": "spk_1"
  },
  "segments": [
    {
      "speakerLabel": "spk_0",
      "start": 0,
      "end": 4.42,
      "text": " We have updated AWS bytes.com and added transcripts to every single episode."
    },
    {
      "speakerLabel": "spk_0",
      "start": 4.7,
      "end": 9.92,
      "text": " We don't have a massive number of episodes yet, but we're proud to have published 62 episodes so far."
    },
    {
      "speakerLabel": "spk_0",
      "start": 10.26,
      "end": 13.02,
      "text": " So it's no small amount of audio to transcribe."
    },
    {
      "speakerLabel": "spk_0",
      "start": 13.02,
      "end": 17.38,
      "text": " So how did we go about doing all this work and how are we going to be able to keep doing this consistently in the future?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 17.62,
      "end": 20.14,
      "text": " Well, there's a simple answer. Automation and AI."
    },
    {
      "speakerLabel": "spk_0",
      "start": 20.86,
      "end": 24.34,
      "text": " For the longer and more elaborate answer, you'll have to stick around until the end of this episode."
    },
    {
      "speakerLabel": "spk_0",
      "start": 24.34,
      "end": 29.88,
      "text": " We'll tell you how to build your own transcription automation pipeline and we'll also share all of the code for our solution."
    },
    {
      "speakerLabel": "spk_0",
      "start": 29.88,
      "end": 33.96,
      "text": " My name is Eoin, I'm with Luciano and this is the AWS bytes podcast."
    },
    {
      "speakerLabel": "spk_0",
      "start": 40.58,
      "end": 42.58,
      "text": " AWS bytes is sponsored by 4th theorem."
    },
    {
      "speakerLabel": "spk_0",
      "start": 42.58,
      "end": 48.1,
      "text": " 4th theorem is an AWS consulting partner offering training, cloud migration and modern application architecture."
    },
    {
      "speakerLabel": "spk_0",
      "start": 48.1,
      "end": 51.379999999999995,
      "text": " Find out more at 4th theorem.com. You'll find the link in the show notes."
    },
    {
      "speakerLabel": "spk_0",
      "start": 51.38,
      "end": 54.580000000000005,
      "text": " Since this is the first episode of 2023, happy new year to everyone."
    },
    {
      "speakerLabel": "spk_0",
      "start": 54.580000000000005,
      "end": 57.540000000000006,
      "text": " We're glad to be back publishing new episodes after the break."
    },
    {
      "speakerLabel": "spk_0",
      "start": 57.540000000000006,
      "end": 59.940000000000005,
      "text": " So back to transcripts for this podcast."
    },
    {
      "speakerLabel": "spk_0",
      "start": 59.940000000000005,
      "end": 64.58,
      "text": " Luciano, can you start maybe by giving a quick recap of what the actual need is?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 64.58,
      "end": 66.58,
      "text": " What problem are we solving?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 66.58,
      "end": 71.14,
      "text": " Of course. So yeah, this is a podcast and basically in every episode we talk a lot."
    },
    {
      "speakerLabel": "spk_1",
      "start": 71.14,
      "end": 75.14,
      "text": " We say a lot of nonsense. Sometimes we say also something interesting, at least I hope."
    },
    {
      "speakerLabel": "spk_1",
      "start": 75.7,
      "end": 79.7,
      "text": " And of course it would be great if we could provide together with the videos"
    },
    {
      "speakerLabel": "spk_1",
      "start": 79.7,
      "end": 83.86,
      "text": " and the audio files also proper transcripts."
    },
    {
      "speakerLabel": "spk_1",
      "start": 83.86,
      "end": 89.06,
      "text": " And that would be nice if we can do that consistently for every single episode."
    },
    {
      "speakerLabel": "spk_1",
      "start": 89.06,
      "end": 93.54,
      "text": " When the episode comes out it is also available in a text format basically."
    },
    {
      "speakerLabel": "spk_1",
      "start": 93.54,
      "end": 98.9,
      "text": " So people who prefer to read this conversation rather than just consuming the video or the audio format,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 98.9,
      "end": 103.54,
      "text": " they can just simply use that transcript as a way to consume the information we are trying to share."
    },
    {
      "speakerLabel": "spk_1",
      "start": 104.82000000000001,
      "end": 109.46000000000001,
      "text": " Also transcripts are very useful because they can be used for search engine optimization"
    },
    {
      "speakerLabel": "spk_1",
      "start": 109.46,
      "end": 113.46,
      "text": " we embedded them in our own website with the hope that that contributes"
    },
    {
      "speakerLabel": "spk_1",
      "start": 113.46,
      "end": 118.74,
      "text": " to make our content more discoverable because on the web we provide a better description for"
    },
    {
      "speakerLabel": "spk_1",
      "start": 118.74,
      "end": 124.02,
      "text": " the kind of content we are producing. And in general transcripts can also help people"
    },
    {
      "speakerLabel": "spk_1",
      "start": 124.02,
      "end": 129.38,
      "text": " even just watching the video or listening to the audio to easily find exactly what is the place"
    },
    {
      "speakerLabel": "spk_1",
      "start": 129.38,
      "end": 133.7,
      "text": " where we were talking about a specific concept. Maybe they are listening to an episode again"
    },
    {
      "speakerLabel": "spk_1",
      "start": 133.7,
      "end": 137.45999999999998,
      "text": " because there is something they want to refresh so maybe they remember that we talk somewhere"
    },
    {
      "speakerLabel": "spk_1",
      "start": 137.46,
      "end": 141.78,
      "text": " about step functions they can easily search in the transcript just to exactly figure out at"
    },
    {
      "speakerLabel": "spk_1",
      "start": 141.78,
      "end": 148.74,
      "text": " which point we start to talk about that particular topic. So definitely there is value in creating"
    },
    {
      "speakerLabel": "spk_1",
      "start": 148.74,
      "end": 153.78,
      "text": " all these transcripts but yeah the main question is how did we do that? How can we generate"
    },
    {
      "speakerLabel": "spk_1",
      "start": 153.78,
      "end": 159.70000000000002,
      "text": " transcripts in general? What did we do?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 159.70000000000002,
      "end": 164.74,
      "text": " Yeah this is something we've looked at a few times in the past and never found any ideal option until very recently. So some of the options are like doing"
    },
    {
      "speakerLabel": "spk_0",
      "start": 164.74,
      "end": 170.5,
      "text": " it manually hiring somebody who's professional at this. The other one is grabbing the closed"
    },
    {
      "speakerLabel": "spk_0",
      "start": 170.5,
      "end": 173.94,
      "text": " captions that are automatically generated by YouTube because all our episodes are already"
    },
    {
      "speakerLabel": "spk_0",
      "start": 173.94,
      "end": 179.14000000000001,
      "text": " on YouTube or we can generate them in another way. So having someone do it manually like having a"
    },
    {
      "speakerLabel": "spk_0",
      "start": 179.14000000000001,
      "end": 183.06,
      "text": " professional individual like a freelancer or a company who specializes in this is appealing"
    },
    {
      "speakerLabel": "spk_0",
      "start": 183.06,
      "end": 187.38,
      "text": " because it leads to really high quality results by people who do this all the time. The"
    },
    {
      "speakerLabel": "spk_0",
      "start": 187.38,
      "end": 191.54000000000002,
      "text": " disadvantage really the main hurdle is that it takes time to find somebody who's reliable enough"
    },
    {
      "speakerLabel": "spk_0",
      "start": 191.54,
      "end": 195.29999999999998,
      "text": " and build a relationship with them and set up that whole process. It can also be expensive"
    },
    {
      "speakerLabel": "spk_0",
      "start": 195.29999999999998,
      "end": 199.78,
      "text": " depending on your budget and then you have communication back and forth that can introduce"
    },
    {
      "speakerLabel": "spk_0",
      "start": 199.78,
      "end": 204.98,
      "text": " a delay every time you need to publish an episode. So overall because it adds to the lead time it's"
    },
    {
      "speakerLabel": "spk_0",
      "start": 204.98,
      "end": 211.94,
      "text": " something we were pretty reluctant to do. Regarding YouTube closed captions we could have done this"
    },
    {
      "speakerLabel": "spk_0",
      "start": 211.94,
      "end": 216.98,
      "text": " pretty I suppose integrated this into our workflow after we publish a new video on YouTube we could"
    },
    {
      "speakerLabel": "spk_0",
      "start": 216.98,
      "end": 221.7,
      "text": " wait for some time for YouTube to generate those closed captions and then try and integrate some"
    },
    {
      "speakerLabel": "spk_0",
      "start": 221.7,
      "end": 226.17999999999998,
      "text": " code to download them and integrate them into the build process. That seems like a decent enough"
    },
    {
      "speakerLabel": "spk_0",
      "start": 226.17999999999998,
      "end": 230.73999999999998,
      "text": " solution but there's two major problems with it. Number one the quality of the transcripts isn't"
    },
    {
      "speakerLabel": "spk_0",
      "start": 230.73999999999998,
      "end": 234.73999999999998,
      "text": " that great it lacks kind of punctuation and grammar and sentences and that sort of stuff"
    },
    {
      "speakerLabel": "spk_0",
      "start": 235.78,
      "end": 240.89999999999998,
      "text": " and additionally the YouTube transcripts don't identify different speakers so if you just"
    },
    {
      "speakerLabel": "spk_0",
      "start": 240.89999999999998,
      "end": 245.7,
      "text": " converted it into a blog a wall of text it would be literally that just a wall of kind of stream"
    },
    {
      "speakerLabel": "spk_0",
      "start": 245.7,
      "end": 252.17999999999998,
      "text": " of consciousness text without any punctuation or identification of speakers. So the last"
    },
    {
      "speakerLabel": "spk_0",
      "start": 252.17999999999998,
      "end": 257.14,
      "text": " solution left is to kind of generate the transcripts ourselves somehow and since this is"
    },
    {
      "speakerLabel": "spk_0",
      "start": 257.14,
      "end": 262.74,
      "text": " an AWS podcast it's to be expected that we would use something like Amazon Transcribe which is AWS's"
    },
    {
      "speakerLabel": "spk_0",
      "start": 262.74,
      "end": 269.21999999999997,
      "text": " managed service to perform speech to text. So you give it an audio file and it gives you back text"
    },
    {
      "speakerLabel": "spk_0",
      "start": 269.78,
      "end": 273.46,
      "text": " and we like the simplicity of that we're always advocating for using managed services"
    },
    {
      "speakerLabel": "spk_0",
      "start": 273.46,
      "end": 278.26,
      "text": " you can use the transcribe SDK or the API to generate the transcription in a programmatic way"
    },
    {
      "speakerLabel": "spk_0",
      "start": 280.26,
      "end": 285.14,
      "text": " with a transcribed client you call the start transcription API and provide reference to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 285.14,
      "end": 293.53999999999996,
      "text": " an audio file and an output prefix and it will generate that as a JSON file it can also generate"
    },
    {
      "speakerLabel": "spk_0",
      "start": 293.53999999999996,
      "end": 300.17999999999995,
      "text": " subtitles formats like SRT and WebVTT. So it runs in batch mode it can also do real-time"
    },
    {
      "speakerLabel": "spk_0",
      "start": 300.18,
      "end": 304.82,
      "text": " transcriptions but we would be using batch mode for this since it's kind of for on-demand content"
    },
    {
      "speakerLabel": "spk_0",
      "start": 304.82,
      "end": 310.5,
      "text": " and you can get notified with EventBridge when it's finished. Luciano do you want to talk about"
    },
    {
      "speakerLabel": "spk_0",
      "start": 310.5,
      "end": 317.38,
      "text": " what the pros and cons of transcribe are and like why we ultimately ended up kind of using it but"
    },
    {
      "speakerLabel": "spk_0",
      "start": 317.38,
      "end": 325.14,
      "text": " not entirely?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 325.14,
      "end": 329.38,
      "text": " Yeah of course so transcribe is quite good because it gives us that feature that we really liked and we we felt it was missing on YouTube which is basically you get different"
    },
    {
      "speakerLabel": "spk_1",
      "start": 329.38,
      "end": 333.7,
      "text": " speakers you get a label that tells you this person is starting to talk another person is"
    },
    {
      "speakerLabel": "spk_1",
      "start": 333.7,
      "end": 339.14,
      "text": " starting to talk from this point so we can retain in a text format that feeling that this is just"
    },
    {
      "speakerLabel": "spk_1",
      "start": 339.14,
      "end": 345.46,
      "text": " not a wall of text but it's an actual conversation between multiple people. Unfortunately actually"
    },
    {
      "speakerLabel": "spk_1",
      "start": 345.46,
      "end": 351.3,
      "text": " there is another one good thing that you can customize it so you can add custom models and"
    },
    {
      "speakerLabel": "spk_1",
      "start": 351.3,
      "end": 358.58,
      "text": " vocabularies to fine-tune the results so if you have a very specific domain you can basically put"
    },
    {
      "speakerLabel": "spk_1",
      "start": 358.58,
      "end": 364.34,
      "text": " more work into it and get more accurate results but in general we were not satisfied with the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 364.34,
      "end": 370.58,
      "text": " level of quality. It is not that bad I think it's still quite a good tool so you can use it for most"
    },
    {
      "speakerLabel": "spk_1",
      "start": 370.58,
      "end": 378.5,
      "text": " things but for the kind of scope that we had in mind we feel that good and perfect are very"
    },
    {
      "speakerLabel": "spk_1",
      "start": 378.5,
      "end": 387.78,
      "text": " noticeable points like we were aiming for the 99% good while transcribed maybe around the 97%"
    },
    {
      "speakerLabel": "spk_1",
      "start": 387.78,
      "end": 394.17999999999995,
      "text": " good and we feel that that 2% of a difference is actually quite noticeable when you are reading"
    },
    {
      "speakerLabel": "spk_1",
      "start": 394.17999999999995,
      "end": 399.94,
      "text": " some text and you expect it to be higher quality so we were looking for something that could be a"
    },
    {
      "speakerLabel": "spk_1",
      "start": 399.94,
      "end": 406.34,
      "text": " little bit better so that basically led us to explore other avenues and pretty much during the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 406.34,
      "end": 413.14,
      "text": " same time where we were looking for an alternative there was a blog announcement by OpenAI that"
    },
    {
      "speakerLabel": "spk_1",
      "start": 413.14,
      "end": 418.65999999999997,
      "text": " introduced this new tool called Whisper which is effectively another tool to do text-to-speech so"
    },
    {
      "speakerLabel": "spk_1",
      "start": 418.65999999999997,
      "end": 424.97999999999996,
      "text": " to try to recognize text and convert speech and convert it to text so this came around"
    },
    {
      "speakerLabel": "spk_1",
      "start": 426.5,
      "end": 431.46,
      "text": " last September I think and we are going to be linking the announcement blog post in the show"
    },
    {
      "speakerLabel": "spk_1",
      "start": 431.46,
      "end": 437.62,
      "text": " notes it's the same group of people that created chat, gpt and dali so you probably heard of them"
    },
    {
      "speakerLabel": "spk_1",
      "start": 437.62,
      "end": 443.06,
      "text": " because right now their products are all the rage and Whisper is probably the least known of these"
    },
    {
      "speakerLabel": "spk_1",
      "start": 443.06,
      "end": 448.1,
      "text": " three but nonetheless it's a very interesting product and we were really excited to try it"
    },
    {
      "speakerLabel": "spk_1",
      "start": 448.1,
      "end": 454.98,
      "text": " so we quickly spin it up and tested it and we were definitely blown away by the level of accuracy"
    },
    {
      "speakerLabel": "spk_1",
      "start": 455.78000000000003,
      "end": 460.66,
      "text": " so we immediately thought okay we want to use this because this is giving us the level of quality"
    },
    {
      "speakerLabel": "spk_1",
      "start": 460.66,
      "end": 465.38,
      "text": " that we want to provide in the end and if we can automate all of that process this is going to be"
    },
    {
      "speakerLabel": "spk_1",
      "start": 465.38,
      "end": 470.1,
      "text": " something that we can keep doing very easily without too much overhead in our existing process"
    },
    {
      "speakerLabel": "spk_1",
      "start": 471.06,
      "end": 476.34,
      "text": " still it wasn't perfect unfortunately there were a few small problems one is that it did not"
    },
    {
      "speakerLabel": "spk_1",
      "start": 476.34,
      "end": 480.82,
      "text": " distinguish between speakers so on one side we're getting more accuracy but again we are losing that"
    },
    {
      "speakerLabel": "spk_1",
      "start": 480.82,
      "end": 486.34,
      "text": " ability to distinguish the speakers and the other thing is that it's not built in in AWS as a managed"
    },
    {
      "speakerLabel": "spk_1",
      "start": 486.34,
      "end": 491.94,
      "text": " offering so if we were to productionize so to speak this solution in AWS we'll need to figure"
    },
    {
      "speakerLabel": "spk_1",
      "start": 491.94,
      "end": 499.14,
      "text": " out exactly how do we take the model and run it in AWS so Owen do you want to detail our solution"
    },
    {
      "speakerLabel": "spk_0",
      "start": 504.5,
      "end": 511.22,
      "text": " in the end yeah exactly so we wanted to get the best of both worlds right so we have OpenAI Whisper which is this fantastic model that you can run it's basically they deliver it as a container"
    },
    {
      "speakerLabel": "spk_0",
      "start": 511.22,
      "end": 516.18,
      "text": " that you can run and as a very nice user-friendly developer friendly interface where you just give"
    },
    {
      "speakerLabel": "spk_0",
      "start": 516.18,
      "end": 520.42,
      "text": " it an audio file and it gives you the transcript might be worth mentioning that can also do"
    },
    {
      "speakerLabel": "spk_0",
      "start": 520.42,
      "end": 525.38,
      "text": " translations as well so if you want to transcribe but also generate Italian text or even transcribe"
    },
    {
      "speakerLabel": "spk_0",
      "start": 525.38,
      "end": 532.5,
      "text": " from different languages into English this is something that's really good at too it we did run"
    },
    {
      "speakerLabel": "spk_0",
      "start": 532.5,
      "end": 537.78,
      "text": " it standalone it comes in different sizes so you have it depending on your compute resources"
    },
    {
      "speakerLabel": "spk_0",
      "start": 537.78,
      "end": 543.06,
      "text": " available to you you can run the tiny model small model the medium model or the large model but if"
    },
    {
      "speakerLabel": "spk_0",
      "start": 543.06,
      "end": 547.06,
      "text": " you want to use anything and get a result within a reasonable period of time like even less than 30"
    },
    {
      "speakerLabel": "spk_0",
      "start": 547.06,
      "end": 552.42,
      "text": " minutes you probably need a GPU so that's something that's worth bearing in mind with OpenAI so our"
    },
    {
      "speakerLabel": "spk_0",
      "start": 552.42,
      "end": 557.9399999999999,
      "text": " solution what we wanted to do was use the accuracy of the OpenAI Whisper transcript but take the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 557.9399999999999,
      "end": 564.42,
      "text": " speaker labels from the Amazon transcribe output output so that we'd have an accurate labeled time"
    },
    {
      "speakerLabel": "spk_0",
      "start": 564.42,
      "end": 569.9399999999999,
      "text": " linked transcript and merge the results and end up with a JSON file that we could use to generate"
    },
    {
      "speakerLabel": "spk_0",
      "start": 569.94,
      "end": 577.3800000000001,
      "text": " a transcript for the website with sections that say this is what Owen said this is what Luciano"
    },
    {
      "speakerLabel": "spk_0",
      "start": 577.3800000000001,
      "end": 584.34,
      "text": " said and make it readable for people almost like a blog post right so we built this using step"
    },
    {
      "speakerLabel": "spk_0",
      "start": 584.34,
      "end": 589.94,
      "text": " functions it's using SageMaker so that we can run that Whisper model with the GPU and it's also using"
    },
    {
      "speakerLabel": "spk_0",
      "start": 589.94,
      "end": 597.1400000000001,
      "text": " lambda for lots of little transformation efforts like if the input audio file isn't an mp3 we"
    },
    {
      "speakerLabel": "spk_0",
      "start": 597.14,
      "end": 603.06,
      "text": " convert it to mp3 because transcribe it's one of the formats it supports and sometimes we're using"
    },
    {
      "speakerLabel": "spk_0",
      "start": 603.06,
      "end": 610.26,
      "text": " m4a audio and transcribe doesn't natively support that so how do we do this how do we even kick off"
    },
    {
      "speakerLabel": "spk_0",
      "start": 610.26,
      "end": 614.18,
      "text": " this process well after we finish recording an episode of AWS bytes we do a bit of editing we"
    },
    {
      "speakerLabel": "spk_0",
      "start": 614.18,
      "end": 619.86,
      "text": " create a video and we create an audio file that audio file gets pushed up to anchor which"
    },
    {
      "speakerLabel": "spk_0",
      "start": 619.86,
      "end": 624.9,
      "text": " distributes the podcast to all the podcast channels but we also take that audio now and we"
    },
    {
      "speakerLabel": "spk_0",
      "start": 624.9,
      "end": 629.9399999999999,
      "text": " copy it into an s3 bucket and that kicks off a whole automated process with this step function"
    },
    {
      "speakerLabel": "spk_0",
      "start": 631.3,
      "end": 637.06,
      "text": " we of course we had the previous 61 episodes or so to consider so we also had to do a backfilling"
    },
    {
      "speakerLabel": "spk_0",
      "start": 637.06,
      "end": 644.1,
      "text": " process so we pulled down the RSS feed and kicked off this process for each of the 61 previous"
    },
    {
      "speakerLabel": "spk_0",
      "start": 644.1,
      "end": 650.66,
      "text": " episodes by copying that audio up to s3 and interestingly I suppose it's worth mentioning"
    },
    {
      "speakerLabel": "spk_0",
      "start": 650.66,
      "end": 655.38,
      "text": " that you know there is a cost associated with us probably a lot of people will be wondering what"
    },
    {
      "speakerLabel": "spk_0",
      "start": 655.38,
      "end": 660.18,
      "text": " is the cost to run this because we have to run SageMaker with a GPU we also have to use transcribe"
    },
    {
      "speakerLabel": "spk_0",
      "start": 660.18,
      "end": 664.1,
      "text": " both of those things can be expensive if you use them at scale we talked about that in our previous"
    },
    {
      "speakerLabel": "spk_0",
      "start": 664.1,
      "end": 669.38,
      "text": " episode on AI services I we did work this out I can't recall exactly the channel was around"
    },
    {
      "speakerLabel": "spk_0",
      "start": 669.38,
      "end": 675.3,
      "text": " it was definitely less than a dollar per episode for the whole process to run so it's not too"
    },
    {
      "speakerLabel": "spk_0",
      "start": 675.3,
      "end": 680.9,
      "text": " ominous compared to other alternatives at all I would say so is it worthwhile talking about some"
    },
    {
      "speakerLabel": "spk_0",
      "start": 680.9,
      "end": 684.66,
      "text": " of the orchestration here how does it all fit together we mentioned we have step functions"
    },
    {
      "speakerLabel": "spk_0",
      "start": 684.66,
      "end": 689.62,
      "text": " right so we pre-process the input if needed with ffmpeg we trigger the two transcription jobs at"
    },
    {
      "speakerLabel": "spk_0",
      "start": 689.62,
      "end": 696.74,
      "text": " the same time so the transcribe job and the SageMaker job transcribe means we have to use"
    },
    {
      "speakerLabel": "spk_0",
      "start": 696.74,
      "end": 702.9,
      "text": " the AWS SDK within step functions and then kind of pull until it's complete with SageMaker we've"
    },
    {
      "speakerLabel": "spk_0",
      "start": 702.9,
      "end": 706.5,
      "text": " got like a more native integration with step functions where we could just say run this batch"
    },
    {
      "speakerLabel": "spk_0",
      "start": 706.5,
      "end": 712.1,
      "text": " transform job that'll kick off a docker container in the background with the right um compute"
    },
    {
      "speakerLabel": "spk_0",
      "start": 712.1,
      "end": 718.9,
      "text": " resources it will pass our input audio into it it can run a batch of jobs the way we set it up"
    },
    {
      "speakerLabel": "spk_0",
      "start": 718.9,
      "end": 723.6999999999999,
      "text": " we generally just do one transcription at a time because we're only doing one a week and when we"
    },
    {
      "speakerLabel": "spk_0",
      "start": 723.6999999999999,
      "end": 728.26,
      "text": " get both results then step functions will allow us to take both of those inputs and kick off a"
    },
    {
      "speakerLabel": "spk_0",
      "start": 728.26,
      "end": 734.66,
      "text": " lambda to process the results so that's like essentially taking these two both set both"
    },
    {
      "speakerLabel": "spk_0",
      "start": 734.66,
      "end": 740.5,
      "text": " systems will give you a set of segments with start times and end times one of them has speaker labels"
    },
    {
      "speakerLabel": "spk_0",
      "start": 740.5,
      "end": 745.78,
      "text": " so we have to do this run this algorithm essentially to merge the two what else is there"
    },
    {
      "speakerLabel": "spk_1",
      "start": 751.62,
      "end": 757.78,
      "text": " to mention in this process what other bells and whistles do we have there are some additional things that we do to try to to get a little bit higher quality with our final result so for"
    },
    {
      "speakerLabel": "spk_1",
      "start": 757.78,
      "end": 763.14,
      "text": " instance we noticed uh very common mistakes for some reason we spell doesn't like our names"
    },
    {
      "speakerLabel": "spk_1",
      "start": 763.14,
      "end": 768.18,
      "text": " like it was getting my name wrong a few times it was mostly getting your name correctly owen but"
    },
    {
      "speakerLabel": "spk_1",
      "start": 768.18,
      "end": 775.06,
      "text": " spelled in a different way i think that is that i just yeah just too many ways so it was interesting"
    },
    {
      "speakerLabel": "spk_1",
      "start": 775.06,
      "end": 779.78,
      "text": " that it was getting correctly but just the spelling of course yeah you need to guess which"
    },
    {
      "speakerLabel": "spk_1",
      "start": 779.78,
      "end": 784.9,
      "text": " which spelling is the right one so we basically figured it out there are also some other cases"
    },
    {
      "speakerLabel": "spk_1",
      "start": 784.9,
      "end": 790.9,
      "text": " where for instance name of services in aws sometimes were be consistently wrong or some"
    },
    {
      "speakerLabel": "spk_1",
      "start": 790.9,
      "end": 795.54,
      "text": " small things like that so basically we by reviewing the first results we created a dictionary"
    },
    {
      "speakerLabel": "spk_1",
      "start": 795.54,
      "end": 802.9,
      "text": " and we pass the output and apply what substitution wherever we see these common errors and we apply"
    },
    {
      "speakerLabel": "spk_1",
      "start": 802.9,
      "end": 807.62,
      "text": " the correction so all of that is somewhat automated and we can keep improving our dictionary"
    },
    {
      "speakerLabel": "spk_1",
      "start": 807.62,
      "end": 814.9,
      "text": " as we find more issues like that then the other thing is that at the end of the day our website"
    },
    {
      "speakerLabel": "spk_1",
      "start": 814.9,
      "end": 819.7,
      "text": " is that the place where we want to output this result in a way that is visible to people and"
    },
    {
      "speakerLabel": "spk_1",
      "start": 819.7,
      "end": 826.1,
      "text": " they can consume it so we need somehow to hook this entire project into the process that builds"
    },
    {
      "speakerLabel": "spk_1",
      "start": 826.1,
      "end": 832.02,
      "text": " our website and our website is also open source we'll put the link in the show notes is a static"
    },
    {
      "speakerLabel": "spk_1",
      "start": 832.02,
      "end": 837.6999999999999,
      "text": " website built with 11d so what we do is basically every week every time there is a new episode we"
    },
    {
      "speakerLabel": "spk_1",
      "start": 837.6999999999999,
      "end": 843.14,
      "text": " trigger a new build and that will generate a new version of the entire website all the html pages"
    },
    {
      "speakerLabel": "spk_1",
      "start": 843.14,
      "end": 850.5,
      "text": " assets and so on and publish that online on a cdn so what we wanted to do is somehow integrate"
    },
    {
      "speakerLabel": "spk_1",
      "start": 850.5,
      "end": 857.6999999999999,
      "text": " this process to be able to hook into our website build process and we thought that it would be very"
    },
    {
      "speakerLabel": "spk_1",
      "start": 857.7,
      "end": 864.26,
      "text": " nice if the step function could just do a pr just trying to send the generated file directly into"
    },
    {
      "speakerLabel": "spk_1",
      "start": 864.26,
      "end": 869.38,
      "text": " the repository for our website so we did all of that with an additional lambda at the end of the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 869.38,
      "end": 876.58,
      "text": " process so you might be wondering at this point did we manage to fully automate everything and"
    },
    {
      "speakerLabel": "spk_1",
      "start": 876.58,
      "end": 882.9000000000001,
      "text": " i will say unfortunately not entirely yes but i think we are close enough we definitely reduced"
    },
    {
      "speakerLabel": "spk_1",
      "start": 882.9,
      "end": 888.9,
      "text": " all the manual work to the bare minimum and but what's left to do what's what we still need to do"
    },
    {
      "speakerLabel": "spk_1",
      "start": 888.9,
      "end": 895.14,
      "text": " manually or at least we want to do manually to retain a decent level of quality there so this is"
    },
    {
      "speakerLabel": "spk_1",
      "start": 895.14,
      "end": 900.5,
      "text": " also the reason why we we do a pr because first of all it gives us an opportunity to review the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 900.5,
      "end": 906.18,
      "text": " result of our transcript before it gets merged and the other interesting thing is that the pr"
    },
    {
      "speakerLabel": "spk_1",
      "start": 906.18,
      "end": 912.34,
      "text": " effective is just publishing trying to publish a json file in our website repository this json file"
    },
    {
      "speakerLabel": "spk_1",
      "start": 912.34,
      "end": 919.62,
      "text": " is not ready to go straight away because the speaker identification is just telling us something"
    },
    {
      "speakerLabel": "spk_1",
      "start": 919.62,
      "end": 924.82,
      "text": " like speaker 0 and speaker 1 is not able to tell we which one is which depending on the voice is"
    },
    {
      "speakerLabel": "spk_1",
      "start": 924.82,
      "end": 930.26,
      "text": " just distinguishing between between two different people so we need to quickly look up who is the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 930.26,
      "end": 936.74,
      "text": " first person to talk and just assign the name to to the right label so this is something we can"
    },
    {
      "speakerLabel": "spk_1",
      "start": 936.74,
      "end": 943.22,
      "text": " easily do manually directly from the github ui by editing the pr and in the process we also quickly"
    },
    {
      "speakerLabel": "spk_1",
      "start": 943.22,
      "end": 948.34,
      "text": " review we just eyeball the entire text and if we spot any other obvious mistake we can easily fix"
    },
    {
      "speakerLabel": "spk_1",
      "start": 948.34,
      "end": 957.38,
      "text": " it manually before merging the pr so i think that describes more or less the process and what do we"
    },
    {
      "speakerLabel": "spk_0",
      "start": 963.7,
      "end": 969.1400000000001,
      "text": " do in an automated fashion and what we still do manually what else do we want to share yeah i think just to summarize i think this has really been a i i step forward in the transcription"
    },
    {
      "speakerLabel": "spk_0",
      "start": 969.1400000000001,
      "end": 972.6600000000001,
      "text": " technology and i'm really happy with the level of automation we now have i think it's just the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 972.6600000000001,
      "end": 978.5,
      "text": " right balance between manual effort and automation it's great that you can now use ai and be really"
    },
    {
      "speakerLabel": "spk_0",
      "start": 978.5,
      "end": 982.74,
      "text": " confident that you've got a result that people can read without finding it kind of jarring or"
    },
    {
      "speakerLabel": "spk_0",
      "start": 982.74,
      "end": 989.7800000000001,
      "text": " distracting to read um some of the things that it it really surprised me with open ai whisper is"
    },
    {
      "speakerLabel": "spk_0",
      "start": 989.78,
      "end": 994.98,
      "text": " how you mentioned like product names and aws service names it seems to just know what they"
    },
    {
      "speakerLabel": "spk_0",
      "start": 994.98,
      "end": 999.9399999999999,
      "text": " are and get them right most of the time some of the things where it's less accurate is just things"
    },
    {
      "speakerLabel": "spk_0",
      "start": 999.9399999999999,
      "end": 1005.62,
      "text": " that are hard to predict like aws bytes isn't exactly a top international brand yet so sometimes"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1005.62,
      "end": 1010.18,
      "text": " it would spell it with b y t e s instead of b i t e s so there are some things where you'll always"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1010.18,
      "end": 1015.54,
      "text": " have to do those vocabulary substitutions you mentioned but overall i think this is just mostly"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1015.54,
      "end": 1020.26,
      "text": " mostly hands off and you end up with a really good result for very little cost so if this is"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1020.26,
      "end": 1024.5,
      "text": " something you want to do for your own podcast the good news is that everything we just told you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1024.5,
      "end": 1030.74,
      "text": " about is open source so you can find a repo on github it's called pod whisperer in as a tribute"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1030.74,
      "end": 1035.1399999999999,
      "text": " to open ai whisper because this is primarily aimed at podcasts but of course you can use this for"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1035.1399999999999,
      "end": 1040.42,
      "text": " transcribing meetings any other kind of audio you could think of you can follow the instructions in"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1040.42,
      "end": 1044.34,
      "text": " the readme and deploy this into your own aws account so feel free to contribute back to the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1044.34,
      "end": 1047.4599999999998,
      "text": " project if you think there's something missing improvements you'd like to make something you'd"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1047.4599999999998,
      "end": 1052.6599999999999,
      "text": " like to change and we'd really love to hear from you and we'd gratefully appreciate the chance to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1052.6599999999999,
      "end": 1057.86,
      "text": " grow this and spread it around even further this is all we have for this episode we hope you liked"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1057.86,
      "end": 1062.1799999999998,
      "text": " it and we look forward to hearing your feedback on our transcripts by the way if you happen to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1062.1799999999998,
      "end": 1066.1,
      "text": " find a mistake in one of our transcripts you can easily submit a pr like luchiano said the link"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1066.1,
      "end": 1071.4599999999998,
      "text": " will be in the show notes to the aws bytes static website repo um it will help us fix the issue and"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1071.46,
      "end": 1075.78,
      "text": " improve the quality of what we're doing it's really nice to have everybody contributing to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1075.78,
      "end": 1101.94,
      "text": " the podcast we're really enjoying that so far so thank you and we'll see you in the next episode"
    }
  ]
}