{
  "speakers": {
    "spk_0": "Luciano",
    "spk_1": "Eoin"
  },
  "segments": [
    {
      "speakerLabel": "spk_0",
      "start": 0,
      "end": 4.08,
      "text": " If you have been using AWS for a while, chances are that you have already heard the term"
    },
    {
      "speakerLabel": "spk_0",
      "start": 4.08,
      "end": 8.64,
      "text": " well-architected. It might seem like something obvious at first, but do you really know what"
    },
    {
      "speakerLabel": "spk_0",
      "start": 8.64,
      "end": 13.44,
      "text": " this term actually means? Would you be able to provide your own definition if somebody asks you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 13.44,
      "end": 18.400000000000002,
      "text": " what well-architected actually means? Now, if you're hesitant to try to give an answer to this"
    },
    {
      "speakerLabel": "spk_0",
      "start": 18.400000000000002,
      "end": 22.32,
      "text": " question, this episode is for you. Today, we are going to cover what does it mean to be well-architected"
    },
    {
      "speakerLabel": "spk_0",
      "start": 22.32,
      "end": 27.76,
      "text": " in general and in the context of AWS. We will discuss the Well-Architected Framework"
    },
    {
      "speakerLabel": "spk_0",
      "start": 27.76,
      "end": 32.800000000000004,
      "text": " and all the different tools and facets that revolve around this particular framework. Finally, and"
    },
    {
      "speakerLabel": "spk_0",
      "start": 32.800000000000004,
      "end": 36.480000000000004,
      "text": " that's probably the most important part of this episode, we will try to answer some very practical"
    },
    {
      "speakerLabel": "spk_0",
      "start": 36.480000000000004,
      "end": 41.28,
      "text": " questions such as should you care about building well-architected workloads? And if you care, how"
    },
    {
      "speakerLabel": "spk_0",
      "start": 41.28,
      "end": 44.96,
      "text": " do you even know if your workloads are well-architected? What if you find out that your"
    },
    {
      "speakerLabel": "spk_0",
      "start": 44.96,
      "end": 49.120000000000005,
      "text": " workloads are not well-architected? What do you even do? Where do you even start? How can you make them better?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 49.120000000000005,
      "end": 53.6,
      "text": " So let's dive in. My name is Luciiano. Today I'm joined by Eoin and we are happy to present you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 53.6,
      "end": 68.4,
      "text": " another episode of AWS Bites podcast. AWS Bytes is sponsored by fourTheorem. fourTheorem is an AWS"
    },
    {
      "speakerLabel": "spk_0",
      "start": 68.4,
      "end": 72.8,
      "text": " consulting partner offering training, cloud migration, and modern application architecture."
    },
    {
      "speakerLabel": "spk_0",
      "start": 72.8,
      "end": 76.72,
      "text": " Find out more at fourtheorem.com and you will find this link in the show notes."
    },
    {
      "speakerLabel": "spk_0",
      "start": 77.92,
      "end": 83.36,
      "text": " So we said well-architected is a very loaded term. Let's start by trying to give a generic"
    },
    {
      "speakerLabel": "spk_0",
      "start": 83.36,
      "end": 89.92,
      "text": " definition of what we mean with that particular term. I think in general when we say well-architected"
    },
    {
      "speakerLabel": "spk_0",
      "start": 89.92,
      "end": 94.72,
      "text": " we refer to the quality of a system of being well designed in regards to certain things like security, reliability, performance, costs, etc."
    },
    {
      "speakerLabel": "spk_0",
      "start": 94.72,
      "end": 101.12,
      "text": " A well-architected system should follow modern best"
    },
    {
      "speakerLabel": "spk_0",
      "start": 101.12,
      "end": 106.4,
      "text": " practices and we should make sure that it can deliver the value that is supposed to be delivered"
    },
    {
      "speakerLabel": "spk_0",
      "start": 106.4,
      "end": 112.88,
      "text": " to the users in the more consistent way. And at the same time it should be easy to operate for"
    },
    {
      "speakerLabel": "spk_0",
      "start": 112.88,
      "end": 118.47999999999999,
      "text": " the company, should be cost effective, and so on. So saying that something is well-architected can"
    },
    {
      "speakerLabel": "spk_0",
      "start": 118.47999999999999,
      "end": 122.64,
      "text": " also be a little bit subjective because if you ask different people they can give you very different"
    },
    {
      "speakerLabel": "spk_0",
      "start": 122.64,
      "end": 127.28,
      "text": " definitions of what it means to be well-architected. Probably something based on their own experiences,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 127.28,
      "end": 131.04,
      "text": " something based on what they've done in the past, the solutions that they know,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 131.04,
      "end": 135.28,
      "text": " the cloud providers, all the tools that they've been using the most. And if you get people with"
    },
    {
      "speakerLabel": "spk_0",
      "start": 135.28,
      "end": 139.68,
      "text": " very different backgrounds chances are that their answer will be very very different."
    },
    {
      "speakerLabel": "spk_0",
      "start": 139.68,
      "end": 145.76000000000002,
      "text": " So there might be a little bit of source of confusion when we talk about this terminology"
    },
    {
      "speakerLabel": "spk_0",
      "start": 145.76000000000002,
      "end": 150.56,
      "text": " in general sense but even more when we talk about this particular term in the context of AWS."
    },
    {
      "speakerLabel": "spk_0",
      "start": 150.56,
      "end": 153.6,
      "text": " So where does that confusion come from, Eoin, Do you have an opinion?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 159.76000000000002,
      "end": 165.84,
      "text": " Yeah, well it's definitely subjective but at least I would say in the context of AWS they have used the term well-architected for a whole umbrella of tooling and documentation"
    },
    {
      "speakerLabel": "spk_1",
      "start": 165.84,
      "end": 170.64000000000001,
      "text": " to try and enforce a little bit more of an opinionated view on what well-architected means"
    },
    {
      "speakerLabel": "spk_1",
      "start": 170.64000000000001,
      "end": 175.28,
      "text": " to people building on AWS. And I think we welcome that because we always want AWS to be a little bit"
    },
    {
      "speakerLabel": "spk_1",
      "start": 175.28,
      "end": 182,
      "text": " more opinionated. So it identifies a set of concepts that fall under this umbrella and the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 182,
      "end": 185.68,
      "text": " framework presents a number of these concepts in different categories so that you can kind of"
    },
    {
      "speakerLabel": "spk_1",
      "start": 185.68,
      "end": 192.72,
      "text": " evaluate your approach to building and architecting AWS applications. So the parts to this are, well"
    },
    {
      "speakerLabel": "spk_1",
      "start": 192.72,
      "end": 196.88,
      "text": " the original one is the paper. So about seven or eight years ago they published a well-architected"
    },
    {
      "speakerLabel": "spk_1",
      "start": 196.88,
      "end": 201.36,
      "text": " white paper and this was the first document that tried to define what it means for a cloud workload"
    },
    {
      "speakerLabel": "spk_1",
      "start": 201.36,
      "end": 206.72,
      "text": " to be well-architected. And they've kept that up to date. So I think the last update was last October"
    },
    {
      "speakerLabel": "spk_1",
      "start": 206.72,
      "end": 212.32,
      "text": " and this is the general set of principles and the principles are divided into what are known as the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 212.32,
      "end": 216.88,
      "text": " Well-Architected Pillars. So if you're going to be looking at well-architected on AWS you'll probably"
    },
    {
      "speakerLabel": "spk_1",
      "start": 216.88,
      "end": 222.16,
      "text": " become familiar with the six pillars. There used to be five and there are operational pillars."
    },
    {
      "speakerLabel": "spk_1",
      "start": 222.16,
      "end": 228.8,
      "text": " Operational excellence which is like using infrastructure as code, deployment practices,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 229.6,
      "end": 234.72,
      "text": " predicting and handling failures, etc. Then you have security. You also have reliability which"
    },
    {
      "speakerLabel": "spk_1",
      "start": 234.72,
      "end": 239.35999999999999,
      "text": " includes high availability and scalability. And then you have performance and efficiency. So"
    },
    {
      "speakerLabel": "spk_1",
      "start": 239.35999999999999,
      "end": 244.64,
      "text": " ensuring that you're using the optimal resources and adopting newer technologies and not wasting"
    },
    {
      "speakerLabel": "spk_1",
      "start": 245.35999999999999,
      "end": 249.92,
      "text": " resources. Related to that then you have cost optimization which is a pillar of its own."
    },
    {
      "speakerLabel": "spk_1",
      "start": 249.92,
      "end": 254.79999999999998,
      "text": " And related to that again is sustainability which is the latest newly introduced pillar of the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 254.79999999999998,
      "end": 259.12,
      "text": " Well-Architected Framework. So those are the six pillars. So there are basically six categories"
    },
    {
      "speakerLabel": "spk_1",
      "start": 259.12,
      "end": 265.36,
      "text": " within well-architected when you're evaluating a workload. Then you also hear about this term called the Well-Architected Lenses."
    },
    {
      "speakerLabel": "spk_1",
      "start": 265.36,
      "end": 269.36,
      "text": " So with Well-Architected Lenses you still have your"
    },
    {
      "speakerLabel": "spk_1",
      "start": 269.36,
      "end": 273.44,
      "text": " six pillars but it's basically like looking at it from the perspective of different types of"
    },
    {
      "speakerLabel": "spk_1",
      "start": 273.44,
      "end": 278.32,
      "text": " applications or applications in different industries. So you have a lens for machine"
    },
    {
      "speakerLabel": "spk_1",
      "start": 278.32,
      "end": 282.88,
      "text": " learning, a lens for data analytics, there's a serverless lens which we've mentioned a couple"
    },
    {
      "speakerLabel": "spk_1",
      "start": 282.88,
      "end": 288.71999999999997,
      "text": " of times before in previous episodes, high performance computing, IoT, games and you can"
    },
    {
      "speakerLabel": "spk_1",
      "start": 288.71999999999997,
      "end": 294.08,
      "text": " actually create your own lenses. So there's an ability for you to define your own I suppose"
    },
    {
      "speakerLabel": "spk_1",
      "start": 294.08,
      "end": 299.76,
      "text": " rules and apply those pillars to a specific type of application. So you've got your pillars and"
    },
    {
      "speakerLabel": "spk_1",
      "start": 299.76,
      "end": 305.03999999999996,
      "text": " the lenses and then there's the actual process of evaluating workloads on AWS. So that's the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 305.04,
      "end": 310.24,
      "text": " well-architected review and it's essentially a formal process that allows you to go through"
    },
    {
      "speakerLabel": "spk_1",
      "start": 310.24,
      "end": 315.92,
      "text": " these lenses, ask specific questions that really you kind of have to honestly answer and figure out"
    },
    {
      "speakerLabel": "spk_1",
      "start": 315.92,
      "end": 320.8,
      "text": " how well you are meeting this idea of a well-architected workload according to AWS's principles."
    },
    {
      "speakerLabel": "spk_1",
      "start": 320.8,
      "end": 325.44,
      "text": " And to help with that they give you a tool. So that's the well-architected tool which"
    },
    {
      "speakerLabel": "spk_1",
      "start": 325.44,
      "end": 330.24,
      "text": " you can find in the AWS console and that's a service that you can use to conduct these"
    },
    {
      "speakerLabel": "spk_1",
      "start": 330.24,
      "end": 336.8,
      "text": " well-architected reviews and score yourself and monitor any risks that have been identified and"
    },
    {
      "speakerLabel": "spk_1",
      "start": 336.8,
      "end": 341.6,
      "text": " track your remediation of those risks. You might also come across the well-architected labs which"
    },
    {
      "speakerLabel": "spk_1",
      "start": 341.6,
      "end": 346.16,
      "text": " are essentially training resources, an online workshop split into several labs that allows you"
    },
    {
      "speakerLabel": "spk_1",
      "start": 346.16,
      "end": 350.64,
      "text": " to learn the methodology required to conduct these well-architected reviews. So all of these"
    },
    {
      "speakerLabel": "spk_1",
      "start": 350.64,
      "end": 355.68,
      "text": " things would provide links for in the show notes. So that's the rundown of all the different"
    },
    {
      "speakerLabel": "spk_1",
      "start": 355.68,
      "end": 360.64,
      "text": " products if you like in the well-architected ecosystem on AWS. In general, Luciano, would you"
    },
    {
      "speakerLabel": "spk_1",
      "start": 360.64,
      "end": 364.56,
      "text": " say who should care, should you care at all about building well-architected workloads?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 371.12,
      "end": 376.56,
      "text": " Yeah, my first aesthetic answer would be of course you should care because nobody wants to build systems that are suboptimal and maintainable, insecure, expensive and so on. At least not"
    },
    {
      "speakerLabel": "spk_0",
      "start": 376.56,
      "end": 381.28000000000003,
      "text": " intentionally. Maybe you don't know any better but of course you always want to do the best work you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 381.28000000000003,
      "end": 384.56,
      "text": " can possibly do in any field, right? I think that this is just a general statement."
    },
    {
      "speakerLabel": "spk_0",
      "start": 384.56,
      "end": 389.6,
      "text": " But at the same time, we always need to be pragmatic because if you are a startup, probably"
    },
    {
      "speakerLabel": "spk_0",
      "start": 389.6,
      "end": 394.4,
      "text": " your first concern, your main priority is to just ship something in the hands of your customer so"
    },
    {
      "speakerLabel": "spk_0",
      "start": 394.4,
      "end": 398.16,
      "text": " that you can actually validate if you are providing value to them and if your business"
    },
    {
      "speakerLabel": "spk_0",
      "start": 398.16,
      "end": 402.24,
      "text": " makes sense or if you need to pivot into something else. So in that particular case, of course I"
    },
    {
      "speakerLabel": "spk_0",
      "start": 402.24,
      "end": 407.04,
      "text": " wouldn't suggest startups to be extremely methodical and focused on trying to deliver the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 407.04,
      "end": 411.76,
      "text": " best possible architecture because your focus should be somewhere else and maybe more on the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 411.76,
      "end": 417.76,
      "text": " product side, maybe more on the validation side. Of course if your idea makes sense and your business"
    },
    {
      "speakerLabel": "spk_0",
      "start": 417.76,
      "end": 422,
      "text": " starts to get positive feedback, you want to start growing that business, you want to start to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 422,
      "end": 427.28,
      "text": " deliver to more customers and at a certain point this architectural concern becomes more and more"
    },
    {
      "speakerLabel": "spk_0",
      "start": 427.28,
      "end": 432.32,
      "text": " relevant because of course if you have a good architecture you are increasing your chances of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 432.32,
      "end": 438.08,
      "text": " providing value consistently to your customers. So I think as a general statement you should care."
    },
    {
      "speakerLabel": "spk_0",
      "start": 438.08,
      "end": 442.88,
      "text": " There might be a point in the history of your organization where this becomes more and more"
    },
    {
      "speakerLabel": "spk_0",
      "start": 442.88,
      "end": 448.15999999999997,
      "text": " important so it makes also a lot of sense to try to identify at which phase of your company"
    },
    {
      "speakerLabel": "spk_0",
      "start": 448.15999999999997,
      "end": 452.8,
      "text": " are you in and whether it starts to make sense for you to explore this particular topic or not."
    },
    {
      "speakerLabel": "spk_0",
      "start": 455.68,
      "end": 461.2,
      "text": " So I suppose if you are at that phase where you say okay I actually have a business, I'm making"
    },
    {
      "speakerLabel": "spk_0",
      "start": 461.2,
      "end": 466.24,
      "text": " money, I have paying customers and I want this customer to be served as best as possible"
    },
    {
      "speakerLabel": "spk_0",
      "start": 466.24,
      "end": 471.2,
      "text": " continuously and of course I want to operate all of that service in the best possible way for my"
    },
    {
      "speakerLabel": "spk_0",
      "start": 471.2,
      "end": 476.72,
      "text": " own sake, like cost effective, easy to change and so on. Where do I even start? How do I even know"
    },
    {
      "speakerLabel": "spk_0",
      "start": 476.72,
      "end": 483.12,
      "text": " if my workloads are well architected? And another question that I generally hear is like should they"
    },
    {
      "speakerLabel": "spk_0",
      "start": 483.12,
      "end": 487.68,
      "text": " do that before or after I go to production? Because maybe you just did a private beta"
    },
    {
      "speakerLabel": "spk_0",
      "start": 487.68,
      "end": 491.44,
      "text": " or you have some prototypes that you have been using, you are not really considering your product"
    },
    {
      "speakerLabel": "spk_0",
      "start": 491.44,
      "end": 496.96,
      "text": " production yet so should you do a review anyway or maybe should you wait before you are already"
    },
    {
      "speakerLabel": "spk_0",
      "start": 496.96,
      "end": 502.56,
      "text": " in production and maybe reconsider your architecture later?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 502.56,
      "end": 506.8,
      "text": " Yeah well I guess the framework is there to help you answer all of those questions so maybe it's important to mention first the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 506.8,
      "end": 513.04,
      "text": " framework isn't meant to be used to evaluate a whole organization, it's actually meant"
    },
    {
      "speakerLabel": "spk_1",
      "start": 513.04,
      "end": 517.84,
      "text": " to evaluate a specific workload. So you can have multiple workloads with your business and they"
    },
    {
      "speakerLabel": "spk_1",
      "start": 517.84,
      "end": 523.0400000000001,
      "text": " can all be at different levels of well architected and you can conduct well architected reviews for"
    },
    {
      "speakerLabel": "spk_1",
      "start": 523.0400000000001,
      "end": 528.8000000000001,
      "text": " one or multiple workloads and they don't have to be synchronized in any way."
    },
    {
      "speakerLabel": "spk_1",
      "start": 528.8000000000001,
      "end": 531.6800000000001,
      "text": " So I guess the first thing you would need to do then is just identify which workloads are the most business critical"
    },
    {
      "speakerLabel": "spk_1",
      "start": 531.6800000000001,
      "end": 537.84,
      "text": " and focus on those first and is it probably a good idea to do one and get into the groove of"
    },
    {
      "speakerLabel": "spk_1",
      "start": 537.84,
      "end": 543.9200000000001,
      "text": " using the well architected review process and then apply it more broadly."
    },
    {
      "speakerLabel": "spk_1",
      "start": 543.92,
      "end": 549.92,
      "text": " So you can use the framework and the tool to convert to conduct that review and that review is a guided process that"
    },
    {
      "speakerLabel": "spk_1",
      "start": 549.92,
      "end": 553.12,
      "text": " helps you to explore all of the topics that are important to the framework and make sure that you"
    },
    {
      "speakerLabel": "spk_1",
      "start": 553.12,
      "end": 557.5999999999999,
      "text": " don't miss anything and there's a set of questions there that are kind of designed to make sure that"
    },
    {
      "speakerLabel": "spk_1",
      "start": 557.5999999999999,
      "end": 562.24,
      "text": " you have to kind of really think about it and answer it and in some cases you can say okay well"
    },
    {
      "speakerLabel": "spk_1",
      "start": 562.24,
      "end": 566.8,
      "text": " this question or this particular topic does not apply to my workload but in general you have to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 566.8,
      "end": 573.12,
      "text": " really bear all when you're conducting that review. And when it comes to the question about whether"
    },
    {
      "speakerLabel": "spk_1",
      "start": 573.12,
      "end": 577.92,
      "text": " you can use this for development workloads or production you can actually use it for both."
    },
    {
      "speakerLabel": "spk_1",
      "start": 577.92,
      "end": 583.52,
      "text": " You can flag your workload as pre-production and conduct a review. It's a pretty good way to get a"
    },
    {
      "speakerLabel": "spk_1",
      "start": 583.52,
      "end": 587.6,
      "text": " sense of where you're at before you launch into production and maybe you can evaluate which of"
    },
    {
      "speakerLabel": "spk_1",
      "start": 587.6,
      "end": 595.52,
      "text": " the risks you need to identify and remediate before you go live in production."
    },
    {
      "speakerLabel": "spk_1",
      "start": 595.52,
      "end": 600.08,
      "text": " And it's also important to note that you can repeat it multiple times so you can take multiple passes through it"
    },
    {
      "speakerLabel": "spk_1",
      "start": 600.08,
      "end": 605.5200000000001,
      "text": " and you can schedule that you do it every three months or six months or whatever makes sense to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 605.5200000000001,
      "end": 610.32,
      "text": " you as you keep improving the architecture of your workloads and stay on par with the new best"
    },
    {
      "speakerLabel": "spk_1",
      "start": 610.32,
      "end": 616.32,
      "text": " practices and cloud capabilities. So once you've done that review it will highlight any weaknesses"
    },
    {
      "speakerLabel": "spk_1",
      "start": 616.32,
      "end": 620.72,
      "text": " in your architectures and give you pointers that you need and can start to take action on."
    },
    {
      "speakerLabel": "spk_1",
      "start": 621.2800000000001,
      "end": 625.12,
      "text": " So if you've done this, Luciano, and you've been through the process where do you even start when"
    },
    {
      "speakerLabel": "spk_1",
      "start": 625.12,
      "end": 628.88,
      "text": " you've got something that you identify and unfortunately you've got a set of risks you"
    },
    {
      "speakerLabel": "spk_1",
      "start": 628.88,
      "end": 632.48,
      "text": " realize that you're not as well architected as maybe you hoped you were, what do you even do"
    },
    {
      "speakerLabel": "spk_1",
      "start": 632.48,
      "end": 638.64,
      "text": " or where do you start to make them better?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 638.64,
      "end": 643.52,
      "text": " Yeah, so as you said you get some kind of feedback out of this process and that basically means that when you do the process using the tool at the end"
    },
    {
      "speakerLabel": "spk_0",
      "start": 643.52,
      "end": 648.4,
      "text": " of this process you will end up with a report and that report contains a number of items and"
    },
    {
      "speakerLabel": "spk_0",
      "start": 648.4,
      "end": 654.8,
      "text": " these items are classified by high risk and medium risk which of course is just an indication that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 654.8,
      "end": 660.3199999999999,
      "text": " AWS, the tool specifically, is trying to give you but it doesn't really know anything about your"
    },
    {
      "speakerLabel": "spk_0",
      "start": 660.3199999999999,
      "end": 664.24,
      "text": " business it just uses whatever information you provided through the process so it's still up to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 664.24,
      "end": 669.76,
      "text": " you to then take this kind of feedback from the report analyze it and decide what really is a"
    },
    {
      "speakerLabel": "spk_0",
      "start": 669.76,
      "end": 674.16,
      "text": " priority for you and what maybe something that can wait. So I suppose the next step will be"
    },
    {
      "speakerLabel": "spk_0",
      "start": 674.16,
      "end": 678.7199999999999,
      "text": " understand the report, understand every single item in that report, prioritize what's more"
    },
    {
      "speakerLabel": "spk_0",
      "start": 678.7199999999999,
      "end": 683.28,
      "text": " important to you and maybe start to create some actions in your backlog to try to address some"
    },
    {
      "speakerLabel": "spk_0",
      "start": 683.28,
      "end": 688,
      "text": " of these points. You definitely don't need to address them all as Eoin said it's something"
    },
    {
      "speakerLabel": "spk_0",
      "start": 688,
      "end": 693.92,
      "text": " that you can repeat over time and get it better at it and of course every time you repeat it maybe"
    },
    {
      "speakerLabel": "spk_0",
      "start": 693.92,
      "end": 698.48,
      "text": " there are new recommendations maybe your business has changed maybe you have implemented certain"
    },
    {
      "speakerLabel": "spk_0",
      "start": 698.48,
      "end": 702.9599999999999,
      "text": " improvements in your architecture so your posture will always be a little bit different."
    },
    {
      "speakerLabel": "spk_0",
      "start": 702.9599999999999,
      "end": 708.48,
      "text": " By repeating this over time you will always get new feedback and new opportunities to improve"
    },
    {
      "speakerLabel": "spk_0",
      "start": 708.48,
      "end": 714.08,
      "text": " your architecture and just to make a practical example just by looking at the latest pillar that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 714.08,
      "end": 718.88,
      "text": " was introduced only recently that particular pillar is something that if you did a review"
    },
    {
      "speakerLabel": "spk_0",
      "start": 718.88,
      "end": 723.52,
      "text": " a couple of years ago you didn't even have so if you redo the review today probably there would be"
    },
    {
      "speakerLabel": "spk_0",
      "start": 723.52,
      "end": 728.88,
      "text": " a number of very good pieces of advice that you can apply on that specific sustainability pillar"
    },
    {
      "speakerLabel": "spk_0",
      "start": 728.88,
      "end": 732.24,
      "text": " that maybe you haven't explored before and it's something you might want to start to address."
    },
    {
      "speakerLabel": "spk_0",
      "start": 732.24,
      "end": 738.96,
      "text": " So since we I think it's useful to do maybe some more practical examples just to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 739.52,
      "end": 743.92,
      "text": " to give a real feeling of what kind of questions do you get when you when you do the review"
    },
    {
      "speakerLabel": "spk_0",
      "start": 744.8,
      "end": 748.8,
      "text": " should we maybe try to list some of the most interesting questions do you think?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 754.08,
      "end": 759.36,
      "text": " Yeah sure so if you look into the well-architected tool in the console I suppose maybe it's important to clarify the tool isn't doing any kind of analysis of your workload it's not reaching"
    },
    {
      "speakerLabel": "spk_1",
      "start": 759.36,
      "end": 765.6800000000001,
      "text": " out into your resources on AWS and identifying weak spots it's essentially a questionnaire type"
    },
    {
      "speakerLabel": "spk_1",
      "start": 765.6800000000001,
      "end": 771.04,
      "text": " tool a guided process that you go through with you know experts on well-architected we can go"
    },
    {
      "speakerLabel": "spk_1",
      "start": 771.04,
      "end": 775.6,
      "text": " through it yourself and it asks it asks questions in a way that you kind of have to honestly answer."
    },
    {
      "speakerLabel": "spk_1",
      "start": 775.6,
      "end": 780.72,
      "text": " So let's take an example so when you do that use this tool you can select like the you will always"
    },
    {
      "speakerLabel": "spk_1",
      "start": 780.72,
      "end": 784.72,
      "text": " answer questions about the foundational white paper and then you can also select lenses that"
    },
    {
      "speakerLabel": "spk_1",
      "start": 784.72,
      "end": 788.5600000000001,
      "text": " you want to apply on top of it as well the tool only supports two at the moment the serverless"
    },
    {
      "speakerLabel": "spk_1",
      "start": 788.56,
      "end": 794.2399999999999,
      "text": " lens and the SaaS lens but you can also add your own custom lenses as I've already mentioned so"
    },
    {
      "speakerLabel": "spk_1",
      "start": 794.2399999999999,
      "end": 798.64,
      "text": " you can add your own questions that are specific to your industry or workload so one question that"
    },
    {
      "speakerLabel": "spk_1",
      "start": 798.64,
      "end": 803.5999999999999,
      "text": " pops up when it comes to operational excellence is just to give an example that it's not all about"
    },
    {
      "speakerLabel": "spk_1",
      "start": 803.5999999999999,
      "end": 807.52,
      "text": " the technology one question is how does your organizational culture support your business outcomes. "
    },
    {
      "speakerLabel": "spk_1",
      "start": 807.52,
      "end": 812.4,
      "text": " And there's a selection of things that you kind of have to take here really so you have"
    },
    {
      "speakerLabel": "spk_1",
      "start": 812.4,
      "end": 818.88,
      "text": " to make sure that you've got like executive sponsorship for your cloud workload that team"
    },
    {
      "speakerLabel": "spk_1",
      "start": 818.88,
      "end": 825.12,
      "text": " members are empowered to take action when outcomes are at risk and all of the questions have this format, right."
    },
    {
      "speakerLabel": "spk_1",
      "start": 825.12,
      "end": 829.1999999999999,
      "text": " A set of check boxes, you can just check them you can add notes and details to it if you"
    },
    {
      "speakerLabel": "spk_1",
      "start": 829.1999999999999,
      "end": 834.0799999999999,
      "text": " want but you can also say if one of these doesn't apply to you for whatever reason so if you need"
    },
    {
      "speakerLabel": "spk_1",
      "start": 834.0799999999999,
      "end": 837.76,
      "text": " if and that will happen it will happen from time to time the questions just don't apply to you."
    },
    {
      "speakerLabel": "spk_1",
      "start": 837.76,
      "end": 843.68,
      "text": " Then on a more technical sense in the performance efficiency pillar it will ask how do you monitor"
    },
    {
      "speakerLabel": "spk_1",
      "start": 843.68,
      "end": 848.64,
      "text": " your resources to ensure that they're performing so you will have to confirm that you're collecting"
    },
    {
      "speakerLabel": "spk_1",
      "start": 848.64,
      "end": 853.76,
      "text": " performance related metrics and that you're analyzing those when incidents occur and that"
    },
    {
      "speakerLabel": "spk_1",
      "start": 853.76,
      "end": 859.4399999999999,
      "text": " you're generating alarms and monitoring those alarms proactively. "
    },
    {
      "speakerLabel": "spk_1",
      "start": 859.4399999999999,
      "end": 863.28,
      "text": " So that all that all makes sense and then if take an example from the serverless lens, it doesn't"
    },
    {
      "speakerLabel": "spk_1",
      "start": 863.28,
      "end": 866.8,
      "text": " have a lot of questions in it but it'll ask you how do you evaluate your serverless applications health."
    },
    {
      "speakerLabel": "spk_1",
      "start": 866.8,
      "end": 872.64,
      "text": " The serverless lens is actually a lot more opinionated in having its"
    },
    {
      "speakerLabel": "spk_1",
      "start": 872.64,
      "end": 877.92,
      "text": " recommendations than the base, foundational white paper so it will want to make sure that"
    },
    {
      "speakerLabel": "spk_1",
      "start": 877.92,
      "end": 883.04,
      "text": " you've got distributed tracing involved in your application and that you've got structured"
    },
    {
      "speakerLabel": "spk_1",
      "start": 883.04,
      "end": 888.24,
      "text": " centralized logging as well. So there's specific things you'll need in there so there's a whole set"
    },
    {
      "speakerLabel": "spk_1",
      "start": 888.24,
      "end": 892.0799999999999,
      "text": " of questions there and when you go through a review you can skip over questions you can go"
    },
    {
      "speakerLabel": "spk_1",
      "start": 892.08,
      "end": 898.4000000000001,
      "text": " back and fill them in later. So it's quite flexible in that sense. What do you think,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 898.4000000000001,
      "end": 901.84,
      "text": " Luciano, would you recommend that people do this alone that they just go in and try it out"
    },
    {
      "speakerLabel": "spk_1",
      "start": 901.84,
      "end": 906.08,
      "text": " themselves? Should they get AWS or a partner to come along and help them with the process?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 911.76,
      "end": 917.12,
      "text": " Yeah, I think you can definitely do it by yourself because as you said you can just open the well architecture tool from the AWS console and it's pretty much a guided process you just need to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 917.12,
      "end": 924,
      "text": " make sure you keep an open mindset and try to give the most honest answers to every single question."
    },
    {
      "speakerLabel": "spk_0",
      "start": 924.5600000000001,
      "end": 928.5600000000001,
      "text": " Even when there are things that of course you wanted them to be different there is no point in"
    },
    {
      "speakerLabel": "spk_0",
      "start": 928.5600000000001,
      "end": 933.76,
      "text": " trying to hide and maybe give an answer that is not really describing the reality of things"
    },
    {
      "speakerLabel": "spk_0",
      "start": 933.76,
      "end": 936.8,
      "text": " because if you do that and you pretend things are better than they are then you are going to be"
    },
    {
      "speakerLabel": "spk_0",
      "start": 936.8,
      "end": 942.24,
      "text": " missing out on opportunities for making your architecture better and improving the company"
    },
    {
      "speakerLabel": "spk_0",
      "start": 942.24,
      "end": 947.76,
      "text": " the company on its own. And I think it's important to remember that this is not an audit this is"
    },
    {
      "speakerLabel": "spk_0",
      "start": 947.76,
      "end": 951.52,
      "text": " something that you do to try to get better it's not something that you do because you're going"
    },
    {
      "speakerLabel": "spk_0",
      "start": 951.52,
      "end": 955.2,
      "text": " to get some kind of certification or you're going to get, I don't know, the ability to trade in a specific market. "
    },
    {
      "speakerLabel": "spk_0",
      "start": 955.2,
      "end": 958.96,
      "text": " It's just something that you do because you generally want to be better as an"
    },
    {
      "speakerLabel": "spk_0",
      "start": 958.96,
      "end": 963.84,
      "text": " organization at delivering the produce that you are delivering and of course there are also other"
    },
    {
      "speakerLabel": "spk_0",
      "start": 963.84,
      "end": 967.6800000000001,
      "text": " nice side effects to the business. Because, if you do this process you're probably gonna be able to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 967.68,
      "end": 972.9599999999999,
      "text": " save money in terms of your cloud expenditure, you might be able to make your organization a little"
    },
    {
      "speakerLabel": "spk_0",
      "start": 972.9599999999999,
      "end": 977.28,
      "text": " bit more flexible in introducing new features, recovering from incidents and all these kind of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 977.28,
      "end": 982.4,
      "text": " things that definitely will give you more leverage in the market to be more effective with your product. "
    },
    {
      "speakerLabel": "spk_0",
      "start": 982.4,
      "end": 988.88,
      "text": " And that's another segue that I think it's important to do this process with different"
    },
    {
      "speakerLabel": "spk_0",
      "start": 988.88,
      "end": 994.3199999999999,
      "text": " stakeholders in your business so you shouldn't just get your own architect in the company"
    },
    {
      "speakerLabel": "spk_0",
      "start": 994.32,
      "end": 999.5200000000001,
      "text": " and tell them, \"okay, go off and do this exercise\". It's something that you should actually do by"
    },
    {
      "speakerLabel": "spk_0",
      "start": 999.5200000000001,
      "end": 1003.44,
      "text": " involving a bunch of different people in your organization because definitely there are questions"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1003.44,
      "end": 1008.08,
      "text": " that require the perspective of people that are not technical, like people that are maybe more"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1008.08,
      "end": 1013.2800000000001,
      "text": " in finance or product or people that, if they are technical, they are in specific areas like security."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1013.2800000000001,
      "end": 1018,
      "text": " Maybe your architect doesn't have all these answers so it's really important that you bring"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1018,
      "end": 1023.12,
      "text": " the right people for the right questions and they also need to try to give the most honest answer"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1023.12,
      "end": 1027.76,
      "text": " that they could give for the particular question now with that being said you can do all of this alone. "
    },
    {
      "speakerLabel": "spk_0",
      "start": 1027.76,
      "end": 1032.8,
      "text": " But if you if you want another opportunity to try to keep the entire process as honest"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1032.8,
      "end": 1037.92,
      "text": " as possible and maybe have even more guidance, I think it's useful to bring in a partner or to ask"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1037.92,
      "end": 1044.64,
      "text": " AWS itself if they would be able to provide a guided review. A partner or AWS itself"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1044.64,
      "end": 1049.2,
      "text": " of course they have less of an interest in the inner workings of your organization and they can"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1049.2,
      "end": 1052.96,
      "text": " try to keep the process more honest, they can also bring their own expertise, they probably have"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1052.96,
      "end": 1057.92,
      "text": " seen different companies in different industries going through the process and that probably helps"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1057.92,
      "end": 1062.24,
      "text": " to avoid some of the common mistakes that you might be end up doing by yourself. "
    },
    {
      "speakerLabel": "spk_0",
      "start": 1062.24,
      "end": 1067.68,
      "text": " If this is something that interests you, keep in mind that we at fourTheorem do this kind of activity."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1067.68,
      "end": 1072.64,
      "text": " If it's something that you are considering to do, give us a shout we, can probably help you to start and do"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1072.64,
      "end": 1078.64,
      "text": " your first well-architected review. So with that being said I think this is all we have for today."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1078.64,
      "end": 1083.0400000000002,
      "text": " Thank you very much for being with us. We are really curious as always to get your feedback on"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1083.0400000000002,
      "end": 1086.96,
      "text": " any of these episodes. If the well-architected review is something that you have done already,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1086.96,
      "end": 1091.2800000000002,
      "text": " we'd love to hear your feedback on it. Was it useful? Did you discover something important? "
    },
    {
      "speakerLabel": "spk_0",
      "start": 1091.2800000000002,
      "end": 1095.5200000000002,
      "text": " Did it actually make your company and your operations better or if it's something you did and you were"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1095.5200000000002,
      "end": 1099.44,
      "text": " not satisfied with it, we are even more curious to know what did go wrong and if we can learn"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1099.44,
      "end": 1104.16,
      "text": " something from it. I think it's amazing that we will be sharing this learning with everyone"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1104.16,
      "end": 1108.88,
      "text": " interested so definitely give us a comment here or reach out on Twitter and we'd love to talk with"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1108.88,
      "end": 1135.3600000000001,
      "text": " you more. Until then, thanks again and we'll see you in the next episode."
    }
  ]
}