{
  "speakers": {
    "spk_0": "spk_0",
    "spk_1": "spk_1"
  },
  "segments": [
    {
      "speakerLabel": "spk_0",
      "start": 0,
      "end": 5,
      "text": " If you haven't been living under a rock lately, you have heard a lot of noise and excitement about AI tools."
    },
    {
      "speakerLabel": "spk_0",
      "start": 5,
      "end": 9,
      "text": " GitHub Copilot, Dali and ChatGPT are just some of the latest tools."
    },
    {
      "speakerLabel": "spk_0",
      "start": 9,
      "end": 16,
      "text": " ChatGPT and other large language models in particular are being heralded as game changers for the future of work across all industries."
    },
    {
      "speakerLabel": "spk_0",
      "start": 16,
      "end": 22,
      "text": " So how do we escape the noise and make a measured assessment of where this is all going and what it means for software engineering?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 22,
      "end": 25,
      "text": " Well today we're going to try and do exactly that."
    },
    {
      "speakerLabel": "spk_0",
      "start": 25,
      "end": 30,
      "text": " We'll talk about what we've been using, what works and what doesn't work, and give some thoughts for the future."
    },
    {
      "speakerLabel": "spk_0",
      "start": 30,
      "end": 33,
      "text": " Stay tuned to find out how you can use all these tools to your advantage."
    },
    {
      "speakerLabel": "spk_0",
      "start": 33,
      "end": 36,
      "text": " I'm Eoin, I'm joined by Luciano, and this is the AWS Bites Podcast."
    },
    {
      "speakerLabel": "spk_0",
      "start": 36,
      "end": 47,
      "text": " AWS Bites is sponsored by FourthErem."
    },
    {
      "speakerLabel": "spk_0",
      "start": 47,
      "end": 50,
      "text": " FourthErem is an AWS partner for migration, architecture and training."
    },
    {
      "speakerLabel": "spk_0",
      "start": 50,
      "end": 54,
      "text": " Find out more at fourtherem.com. The link is in the show notes."
    },
    {
      "speakerLabel": "spk_0",
      "start": 54,
      "end": 60,
      "text": " Luciano, maybe we can just chat through this and talk about what we've been using first."
    },
    {
      "speakerLabel": "spk_0",
      "start": 60,
      "end": 68,
      "text": " It's not that new in so many ways because for a while we've been using things like autocomplete and autocorrect on our mobile phone keyboards."
    },
    {
      "speakerLabel": "spk_0",
      "start": 68,
      "end": 73,
      "text": " We've had smart AI-assisted tools in Google Docs and Gmail Smart Reply."
    },
    {
      "speakerLabel": "spk_0",
      "start": 73,
      "end": 81,
      "text": " Even Google Translate is something probably anybody who's been abroad has used once or twice."
    },
    {
      "speakerLabel": "spk_0",
      "start": 81,
      "end": 85,
      "text": " What else have you been using recently, or what do you find is particularly cool?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 85,
      "end": 93,
      "text": " Yeah, absolutely. I think now there is just an acceleration of new tools with more overwhelming and unexpected capabilities."
    },
    {
      "speakerLabel": "spk_1",
      "start": 93,
      "end": 102,
      "text": " And especially the ones that I've been using the most are GitHub Copilot, a bit of Chant GPT, Notion as well, some interesting tools."
    },
    {
      "speakerLabel": "spk_1",
      "start": 102,
      "end": 108,
      "text": " So maybe we can talk a little bit more in detail about why are we using them and for what."
    },
    {
      "speakerLabel": "spk_1",
      "start": 108,
      "end": 115,
      "text": " Yeah, it's interesting. With Copilot in particular, I used it when it was part of a developer early access preview."
    },
    {
      "speakerLabel": "spk_0",
      "start": 115,
      "end": 119,
      "text": " I used it quite extensively and really loved it actually, and I was pretty impressed by it."
    },
    {
      "speakerLabel": "spk_0",
      "start": 119,
      "end": 132,
      "text": " But I stopped using it after a while, and I'm not sure why exactly, but I think a little bit of it was I was afraid of getting a little bit lazy and not thinking for myself anymore."
    },
    {
      "speakerLabel": "spk_0",
      "start": 132,
      "end": 136,
      "text": " So I just tried to just turn it off for a while and see how I'd get on."
    },
    {
      "speakerLabel": "spk_0",
      "start": 136,
      "end": 145,
      "text": " I haven't had the major urge to go back to it, but at the same time, when we're pairing together and pairing with other people who are using Copilot, I do have a bit of FOMO."
    },
    {
      "speakerLabel": "spk_0",
      "start": 145,
      "end": 150,
      "text": " So what do you think it's good for then, or where does it really shine?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 150,
      "end": 156,
      "text": " Yeah, to be fair, I also started to use it almost as a joke. Like I didn't expect it to be useful."
    },
    {
      "speakerLabel": "spk_1",
      "start": 156,
      "end": 162,
      "text": " But then I immediately saw value and I didn't go back to not using something like Copilot."
    },
    {
      "speakerLabel": "spk_1",
      "start": 162,
      "end": 168,
      "text": " So maybe I'm biased because I'm really enjoying using it and I'm seeing lots of good use cases for it."
    },
    {
      "speakerLabel": "spk_1",
      "start": 168,
      "end": 177,
      "text": " For instance, recently I was writing some unit test and I needed to create an object that was necessary for the test that was a little bit convoluted."
    },
    {
      "speakerLabel": "spk_1",
      "start": 177,
      "end": 186,
      "text": " It's like complex objects with lots of like nested substructures and everything needed to be generated in a way that was making some sense for the test."
    },
    {
      "speakerLabel": "spk_1",
      "start": 186,
      "end": 191,
      "text": " And then of course, I needed to generate some assertion after I was doing some operations in this object."
    },
    {
      "speakerLabel": "spk_1",
      "start": 191,
      "end": 198,
      "text": " And as soon as I started creating the first line of that object definition, Copilot immediately completed like 10 lines of code."
    },
    {
      "speakerLabel": "spk_1",
      "start": 198,
      "end": 209,
      "text": " And when that happens, I'm always a little bit skeptical because when you write too much code, I am always afraid that I'm going to be missing some important detail, maybe a comma there or maybe some name somewhere else."
    },
    {
      "speakerLabel": "spk_1",
      "start": 209,
      "end": 213,
      "text": " So I did check everything and it was actually quite good."
    },
    {
      "speakerLabel": "spk_1",
      "start": 213,
      "end": 219,
      "text": " And then it also generated a bunch of assertions which were like 99% close to what I was trying to do."
    },
    {
      "speakerLabel": "spk_1",
      "start": 219,
      "end": 225,
      "text": " So I still needed to review everything and fix a few small things, but I think it did save me a lot of time."
    },
    {
      "speakerLabel": "spk_1",
      "start": 225,
      "end": 239,
      "text": " And that's something that I mean, it's happening all the time that I feel that I'm becoming a bit more productive just because it gives me that suggestion and also gives me that suggestion in a way that it's easy for me to decide, do I want the suggestion or not?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 239,
      "end": 243,
      "text": " And if I don't want it, I just keep writing and ignore whatever is saying."
    },
    {
      "speakerLabel": "spk_1",
      "start": 243,
      "end": 250,
      "text": " So definitely useful and I'm seeing value basically using it every day for coding."
    },
    {
      "speakerLabel": "spk_1",
      "start": 250,
      "end": 260,
      "text": " Yeah, I've seen a few people then use the AWS to code Whisperer. I did try it for a little while, but I found that the responses are just very slow to arrive, which slows down your development flow."
    },
    {
      "speakerLabel": "spk_0",
      "start": 260,
      "end": 269,
      "text": " And that's a real problem, but I'm sure that's going to improve in the future. AWS does tend to release things early on and see how people get on and then improve them over time."
    },
    {
      "speakerLabel": "spk_0",
      "start": 269,
      "end": 276,
      "text": " I've also seen that you've got Copilot X, which I think is the future generation of Copilot that has been previewed."
    },
    {
      "speakerLabel": "spk_0",
      "start": 276,
      "end": 279,
      "text": " I think you can get access to preview. There's a wait list."
    },
    {
      "speakerLabel": "spk_0",
      "start": 279,
      "end": 291,
      "text": " And from what I see, that's going to allow you to do a lot of other developer tasks like create PRs and documentation easily and maybe more like chat GPT, use a conversational interface."
    },
    {
      "speakerLabel": "spk_0",
      "start": 291,
      "end": 305,
      "text": " And you can also use it from your terminal. So if you're trying to find out what's the command to search for a certain string and extract the third column and sort them and find unique values, you could do that from the terminal."
    },
    {
      "speakerLabel": "spk_0",
      "start": 305,
      "end": 314,
      "text": " Another example I've seen is like generate the FFmpeg command to extract the audio from this and convert it to MP3 or something like that."
    },
    {
      "speakerLabel": "spk_0",
      "start": 314,
      "end": 321,
      "text": " So that all sounds pretty useful. Again, I wonder, will everybody forget how to do these things for real and what does that actually mean?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 321,
      "end": 326,
      "text": " I should try to see if it helps me with GIT rebases."
    },
    {
      "speakerLabel": "spk_0",
      "start": 326,
      "end": 330,
      "text": " Yeah, yeah. What could go wrong?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 330,
      "end": 334,
      "text": " So let's talk about maybe the headline grabber chat GPT."
    },
    {
      "speakerLabel": "spk_0",
      "start": 334,
      "end": 339,
      "text": " I found it pretty useful, but I've had also very mixed results. What do you think it's good for?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 339,
      "end": 352,
      "text": " Yeah, I've been using it quite a bit, especially for this podcast. I find it extremely useful for coming up with good video descriptions or episode descriptions, starting from our notes or our transcripts."
    },
    {
      "speakerLabel": "spk_1",
      "start": 352,
      "end": 359,
      "text": " Also for generating, for instance, the YouTube tags for every episode, which is a very daunting task."
    },
    {
      "speakerLabel": "spk_1",
      "start": 359,
      "end": 365,
      "text": " So just trying to think what are 20 different keywords that are somewhat related to what we just mentioned today."
    },
    {
      "speakerLabel": "spk_1",
      "start": 365,
      "end": 373,
      "text": " And I think that chat GPT can very quickly give you suggestions that, of course, you can take or not take, take some of that."
    },
    {
      "speakerLabel": "spk_1",
      "start": 373,
      "end": 383,
      "text": " So I think it's still important to have some degree of human intervention in these things, but it's just making your life easier and making you more productive when you use these tools in a very targeted way."
    },
    {
      "speakerLabel": "spk_1",
      "start": 383,
      "end": 395,
      "text": " I completely agree with using it for summaries and even also for idea generation, and you mentioned Notion. And I think chat GPT 3 is integrated into Notion now."
    },
    {
      "speakerLabel": "spk_0",
      "start": 395,
      "end": 406,
      "text": " So if you're a Notion user, you can use chat GPT just from within your documents. So you can select text, get it to summarize it, get it to rewrite it, get it to change the tone or language of it."
    },
    {
      "speakerLabel": "spk_0",
      "start": 406,
      "end": 416,
      "text": " Just expand it out with adding even more detail. But you can also use it for kind of brainstorming or coming up with ideas. Like one thing I tried was give me a list of ideas for company activities around Dublin."
    },
    {
      "speakerLabel": "spk_0",
      "start": 416,
      "end": 427,
      "text": " And it gave me like 10 to 20 very reasonable suggestions, actually. So that stuff is really good for when you're just stuck for inspiration and just need to unblock yourself a little bit."
    },
    {
      "speakerLabel": "spk_1",
      "start": 427,
      "end": 436,
      "text": " Yeah, I have another cool example, which I was actually really impressed with the result. I tried to ask something like, I want to create a course on Notion Streams."
    },
    {
      "speakerLabel": "spk_1",
      "start": 436,
      "end": 443,
      "text": " What are the main topics that I should cover? And it literally gave me 10 different chapters. And the order was making a lot of sense."
    },
    {
      "speakerLabel": "spk_1",
      "start": 443,
      "end": 450,
      "text": " It was like a progression on the level of complexity of the different topics. And I think it was covering all the basics."
    },
    {
      "speakerLabel": "spk_1",
      "start": 450,
      "end": 460,
      "text": " Now, it's probably not too different from doing a Google search, looking at four or five different pages and then coming up with your own summary of all of that."
    },
    {
      "speakerLabel": "spk_1",
      "start": 460,
      "end": 464,
      "text": " But I have a feeling that this is just much faster to get a decent result this way."
    },
    {
      "speakerLabel": "spk_1",
      "start": 464,
      "end": 472,
      "text": " One of the things that ChatTPT is pretty good at doing is if you have text, you want to rewrite it or change the style of that text."
    },
    {
      "speakerLabel": "spk_0",
      "start": 472,
      "end": 480,
      "text": " It's pretty good. But I've actually also heard from people working at universities as researchers and writing a lot of academic papers."
    },
    {
      "speakerLabel": "spk_0",
      "start": 480,
      "end": 490,
      "text": " And it's quite common that you've got lots of international collaborators and people who are not native English speakers who are burdened with the task of creating formal academic English in papers."
    },
    {
      "speakerLabel": "spk_0",
      "start": 490,
      "end": 503,
      "text": " And this is obviously a difficult enough challenge on top of doing the research itself and that universities are actually starting to recommend people to run the text through ChatTPT before they submit it for review,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 503,
      "end": 514,
      "text": " because it can actually get rid of that cycle of people just commenting on language and small wording issues and just accelerate that whole process."
    },
    {
      "speakerLabel": "spk_0",
      "start": 514,
      "end": 524,
      "text": " So I think that's quite an interesting benefit as well. And I've also seen it used for just changing the tone, you know, make this less formal, make it more formal."
    },
    {
      "speakerLabel": "spk_0",
      "start": 524,
      "end": 536,
      "text": " I like that a lot. And it's something I'll definitely try to do in the future with my blog posts is just try to improve the quality of English, because everybody has their own style that they're accustomed to, I guess, when they're writing."
    },
    {
      "speakerLabel": "spk_0",
      "start": 536,
      "end": 550,
      "text": " And you don't sometimes see that maybe you're just a little bit verbose or you have a tendency to repeat yourself. And even just by asking ChatTPT to make paragraphs more succinct, it might help a lot there."
    },
    {
      "speakerLabel": "spk_0",
      "start": 550,
      "end": 562,
      "text": " Yeah, I think there is on one side the risk that is going to make basically creativity fade out a little bit because you're just going to take whatever the tool is giving you and not question if there is an alternative."
    },
    {
      "speakerLabel": "spk_1",
      "start": 562,
      "end": 575,
      "text": " But at the same time, it can be an opportunity for actually exploring different styles of things. Like for instance, I often try to do to take a piece of text that I have already written myself and say, can you try to make this more engaging?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 575,
      "end": 589,
      "text": " Can you try to change the style to be, I don't know, more mysterious? And I don't always get good results. But sometimes I get inspiration for changing what I was doing in a way that maybe I was not anticipating before."
    },
    {
      "speakerLabel": "spk_1",
      "start": 589,
      "end": 602,
      "text": " So I think you, on one side is true that there is a risk of losing creativity. On the other side, I think you can still use this tool to kind of foster more of your own creativity by just getting some ins and then developing from there."
    },
    {
      "speakerLabel": "spk_1",
      "start": 602,
      "end": 614,
      "text": " Yeah, that's really interesting because you would worry that it's going to take the personality out of writing or the individualism. But I suppose whether that happens or not depends on what you do with the response you get back."
    },
    {
      "speakerLabel": "spk_0",
      "start": 614,
      "end": 627,
      "text": " I think everybody, whether you're a native English speaker or not, or whatever language you're writing in or speaking, everybody's using AI to some degree almost at this point for grammar checking and spelling. Like in Google Docs, it's already built in there."
    },
    {
      "speakerLabel": "spk_0",
      "start": 627,
      "end": 634,
      "text": " Or if you're using Grammarly, it's using AI to suggest grammar. It should level the playing field a little bit for people."
    },
    {
      "speakerLabel": "spk_1",
      "start": 634,
      "end": 646,
      "text": " On that topic, I actually recently discovered a VS Code plugin that allows you to use Grammarly for markdown directly in your VS Code. And I was recently writing an article for my blog."
    },
    {
      "speakerLabel": "spk_1",
      "start": 646,
      "end": 657,
      "text": " And basically, this tool works a little bit like ESLint. Basically all the errors, you will see the file on the sidebar becoming red. And then if you go on that file, you see like a list of things to fix."
    },
    {
      "speakerLabel": "spk_1",
      "start": 657,
      "end": 671,
      "text": " So I immediately saw that all my older blog posts were like all red everywhere. And I did realize that there were a lot of small issues that I wouldn't have done today just because today I have this kind of tools to help me out and make me spot the issues straight away."
    },
    {
      "speakerLabel": "spk_1",
      "start": 671,
      "end": 682,
      "text": " So that's just another, I guess, confirmation of what you've suggested that, yeah, we have been using these tools for a while now. But if you compare maybe with a few years ago when we were not using these tools,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 682,
      "end": 690,
      "text": " there was a little bit more disadvantage for people that were not English speakers to come up with like decent written content."
    },
    {
      "speakerLabel": "spk_1",
      "start": 690,
      "end": 711,
      "text": " Yeah, it's interesting. I mean, when the advent of SMS back in the early 2000s, when people started using short messages, there was this grave concern from a lot of people that it would kill the English language or any other language because of all the abbreviations and acronyms and everything."
    },
    {
      "speakerLabel": "spk_0",
      "start": 711,
      "end": 725,
      "text": " So maybe this is going to go to the other extreme and kind of set this new standard for grammar which is unrealistic for humans and almost takes kind of idiomatic individual language out of the equation altogether."
    },
    {
      "speakerLabel": "spk_0",
      "start": 725,
      "end": 741,
      "text": " Just another disadvantage. But on the subject of language, we have used, if people have been listening to the podcast for a while, we have used the other open AI model, the whisper model for generating transcripts, and we did a whole episode on this."
    },
    {
      "speakerLabel": "spk_0",
      "start": 741,
      "end": 752,
      "text": " But if you go to awsbytes.com you can also see transcripts for our almost 80 episodes so far all there and I think this has really been useful for us in a number of different ways. What do you think Luciano?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 752,
      "end": 763,
      "text": " Yeah, absolutely. I think it's first of all making the content a bit more accessible because if people want to read through rather than listening to it or watching the videos, they can do that now."
    },
    {
      "speakerLabel": "spk_1",
      "start": 763,
      "end": 779,
      "text": " But also for us, if we were to do that in a more, let's say manual way where we would either do the transcript ourselves or pay somebody else to come up with good transcripts, that would probably been something a little bit prohibited for us either for cost reasons or time reasons."
    },
    {
      "speakerLabel": "spk_1",
      "start": 779,
      "end": 788,
      "text": " So I think we found a very good trade-off there that is allowing us to make our content more accessible without really investing too much into it."
    },
    {
      "speakerLabel": "spk_1",
      "start": 788,
      "end": 799,
      "text": " So that's another, I guess, proof that these tools can be beneficial in kind of business-related context or content creation in general."
    },
    {
      "speakerLabel": "spk_1",
      "start": 799,
      "end": 811,
      "text": " I haven't seen this yet, but we both use Canva from time to time and you're a bit of a Canva expert at creating those amazing thumbnails for the podcast. But you mentioned that Canva is now getting a few AI features. What's that like?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 811,
      "end": 820,
      "text": " I haven't used most of them yet. Only the image generation one which looks a little bit like Dali so you can just write a prompt and it will generate an image for you."
    },
    {
      "speakerLabel": "spk_1",
      "start": 820,
      "end": 831,
      "text": " Now the level of quality I've seen so far wasn't really anything amazing. I wouldn't have used those for creating anything professional, I suppose."
    },
    {
      "speakerLabel": "spk_1",
      "start": 831,
      "end": 836,
      "text": " But who knows, maybe that's going to improve over time. Maybe they will start to use other models and get better results."
    },
    {
      "speakerLabel": "spk_1",
      "start": 836,
      "end": 844,
      "text": " But I also saw that they recently announced a bunch of additional AI power features more geared towards editing."
    },
    {
      "speakerLabel": "spk_1",
      "start": 844,
      "end": 858,
      "text": " So if you have, for instance, already a picture that you're working on and there is maybe a part of that picture that you don't like, you can easily highlight a portion of it and maybe say something on the line, can you please replace this part with something else?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 858,
      "end": 870,
      "text": " And I mean, the video I saw, they were getting amazing results. Now, of course, they probably tried to create a video that was somehow amazing and would push people to use the product."
    },
    {
      "speakerLabel": "spk_1",
      "start": 870,
      "end": 880,
      "text": " So I still need to use it in real life and see what are the results, but it seems very promising. And I saw that Adobe announced something similar, if not this week, last week."
    },
    {
      "speakerLabel": "spk_1",
      "start": 880,
      "end": 889,
      "text": " So there is definitely a push even in the space of graphics and art and design to use more and more AI features and AI power tools."
    },
    {
      "speakerLabel": "spk_0",
      "start": 889,
      "end": 896,
      "text": " Yeah, I've played around with Dali and stable diffusion and I've seen great things with mid journey examples."
    },
    {
      "speakerLabel": "spk_0",
      "start": 896,
      "end": 901,
      "text": " It seems to be that in the image generation space, there's a lot of different models and a lot of different tools out there."
    },
    {
      "speakerLabel": "spk_0",
      "start": 901,
      "end": 914,
      "text": " There's also a lot of more controversy so far, I think, around, you know, using copyrighted images to train these models and then who ultimately is responsible for the intellectual property and there's some lawsuits and everything going on."
    },
    {
      "speakerLabel": "spk_0",
      "start": 914,
      "end": 921,
      "text": " But there's also pretty interesting use cases. There's a nice mix of both of them. There's a serverless application that David Boyne put together."
    },
    {
      "speakerLabel": "spk_0",
      "start": 921,
      "end": 933,
      "text": " I don't know if you saw that Ligiana but it's an interesting one where he can generate bedtime stories for his kids every night using an automated schedule of the serverless application."
    },
    {
      "speakerLabel": "spk_0",
      "start": 933,
      "end": 940,
      "text": " He uses chatgpt to generate a story, then Dali to generate some images, and he gets like a children's story every day."
    },
    {
      "speakerLabel": "spk_0",
      "start": 940,
      "end": 944,
      "text": " Yeah, okay we'll try and throw that link in the show notes for people who want to check it out."
    },
    {
      "speakerLabel": "spk_0",
      "start": 944,
      "end": 957,
      "text": " Why is this happening now? What's the sudden acceleration? Or is it a sudden acceleration or is it just that the mass consumer market has suddenly awoken to the fact that all of this has been going on?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 957,
      "end": 962,
      "text": " Probably the latter. I mean, there is definitely an acceleration in the technology itself."
    },
    {
      "speakerLabel": "spk_1",
      "start": 962,
      "end": 979,
      "text": " Probably this technology now is more, I don't know, fine-tuned, more accessible. I assume also cheaper because if it was possible to make it so accessible, probably now training the models but also running the inference is, I assume, much cheaper than it used to be a few years ago."
    },
    {
      "speakerLabel": "spk_1",
      "start": 979,
      "end": 995,
      "text": " And on the other side, definitely there is an education piece of the market that is starting to realize that this tool exists, how people can use them, how can they maybe help people to accomplish specific tasks that would have been much more time consuming before."
    },
    {
      "speakerLabel": "spk_1",
      "start": 995,
      "end": 1009,
      "text": " And plus all the news that are catching up and promoting in a way or another that these things exist and people can use them. So everything is kind of creating a vicious circle where this technology is kind of promoting itself almost, right?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1009,
      "end": 1025,
      "text": " We've mentioned a few things already about what it's good for in terms of generating readable English, summarizing content, generating documentation. I think we mentioned that in the context of Copilot X, but I think I've also been using a chat GPT to do that."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1025,
      "end": 1034,
      "text": " Generating a readme based on basic information or some code, it's pretty good at starting that off for you. But everything you generate tends to need a bit of scrutiny."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1034,
      "end": 1046,
      "text": " What about generating code then in general? So we mentioned that Copilot is how it's useful, but you also need to check it if it's long enough. What about using chat GPT to generate code? How have you got on with that?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1046,
      "end": 1058,
      "text": " I actually tried something recently. I was trying to rewrite something I had in Python in Rust. And just for fun, I basically said to Copilot, to chat GPT, can you do this for me?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1058,
      "end": 1076,
      "text": " And I was actually impressed of one specific detail that in the process I forgot to copy part of the code. And chat GPT somehow realized that and basically gave me a placeholder saying, you didn't really give me this particular function, so somewhere you need to write the implementation of this function."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1076,
      "end": 1100,
      "text": " So basically in the place where I was calling the function, there was a comment on the side saying, remember to implement this function or something like that, which I thought was quite impressive. So I'm not too sure how that like these are the cases where it might seem that chat GPT is actually understanding and is kind of having some kind of logic process there, which we know is not really the case."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1100,
      "end": 1114,
      "text": " So I'm not really sure what was happening there in the model in order to figure out that some piece of information was missing and then generating some kind of note there that was telling me, be aware that you are missing some important information there."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1114,
      "end": 1129,
      "text": " And then in general, the rest of the code was actually quite good for that particular example. But I also had other examples where it was totally hallucinating. For instance, I said, can you convert this React component into Solid.js?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1129,
      "end": 1149,
      "text": " And because I think Solid.js is a much newer technology, maybe there isn't really a lot of examples out there. It was kind of getting some things right, like the imports and so on. But then like importing the right libraries, but then it was importing functions that didn't exist in Solid.js, but they were existing in React."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1149,
      "end": 1160,
      "text": " So it was kind of getting there, but not quite. So it was making a lot of false assumptions there. So at the end of the day, the code that was generated was totally rubbish, even though it looked legit."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1160,
      "end": 1170,
      "text": " So that's probably another risk there where you need to be really careful that if you assume the code is always going to be right, be prepared for disappointment or for nasty surprises."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1170,
      "end": 1182,
      "text": " I think it's good to have a starting point, but always validate it yourself and make sure that everything that is generated makes sense to you. Maybe write some tests or at least test it manually. Don't just trust it blindly."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1182,
      "end": 1189,
      "text": " Yeah, I like those two examples, because the first one you mentioned about it, like recognizing that you'd missed part of the code when you pasted it in."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1189,
      "end": 1200,
      "text": " That's the kind of thing that leads people to say, oh, this is getting close to artificial general intelligence. And then when you see the second example, you realize, OK, this is just basically a really advanced search engine."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1200,
      "end": 1215,
      "text": " That's what it is. It's a language model. It's not general intelligence. And it's pretty good at spoofing as well. So that's one of the unfortunate drawbacks of GPT is that it doesn't really tell you very well when it doesn't know."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1215,
      "end": 1223,
      "text": " Instead, it just tries to make something up. Yeah, in many ways, it's like a software developer's when we're at our worst."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1223,
      "end": 1228,
      "text": " That's true. We should probably use it for coding interviews."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1228,
      "end": 1234,
      "text": " I'm sure it would do pretty well. It's already passed, GPT4 has passed the Google coding interview, I believe."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1234,
      "end": 1248,
      "text": " Yeah, I have used it for content creation. And I think that's a really good one. Like if you want to create a slide deck presentation about something, you could say, give me enough slides for one hour presentation and the topics and the titles and the bullet points."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1248,
      "end": 1255,
      "text": " You can even say, suggest me some images, visuals I could use. So it won't generate images for you, but it can describe images maybe that you could put in."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1255,
      "end": 1268,
      "text": " When you're faced with a blank slide deck and you have to create a deck for a new talk or to explain a concept or whatever, there's a bit of friction and inertia when you're just getting going and creating that initial structure and the format."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1268,
      "end": 1274,
      "text": " And if you have something like this generated to start, then it gets over that. You can always reshape it and customize it and personalize it."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1274,
      "end": 1282,
      "text": " I do kind of think like you've been in the process of writing a book. So have I in the past and you have that same problem, right?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1282,
      "end": 1291,
      "text": " It's very difficult to know how to structure it and what to write. Would you use, if you're writing another book starting today, would you use GPT to help in the process?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1291,
      "end": 1296,
      "text": " Because I think I would really find it difficult to avoid using GPT now that I've seen what it can do."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1296,
      "end": 1305,
      "text": " I think I would use it to some extent. Like, oh, yeah, yeah. Like definitely not going to write the entire book just with whatever chat GPT write me this book."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1305,
      "end": 1316,
      "text": " I don't think that will give you value. Like you're not going to give the readers lots of value. I think at least at the level of quality we have today, it still needs a lot of checking."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1316,
      "end": 1331,
      "text": " It still needs a lot of human input. So I see that more as an assistant where maybe you have written down a lot of notes and you want to just, I don't know, somebody to help you break it down or figure out what are the main chapters."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1331,
      "end": 1339,
      "text": " What is the progression of topics or maybe even just rewrite something that you wrote in a very verbose way into something that is a little bit more digestible."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1339,
      "end": 1353,
      "text": " So I think in all these cases you can definitely get value. But again, it's nothing more than an assistant and you still need to put the work in and make sure that everything that is generated makes sense and fits with the rest of the content that you have there."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1353,
      "end": 1364,
      "text": " But it is like an assistant at the same time, right? So it is like, you know, sometimes when you are in the process of writing, you'd love to have somebody there who you could just whenever you wanted to turn to them and say, what do you think of this?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1364,
      "end": 1371,
      "text": " What do you think of this structure with chat GPT? You kind of got something equating or approximating that, I think."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1371,
      "end": 1388,
      "text": " Another example is that I recently wrote an article on my blog, which was based off of a presentation that I already had. I had the slides. I was actually writing the slides in markdown. So it was even quite easy to just copy paste everything and say, convert this into an article."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1388,
      "end": 1401,
      "text": " And the result was very mixed. There were lots of parts of the article that I liked and I kind of took and reshaped them a little bit and other parts that I had to rewrite entirely because I didn't like the generated output at all."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1401,
      "end": 1412,
      "text": " It was either too verbose or it was missing out the important bits. So I think overall I saved some time anyway because I wrote that article, which is something you can probably read in half an hour."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1412,
      "end": 1422,
      "text": " So it's a relatively long article in probably four hours. And I think in the past it would have taken me, I don't know, a couple of days to do the same thing."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1422,
      "end": 1436,
      "text": " So again, there is definitely value, but don't just take the output and use it. I always encourage everyone to try to make sense of the output and decide for yourself what's good, what's not good and what needs to be changed."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1436,
      "end": 1446,
      "text": " When it comes to the quality of stuff, one thing I've seen is that there's going to be, I suppose, an interface between a lot of these tools and non-I services."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1446,
      "end": 1457,
      "text": " So ChatGPT in itself, because it has to make up something and always give you a response, it can hallucinate and give you suggestions that are completely off the wall."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1457,
      "end": 1466,
      "text": " But they are also working on these plugin ecosystems so you will be able to integrate into proper sources of information and also follow up on actions."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1466,
      "end": 1474,
      "text": " So the ability to book a flight or a restaurant through ChatGPT or do your shopping or perform some computation."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1474,
      "end": 1481,
      "text": " Another one is they're going to integrate with Zapier so you can run Zapier workflows and then you can integrate with thousands of different services."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1481,
      "end": 1503,
      "text": " So I think that's actually quite good because it just finally opened, like for a while we had this conversational AI hype bubbling around and we had Amazon Lex and Alexa and all these voice enabled systems, but they're kind of limited in what they can do and they have to have very structured menus and options and they're always a bit hit and miss."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1503,
      "end": 1511,
      "text": " But I think when you combine proper voice recognition with ChatGPT and these other integrations that it will bring all of that to a new level."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1511,
      "end": 1515,
      "text": " When it comes to the code quality, I mean, I've seen ChatGPT do some amazing things."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1515,
      "end": 1525,
      "text": " Since we're talking about this on an AWS podcast, I did try and see what it would be like to try and build a complete AWS serverless application with ChatGPT."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1525,
      "end": 1528,
      "text": " And it started off pretty well."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1528,
      "end": 1531,
      "text": " So I asked it to build a skeleton CRUD API."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1531,
      "end": 1533,
      "text": " Actually, it was a shopping list application, I think."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1533,
      "end": 1539,
      "text": " And it generated serverless.yaml and it generated five Lambda functions for me."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1539,
      "end": 1543,
      "text": " And all of the Lambda functions code was completely perfect, I would say."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1543,
      "end": 1545,
      "text": " Completely reasonable."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1545,
      "end": 1549,
      "text": " I had to make some minor tweaks that it would deploy, but it did deploy and the API worked."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1549,
      "end": 1555,
      "text": " So it had deployed a DynamoDB table, Lambda functions, IAM roles, API gateway."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1555,
      "end": 1559,
      "text": " By the way, did you ask it explicitly to use serverless framework or was?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1559,
      "end": 1561,
      "text": " Yeah, I asked it to use serverless framework."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1561,
      "end": 1564,
      "text": " So I asked it to use generator serverless.yaml and the Lambda functions."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1564,
      "end": 1570,
      "text": " Then I said, okay, well, this is a very, very common serverless 101 example out there."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1570,
      "end": 1573,
      "text": " So I'm sure it's got lots of examples of that in its training data."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1573,
      "end": 1576,
      "text": " I asked it to add custom domains, DNS."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1576,
      "end": 1578,
      "text": " And at that point it went a bit haywire."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1578,
      "end": 1583,
      "text": " Like the output looked reasonable, but it was like somebody really trying to fake it."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1583,
      "end": 1588,
      "text": " You know, somebody who's just like really trying to convince you that they know what they're talking about, but they don't."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1588,
      "end": 1591,
      "text": " And I could tell by looking at the cloud formation that it wasn't going to work."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1591,
      "end": 1594,
      "text": " So then I said, okay, forget about custom domains."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1594,
      "end": 1599,
      "text": " But I thought it would be interesting to try something a little bit more, you know, specialist."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1599,
      "end": 1603,
      "text": " So I said, okay, can you reduce the code duplication by introducing MIDI?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1603,
      "end": 1609,
      "text": " And first of all, I asked it to do validation as well using MIDI."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1609,
      "end": 1614,
      "text": " So at first it gave me like a mix of using the joy library and MIDI that didn't really make that much sense."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1614,
      "end": 1616,
      "text": " Mustn't be the canonical way to do it."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1616,
      "end": 1620,
      "text": " But then I said, okay, just use a MIDI approach rather than mixing in joy."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1620,
      "end": 1626,
      "text": " It started to give me really weird syntax and then started to add in weird serverless framework plugins that I didn't need."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1626,
      "end": 1633,
      "text": " And it had like 12 different MIDI middlewares in there for no reason."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1633,
      "end": 1636,
      "text": " It was also using like old versions of MIDI syntax."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1636,
      "end": 1639,
      "text": " So I said, please, could you use MIDI one?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1639,
      "end": 1643,
      "text": " It like upgraded the package.json version, but the code was the same."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1643,
      "end": 1646,
      "text": " So I thought it was interesting."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1646,
      "end": 1649,
      "text": " This was the GPT-3 engine, by the way."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1649,
      "end": 1651,
      "text": " So maybe GPT-4 is going to be better at this."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1651,
      "end": 1660,
      "text": " But I think it also points to the fact that as you get into more and more specific technology questions where you know the training data volume is going to be lower, it will struggle."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1660,
      "end": 1662,
      "text": " That's an interesting example."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1662,
      "end": 1668,
      "text": " But you also mentioned that Jeremy Daly, I remember we were chatting about this, has written about using AI tools."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1668,
      "end": 1671,
      "text": " Is it worth summarizing all of that?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1671,
      "end": 1675,
      "text": " Yeah, yeah, I think this is really kind of insightful article."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1675,
      "end": 1679,
      "text": " It's actually in the premium version of the Off By None newsletter."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1679,
      "end": 1682,
      "text": " So I think he mentions it in the free version."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1682,
      "end": 1693,
      "text": " But basically the point that Jeremy was making, like he's been using a fair few AI tools lately and is finding them all useful, as we have been as well."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1693,
      "end": 1706,
      "text": " But his approach was to think about university education and what the impact will be on university education, particularly in the US where the college fees and everything is really expensive and really it's a massive investment."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1706,
      "end": 1728,
      "text": " And yeah, he is suggesting that universities will really need to think about reevaluating the curriculum for all these courses, and as well that we kind of need to reevaluate our learning and focus on areas where human creativity is really indispensable instead of, I suppose, what are now becoming easily automatable tasks."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1728,
      "end": 1740,
      "text": " And yeah, he's basically questioning that maybe that we need to think about the value of a computer science degree as it currently exists, given that AI can do so much with this for us."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1740,
      "end": 1748,
      "text": " So I think it was very interesting. You're just saying like everyone, we need to think about adapting how we work to focus on areas less likely to be automated."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1748,
      "end": 1766,
      "text": " And I thought that was quite interesting. I mean, it does bring up the question and maybe we can go into some of the drawbacks of all of these tools but does it, is it really automating away these skills, or is, are we just able to use them, if you've already got the knowledge,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1766,
      "end": 1778,
      "text": " are they allowing you to accelerate your workflow, does it help you if you are at the start of your learning journey about to embark on a college degree, will it short circuit all of that in some way?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1778,
      "end": 1798,
      "text": " Honestly, I don't know because I have a feeling that education will have to change at some point just because there are a lot of tasks that now, they don't make too much sense anymore, maybe tasks that are too mnemonic, or that are easy automatable with tools."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1798,
      "end": 1813,
      "text": " For instance, I remember that ages ago, people would have their logarithmic table. That's something that's been obsolete for quite a while. Maybe we will see something similar in the education where a lot of things that we used to do become less relevant, so we focus on other areas."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1813,
      "end": 1830,
      "text": " And definitely, it is going to be interesting to see if we are going to be able to focus more on areas that require more kind of deep engineering or creativity, rather than things that just require sheer knowledge and mnemonic skills, which they don't really require AI today."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1830,
      "end": 1842,
      "text": " I think it's just computing in general, it's, and the web are solving that problem already for a while. So with AI is just a little bit of the next step in trying to automate the research and giving you easier access to the results."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1842,
      "end": 1860,
      "text": " I think there's probably a couple of ways to look at it. I mean, if you think about it, if you were to believe that everybody will eventually move to cloud computing, or most people will, then the number of roles I would imagine for, you know, data center engineers, you would expect will concentrate just on cloud providers."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1860,
      "end": 1884,
      "text": " So they may become more specialist niche roles. It might also be the same for software engineering in general, that if these tools allow people to do a lot of what we currently do in a more automated way, then there will still be a need for specialists who are more rare but also understand what this generated code is doing and where it can go wrong and troubleshoot it and understanding the underpinnings."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1884,
      "end": 1898,
      "text": " I mean, this is probably always the case as new generations of technology emerge. If you were learning software development in the 60s, you would have to learn a low level programming language, and you would need to really understand about how CPU and memory works."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1898,
      "end": 1911,
      "text": " That hasn't been the case really for a while and CPU and memory are so cheap, and also have become more complicated that it is, it's something people don't really think about that much anymore. Not in general, I would say."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1911,
      "end": 1921,
      "text": " But at the same time, people who do know those things and retain that knowledge and do dive deep, become increasingly valuable then, as it becomes like a rarer skill."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1921,
      "end": 1933,
      "text": " So that's one way to look at it. But, yeah, I also think that in general the education system does need to adapt quickly to this sort of thing and kind of introduce."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1933,
      "end": 1949,
      "text": " Another thing you could say is that understanding how AI works and AI models work and how to interact with them and really getting into that area as a specialty is also somewhere, an area where you could take advantage today because if this is going to change everything into the future,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1949,
      "end": 1956,
      "text": " then it will need a lot more expertise and people who can maintain those systems and work on them. So, every challenge becomes new opportunities as well."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1956,
      "end": 1960,
      "text": " Definitely a growing market so there will be opportunities there."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1960,
      "end": 1973,
      "text": " Another area I'm kind of interested in is, like, what we do quite a lot is in understanding existing legacy systems and this is a skill that's actually quite difficult to get and to find in the market, you know, being a people who are willing to go into"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1973,
      "end": 1986,
      "text": " a legacy system and not just look at it and go oh my god this is awful let's just rewrite it from scratch. But the ability to understand what's happening in it, capture the value in it, capture the history and all the tasks that knowledge has been built up and retain"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1986,
      "end": 1993,
      "text": " the arts, as you migrate to whatever the target is, be it a serverless architecture or microservices architecture in the cloud."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1993,
      "end": 2007,
      "text": " This is a challenging thing to do. And a couple of our colleagues at fourTheorem have been working on this Fission project in collaboration with DCU University here, and have had really good results in like using AI and other techniques to actually"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2007,
      "end": 2020,
      "text": " analyze code bases and do refactoring on them. All of these new tools introduce that capability or the possibility at least that you could use language models, point them at an existing code base that humans really don't want to look at."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2020,
      "end": 2033,
      "text": " And it can tell you okay well this is what it's doing, these are the domains, these are the bounded contexts and the entities in this application. And here's what a microservices architecture for the system might look like, and even generate code templates or part of the code for you."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2033,
      "end": 2044,
      "text": " Yeah, and I think we've been using this and some case studies with some good degree of success, so it's definitely not rocket science, it is feasible today to do this kind of things using AI."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2044,
      "end": 2058,
      "text": " And I suppose the interesting thing about that is that what we've learned from our experience using these tools is that it really helps you to accelerate a lot of that forensic analysis of legacy code bases, but you still have to use your"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2058,
      "end": 2063,
      "text": " logic and reasoning to figure out what the target architecture would look like, and then how you get there."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2063,
      "end": 2074,
      "text": " And figure out how you do it in a way that doesn't disrupt the business and is incremental and works and doesn't fall over the first time you run it."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2074,
      "end": 2088,
      "text": " Yeah, I suppose even just deciding which service you should create first is not trivial at all, like you need to have so much business context that probably still going to be a human decision for a while to decide which one is that."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2088,
      "end": 2101,
      "text": " Would you trust chatgpt to generate code for you in an area where you don't have so much expertise? So if you were asked to, I don't know, I'm going to pick a language that I haven't used very much at all, which is Golang."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2101,
      "end": 2116,
      "text": " So if somebody asked you in the morning to write a CRUD application in Golang, would you use chatgpt for it? I'm pretty entrusted to generate good output if you didn't have the knowledge to scrutinize it like you do with the many languages you do understand."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2116,
      "end": 2131,
      "text": " That's a good question. I'm always a little bit skeptical of using these tools in general, not just for code, in areas where I don't feel I have enough expertise, just because I am afraid that eventually I am responsible for that content."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2131,
      "end": 2142,
      "text": " And if I don't know what I'm doing, like AI is not necessarily going to give me something that I can rely on blindly. I guess I always need to double check."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2142,
      "end": 2148,
      "text": " I find it just easier to use these tools to make my life easier when I know something and I just want to speed up the process."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2148,
      "end": 2162,
      "text": " And I had so many instances of the generated code being far off from reality that I learned not to trust it and not to use it in cases where I wouldn't feel confident myself doing all the work."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2162,
      "end": 2177,
      "text": " But maybe that's just me. Maybe that's something that is going to get better over time, like the quality of the generated output, and then it could make sense to use it even in areas where you don't have knowledge and then you can use the generated output as an excuse to learn something."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2177,
      "end": 2187,
      "text": " And actually trying to validate the generated output and see, okay, it generated this, why? Let me go and figure out what this function means and why this function actually does what I'm trying to do."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2187,
      "end": 2195,
      "text": " Yeah, it might change the perception. And I think a good question is, if I was a junior engineer, would they use it? Would they have a different perspective?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2195,
      "end": 2202,
      "text": " And I generally don't know the answers. I don't know if you have a special point of view there, but it's an interesting question."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2202,
      "end": 2216,
      "text": " If I was at the start of my learning process and career, I think it would be very appealing because there's so many frustrating times when you're trying to figure things out and you are lacking knowledge and skills in so many different areas and experiences."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2216,
      "end": 2231,
      "text": " That it's a real shortcut. So that becomes what you mentioned just there is actually quite an optimistic point is that you can use these tools to get started quickly, but also find out what you need to start being curious about in a way."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2231,
      "end": 2240,
      "text": " And it can give you a template that can help you get stuff done. But if you have the right mindset, you can take what it gives you and try to understand it yourself."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2240,
      "end": 2251,
      "text": " And it just possibly reduces the amount of endless trolling the web and getting distracted and finding articles that are not really written in a way that suits what you're trying to look for."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2251,
      "end": 2256,
      "text": " Maybe they can give it, condense that information for you and help you to absorb it better."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2256,
      "end": 2263,
      "text": " There's pros and cons to how it applies to junior developers, but I think what you mentioned there gives me a little bit more optimism than I had before."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2263,
      "end": 2274,
      "text": " Yeah, the other point of view is, is this better than just copy pasting from, I don't know, Stack Overflow or articles that you find by searching on Google?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2274,
      "end": 2285,
      "text": " And I kind of have mixed feelings there as well, because from just a perspective of getting stuff done quickly, of course, this is more appealing because it does most of the work for you."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2285,
      "end": 2298,
      "text": " But on the other side, I think when you go off and do your own research and you try to read different examples and make sense of them, and then copy paste different parts from different places and glue everything together in some way that should make sense."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2298,
      "end": 2313,
      "text": " I think all of that is a learning journey. And you have many opportunities to learn related things that now, I don't know if that just the amount of opportunities for learning are decreasing just because these AIs are doing so much work for you."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2313,
      "end": 2328,
      "text": " And kind of pros and cons, of course, the more manual approach is lower, but I think you have more opportunities to learn, while the automated approach is much faster, but you might just give everything for granted and move on and lose a lot of important details there."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2328,
      "end": 2336,
      "text": " Yeah, it throws up so many questions and kind of potential drawbacks and open unanswered questions that might give you a little bit uncertainty about where the future is going."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2336,
      "end": 2343,
      "text": " We mentioned that it's useful for content generation, but if that becomes the norm, then where does the content come from that trains these models in the first place?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2343,
      "end": 2350,
      "text": " Is this stuff going to drown out authentic original content generated by humans with creativity and real intelligence?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2350,
      "end": 2358,
      "text": " In the code context, even if an AI is developing an application, who runs it? Who maintains it? Who's operating the system?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2358,
      "end": 2363,
      "text": " Does it make it easy for fake content to just proliferate the internet?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2363,
      "end": 2372,
      "text": " That's definitely the risk. And I think you're certainly right, when that happens, if it happens, like what content means anymore, right?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2372,
      "end": 2386,
      "text": " We're not going to be able to say, I don't know, where is the value of content anymore? If everything is auto-generated, you can have endless content, but it's going to be very hard to figure out what's valuable and what's not valuable."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2386,
      "end": 2395,
      "text": " So maybe there is an opportunity for people to try to be even more creative, just to try to beat this huge flood of generated content."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2395,
      "end": 2412,
      "text": " Probably there is an opportunity there to stand out even more if you can put the effort to come up with more original content, maybe to have ways of doing things that, of course, is going to be a lot more personal, something that is going to be very hard to be automatically generated by an AI."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2412,
      "end": 2428,
      "text": " Plagiarism is already a concern for a lot of content creators on the internet, but then if your content gets picked up for training data and gets repurposed in answers or generated content, how do you protect that if you want to protect it?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2428,
      "end": 2442,
      "text": " It's okay, I think, in general for you and I, we want our content to be shared widely and consumed as widely as possible, but for some people, maybe they're relying on the revenue from the content itself directly, and that's a little bit more of a concern."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2442,
      "end": 2457,
      "text": " It's a worry. And also for companies, companies will probably know that lots of people are using this today, maybe they're not being totally transparent about it, and I think companies need to figure out what is their policy for these tools really, really quickly."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2457,
      "end": 2466,
      "text": " And there's, again, strengths, weaknesses, opportunities and threats in all of this, right? So that analysis is definitely worth doing."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2466,
      "end": 2484,
      "text": " What happens when people are pasting sensitive information into the chat GPT? If they're pasting in a sensitive document in order to get a summary of it, that can help to communicate a message to the company at larger, which is a great benefit, but potentially you're leaking sensitive company information at the same time into the public domain."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2484,
      "end": 2496,
      "text": " There's a whole question about AI as a game changer, right? So many people are predicting that this is a game changer and will change the way work is done irreversibly."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2496,
      "end": 2505,
      "text": " We first of all have a challenge for us as individuals, which is maybe a bit of an existential threat, or maybe like what opportunities, how do I change how I work?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2505,
      "end": 2516,
      "text": " But also then for our companies, because if you're in a company with a large team of people, it's okay to say, well, how does this change me as an individual? But more importantly, how does it change your company and how you all work together?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2516,
      "end": 2524,
      "text": " Because it's probably much better that you're tackling this as a group rather than individually thinking, how do I get an edge here?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2524,
      "end": 2541,
      "text": " If one person is secretly using ChatGPT to look more productive than their colleagues, I don't really like the sound of that very much, but if you can look at it as a company and say, okay, let's really assess what we do every day, where we spend our time or where we can be more productive."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2541,
      "end": 2547,
      "text": " That's probably where you can really get an edge because the whole organization can potentially benefit."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2547,
      "end": 2556,
      "text": " Yeah, and I think that relates to something we mentioned before that in some cases, people are afraid to ask questions to colleagues and therefore it's easier to just ask AI."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2556,
      "end": 2567,
      "text": " So probably I would like to take the opportunity to invite people to refrain from doing that as much as possible because I think the opportunities you get by asking a colleague are still much higher than what you can get from AI."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2567,
      "end": 2586,
      "text": " Not just because you can build a relationship, you can get chances to work with other people, but I think there is a much more in-depth exchange when you try to communicate with somebody else, especially if they are people with either they work in a different area of the business, so you can have an opportunity to learn more from their experience and what they do in the company."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2586,
      "end": 2603,
      "text": " Or maybe somebody that has just more seniority and then you can use that excuse to learn other things that you didn't anticipate, or even if it's somebody with less seniority, then you can still use that opportunity to learn what kind of challenges are they facing, if you can help them in any way, or if there's something in the system that should be improved."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2603,
      "end": 2619,
      "text": " So yeah, I think if we end up letting AI do everything, we will miss out so many opportunities and everything will become kind of flat and standard, and instead we should be looking for opportunities not to do that as much as possible."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2619,
      "end": 2630,
      "text": " I find it interesting when people say, oh, like this is already making me two times more productive, and when you dig into it a little bit more, it's because they have a sounding board and they have something to ask questions of."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2630,
      "end": 2642,
      "text": " But this benefit, this 2x or 10x improvement in productivity, I think you can also achieve it pretty well by having a more collaborative spirit with colleagues and friends."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2642,
      "end": 2649,
      "text": " The barrier there is just ultimately ego and pride, and I recognize it in myself and I see it in myself and try to stamp it out wherever possible."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2649,
      "end": 2663,
      "text": " But when you see yourself thinking, I'm just going to keep working on this and figure it out myself because then I have, as an individual, achieved something, but you could also equally just ask a colleague, admit that you don't know, and learn from them."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2663,
      "end": 2677,
      "text": " The cost is just a little bit of humility, but the benefits, I think, when you end up achieving something together as a pair then or as a team, and I found when that works well in organizations and in teams I work with,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2677,
      "end": 2691,
      "text": " the benefit in terms of work satisfaction, ethos and mood in the team, and then the knock-on effects on productivity are far greater than some of the benefits that people report from just getting from interacting with chatTPD."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2691,
      "end": 2696,
      "text": " So I think there's a lot to learn from it, and I think it's an interesting parallel."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2696,
      "end": 2698,
      "text": " Yeah, I agree 100%."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2698,
      "end": 2700,
      "text": " Will AI take the fun out of software development?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2700,
      "end": 2715,
      "text": " That's a good question. I don't think that today there is a risk of that, I mean, in the short term, just because we have seen with all the many examples we mentioned today and that we have seen online that it doesn't really understand what software development is about."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2715,
      "end": 2727,
      "text": " It's just taking data from the web and reshaping it in a way that sometimes is correct, some other times is close to correct, other times is totally hallucinating and doesn't make any sense."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2727,
      "end": 2747,
      "text": " So I think until there is more of a general intelligence that can make logic reasoning and connect different thoughts and understand the problem and try to come up with solutions for these problems, I think until then we still will have a lot of fun trying to do the work ourselves and building solutions ourselves."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2747,
      "end": 2760,
      "text": " So again, it's just going to be an enabler, something that can make our work a little bit faster, but I don't think it's going to take all of that fun away of building things, thinking about problems, solutions, architectures, trade-offs and so on."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2760,
      "end": 2772,
      "text": " I guess the part where I think potentially you might lose out on the fun is when you really have to figure something out yourself and you don't have almost like the crutch of your language model to lean on to help you."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2772,
      "end": 2780,
      "text": " And you have to go deep and explore it and it's like a little bit of exploring uncharted territory and you emerge with an answer at the end of it."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2780,
      "end": 2792,
      "text": " Whether you do that as an individual or in a group, I worry that some of the challenge will be gone from it and while that has obvious productivity gains, then it might also hinder enjoyment as well."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2792,
      "end": 2808,
      "text": " If you've seen an open letter published asking these large model developers to halt development on the more advanced versions until we kind of figure out what they can do because of the risk, the potential existential threat, the risk to jobs, all of that."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2808,
      "end": 2826,
      "text": " I also think there's a lot to that and I've seen a lot of analysis on that saying there's other more subtle threats out there like tools like this can potentially expand the rich-poor divide by just giving the privilege more access to more tools that allows them to be more productive and earn more money and be more profitable."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2826,
      "end": 2830,
      "text": " And it just makes existing societal issues worse in that sense."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2830,
      "end": 2849,
      "text": " On the other hand, I'm wondering can the fact that AI allows people to come up to the level of people who either have the privilege of being native English speakers in the software development world or having more experience or more access to education, can these tools be a leveler for people?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2849,
      "end": 2852,
      "text": " Can it be a democratizing effect?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2852,
      "end": 2862,
      "text": " Yeah, that's a good question that I don't know if I have the answer, but in general I've seen that technology has been helping to get to a more democratized society."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2862,
      "end": 2875,
      "text": " Like just if you look at the web today, you can have so much information that I think 20, 30 years ago maybe would have been accessible to only very few people in very specific roles."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2875,
      "end": 2880,
      "text": " And for them it would be of course even much slower in order to extrapolate the information."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2880,
      "end": 2888,
      "text": " Today it's not that anyone in their pockets they have a device that can basically give answers to most of the human questions that you can ask today, right?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 2888,
      "end": 2896,
      "text": " So I think in general technology can have that kind of positive impact, but of course there are always lots of negatives and they can be very hard to predict."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2896,
      "end": 2902,
      "text": " So I think we always need to be vigilant there and make sure that we always try to use technology in the right way."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2902,
      "end": 2910,
      "text": " Probably one of the key things is if these kind of technologies are pretty much accessible to everyone, maybe they can become a leveler."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2910,
      "end": 2919,
      "text": " If they are kind of gate kept, maybe they are very expensive to use, very complicated to run, and only few people or organizations can use them, then there is a risk."
    },
    {
      "speakerLabel": "spk_1",
      "start": 2919,
      "end": 2925,
      "text": " That is that there is going to be more divide in society making the richer even richer and the poorer even poorer."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2925,
      "end": 2937,
      "text": " And I guess there are so many potential knock on effects as well. I mean I've been even trying to find out from the point of view of power consumption in training these massive models and running inference on these massive models at scale."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2937,
      "end": 2943,
      "text": " If they are to become accessible to everybody, what is then the sustainability, environmental impact of these models?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2943,
      "end": 2953,
      "text": " And it's quite difficult to get access to data making this very clear, but it's all very well to be increasing productivity."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2953,
      "end": 2971,
      "text": " Even with a democratizing leveling effect for everybody, but on the other hand it's just kind of another mindless growth advancement in technology that really hurts the environment that we need to sustain ourselves, then it might be also a step towards shooting ourselves in the foot."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2971,
      "end": 2981,
      "text": " Maybe we've come to a natural end at this point. I think we've probably agreed that this is a game changer and has already been changed things irreversibly to some degree."
    },
    {
      "speakerLabel": "spk_0",
      "start": 2981,
      "end": 2989,
      "text": " There's so many open questions here that I think we need everybody out there watching and listening to contribute your ideas and let us know what do you think about the future of AI?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2989,
      "end": 2997,
      "text": " What tools have you been using? What has really blown your mind? And also perhaps even more interesting, have you had any AI generated disasters?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 2997,
      "end": 3022,
      "text": " Please let us know and we really appreciate you listening to this special episode on AI tools in the software industry. Until next time, we'll see you."
    }
  ]
}