{
  "speakers": {
    "spk_0": "spk_0",
    "spk_1": "spk_1"
  },
  "segments": [
    {
      "speakerLabel": "spk_0",
      "start": 0,
      "end": 5.92,
      "text": " According to AWS, good governance is a must-have from the get-go for customers of all sizes."
    },
    {
      "speakerLabel": "spk_0",
      "start": 5.92,
      "end": 10,
      "text": " This area is not trivial, however, whether you are starting from a clean slate or you have been"
    },
    {
      "speakerLabel": "spk_0",
      "start": 10,
      "end": 14.48,
      "text": " winging it with AWS for many years. Luckily, there are plenty of tools to automate this and"
    },
    {
      "speakerLabel": "spk_0",
      "start": 14.48,
      "end": 18.32,
      "text": " guide you to a good setup from the start. But which one should you choose? If you stick until"
    },
    {
      "speakerLabel": "spk_0",
      "start": 18.32,
      "end": 22.080000000000002,
      "text": " the end of this episode, you'll know some of the best practices to set up your AWS accounts"
    },
    {
      "speakerLabel": "spk_0",
      "start": 22.080000000000002,
      "end": 26.48,
      "text": " correctly and which tools can help you to automate the work, including AWS Control Tower"
    },
    {
      "speakerLabel": "spk_0",
      "start": 26.48,
      "end": 32.88,
      "text": " and open source alternatives like Orformation or Terraform or OpenTF, should I say. I don't know."
    },
    {
      "speakerLabel": "spk_0",
      "start": 32.88,
      "end": 35.92,
      "text": " My name is Luciano and I'm joined by Eoin and this is AWS Bites."
    },
    {
      "speakerLabel": "spk_0",
      "start": 43.92,
      "end": 48.32,
      "text": " fourTheorem is the company that makes AWS Bites possible. If you're looking for a partner to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 48.32,
      "end": 52.24,
      "text": " accompany you on your cloud journey, check them out at fourtheorem.com."
    },
    {
      "speakerLabel": "spk_0",
      "start": 52.24,
      "end": 57.28,
      "text": " Luciano, you mentioned that this is a must-have, so what must we have? What are our objectives?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 57.28,
      "end": 61.120000000000005,
      "text": " And we mentioned terms like landing zones and governance. What does this all mean?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 65.92,
      "end": 73.36,
      "text": " Yeah, landed zone is a term that you probably hear a lot when you start to look into governance of AWS accounts. And it's something that if you look at the Well-Architected Framework is described as"
    },
    {
      "speakerLabel": "spk_0",
      "start": 73.36,
      "end": 77.92,
      "text": " basically a multi-account AWS environment that is scalable and secure. And it's something we"
    },
    {
      "speakerLabel": "spk_0",
      "start": 77.92,
      "end": 83.76,
      "text": " might have mentioned before in previous episodes, so check out our previous ones. But basically,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 83.76,
      "end": 89.6,
      "text": " if you want to summarize that, the idea is that you most likely want to have a multi-account"
    },
    {
      "speakerLabel": "spk_0",
      "start": 89.6,
      "end": 94.88,
      "text": " setup for different reasons. And also multi-account setup is going to ensure you that you can have"
    },
    {
      "speakerLabel": "spk_0",
      "start": 94.88,
      "end": 98.8,
      "text": " isolation between workloads. For instance, if you have different teams, they're not going to step"
    },
    {
      "speakerLabel": "spk_0",
      "start": 98.8,
      "end": 104.08,
      "text": " onto each other's toes. For instance, by consuming each other quotas, you can keep the different"
    },
    {
      "speakerLabel": "spk_0",
      "start": 104.08,
      "end": 109.2,
      "text": " workloads separated in different accounts. From a security perspective, you can also use ideas like"
    },
    {
      "speakerLabel": "spk_0",
      "start": 109.2,
      "end": 116,
      "text": " security boundaries, which basically they can reduce the impact for security incidents. And"
    },
    {
      "speakerLabel": "spk_0",
      "start": 116.96,
      "end": 121.84,
      "text": " the other idea is that you probably want to automate the process of provisioning new accounts,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 121.84,
      "end": 126.64,
      "text": " so just to make sure that you have all these best practices baked into the process. You don't have"
    },
    {
      "speakerLabel": "spk_0",
      "start": 126.64,
      "end": 131.36,
      "text": " to repeat the setup over and over again, and especially you don't want to do it manually."
    },
    {
      "speakerLabel": "spk_0",
      "start": 131.36,
      "end": 138.64000000000001,
      "text": " And finally, a landing zone can also include the concept of auditing and compliance rules."
    },
    {
      "speakerLabel": "spk_0",
      "start": 138.64000000000001,
      "end": 142.32000000000002,
      "text": " So how can you make sure that every time you create a new account that you have good"
    },
    {
      "speakerLabel": "spk_0",
      "start": 142.32000000000002,
      "end": 146.32000000000002,
      "text": " observability and you know exactly what's going on, you can collect the logs, and if you have"
    },
    {
      "speakerLabel": "spk_0",
      "start": 146.32000000000002,
      "end": 151.68,
      "text": " shared resources, you can have ways to accommodate for all of that. So basically, when we set up"
    },
    {
      "speakerLabel": "spk_0",
      "start": 151.68,
      "end": 156.48000000000002,
      "text": " a landing zone, we are looking for a solution that allows us to define all the accounts in"
    },
    {
      "speakerLabel": "spk_0",
      "start": 156.48000000000002,
      "end": 160.96,
      "text": " the organization structure. You can imagine that as a tree where you have units and then"
    },
    {
      "speakerLabel": "spk_0",
      "start": 160.96,
      "end": 164.56,
      "text": " under certain units you can have multiple accounts. We want to have that very clear,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 164.56,
      "end": 169.12,
      "text": " but then we want to have a way to define all of that in a formal way, basically."
    },
    {
      "speakerLabel": "spk_0",
      "start": 169.76000000000002,
      "end": 174.8,
      "text": " And we might want to set up service control policies or SCPs, which are permissions that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 174.8,
      "end": 179.20000000000002,
      "text": " can be applied to multiple accounts within an organization unit. And sometimes they're also"
    },
    {
      "speakerLabel": "spk_0",
      "start": 179.20000000000002,
      "end": 184.32,
      "text": " referred to as preventive guardlays because they will stop certain actions from happening from the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 184.32,
      "end": 189.36,
      "text": " very beginning. And just to give you an example, you might create an SCP that says this particular"
    },
    {
      "speakerLabel": "spk_0",
      "start": 189.36,
      "end": 193.68,
      "text": " set of accounts cannot spin up a large EC2 instance. And that's something that at the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 193.68,
      "end": 198.32000000000002,
      "text": " account level is not going to be possible at all. It's like a policy that stops that action"
    },
    {
      "speakerLabel": "spk_0",
      "start": 198.32000000000002,
      "end": 204.08,
      "text": " from happening. You can also use things like AWS Config Rule for compliance. These are more"
    },
    {
      "speakerLabel": "spk_0",
      "start": 204.08,
      "end": 209.12,
      "text": " detective guardrails because they don't necessarily stop the action, but they will inform you if"
    },
    {
      "speakerLabel": "spk_0",
      "start": 209.12,
      "end": 213.92000000000002,
      "text": " certain things that are not compliant are actually happening in a given account. As just as an"
    },
    {
      "speakerLabel": "spk_0",
      "start": 213.92,
      "end": 220.72,
      "text": " example, I was looking into the set of managed rules that you get with AWS Config. And one of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 220.72,
      "end": 226.56,
      "text": " them is if you have an API gateway, you might want to have X-Ray enabled in all of them. So you might"
    },
    {
      "speakerLabel": "spk_0",
      "start": 226.56,
      "end": 231.27999999999997,
      "text": " enable that rule for you and it's going to notify you if somebody creates an API gateway that doesn't"
    },
    {
      "speakerLabel": "spk_0",
      "start": 231.27999999999997,
      "end": 236.48,
      "text": " support, doesn't have X-Ray enabled. Another one is CrowdTrail for log auditing."
    },
    {
      "speakerLabel": "spk_0",
      "start": 237.04,
      "end": 241.35999999999999,
      "text": " And this is actually really, really important. Imagine if you know that some credentials may"
    },
    {
      "speakerLabel": "spk_0",
      "start": 241.36,
      "end": 246.48000000000002,
      "text": " have been leaked and you want to investigate if they were used and for what. If you have"
    },
    {
      "speakerLabel": "spk_0",
      "start": 246.48000000000002,
      "end": 250.16000000000003,
      "text": " CrowdTrail configured from the very beginning, you know that you have coverage across all your"
    },
    {
      "speakerLabel": "spk_0",
      "start": 250.16000000000003,
      "end": 255.28,
      "text": " own accounts and you can have that peace of mind that if you ever need to check something,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 255.28,
      "end": 260.16,
      "text": " you can just go there and access that information. Another important thing is Delegated Administrator"
    },
    {
      "speakerLabel": "spk_0",
      "start": 260.16,
      "end": 268.24,
      "text": " Accounts. So basically, if you need to run important services in the management account,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 268.24,
      "end": 274.48,
      "text": " you basically don't want to use the management account for pretty much almost anything. You want"
    },
    {
      "speakerLabel": "spk_0",
      "start": 274.48,
      "end": 279.2,
      "text": " to use other accounts. And the reason is because the management account is somewhat special"
    },
    {
      "speakerLabel": "spk_0",
      "start": 279.2,
      "end": 283.12,
      "text": " because certain security features like service control policies don't really apply to them."
    },
    {
      "speakerLabel": "spk_0",
      "start": 283.76,
      "end": 289.76,
      "text": " So basically, if you want to make sure proper security is enforced, try to avoid to use the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 289.76,
      "end": 294.8,
      "text": " management account. So you need to think how do we delegate certain things to other administrator"
    },
    {
      "speakerLabel": "spk_0",
      "start": 294.8,
      "end": 300.88,
      "text": " accounts. And just to quickly mention other stuff that might be important, building alerts and budget,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 300.88,
      "end": 306.48,
      "text": " enabling things like Carduty and using security app, SSO, networking, creating, for instance,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 306.48,
      "end": 312.24,
      "text": " VPCs and connecting them, or even deployment of common resources. Maybe by standard, you want to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 312.24,
      "end": 317.84000000000003,
      "text": " have an event breach or an S3 bucket in every account. You might want to provision them"
    },
    {
      "speakerLabel": "spk_0",
      "start": 317.84000000000003,
      "end": 323.52,
      "text": " immediately as soon as the account is created. And again, just to reiterate, this idea is not"
    },
    {
      "speakerLabel": "spk_0",
      "start": 323.52,
      "end": 328.71999999999997,
      "text": " something that you need to do only if you are creating a landing zone from scratch, like if"
    },
    {
      "speakerLabel": "spk_0",
      "start": 328.71999999999997,
      "end": 332.88,
      "text": " for a new set of accounts, let's say, it's something you should think about even if you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 332.88,
      "end": 338,
      "text": " already have a large usage of AWS in your organization, but you never created all this"
    },
    {
      "speakerLabel": "spk_0",
      "start": 338,
      "end": 343.28,
      "text": " kind of governance structure. And now is the time to put all of that into place. So it definitely"
    },
    {
      "speakerLabel": "spk_0",
      "start": 343.28,
      "end": 350.08,
      "text": " seems like a lot of work, and I think it is actually. But we need to find powerful allies"
    },
    {
      "speakerLabel": "spk_0",
      "start": 350.08,
      "end": 354.24,
      "text": " here. And in general, things like infrastructure as code can make your life so much easier when"
    },
    {
      "speakerLabel": "spk_0",
      "start": 354.24,
      "end": 358.4,
      "text": " dealing with this stuff. What kind of tools can we use and do they all support infrastructure as code?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 358.4,
      "end": 362.71999999999997,
      "text": " What do you think, Oe? There are a lot of tools now."
    },
    {
      "speakerLabel": "spk_1",
      "start": 362.71999999999997,
      "end": 367.44,
      "text": " The set is growing and the capability of each is growing. And it's kind of catching up with what people actually want because it has been a"
    },
    {
      "speakerLabel": "spk_1",
      "start": 367.44,
      "end": 371.91999999999996,
      "text": " little bit difficult in the past. We're going to talk about three main ones, right? That's clues"
    },
    {
      "speakerLabel": "spk_1",
      "start": 371.91999999999996,
      "end": 377.03999999999996,
      "text": " in the title. The AWS solution is control tower, and we'll dive into that. Then you've got terraform,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 377.04,
      "end": 381.68,
      "text": " which a lot of people will gravitate towards anyway. And another really, really good one is"
    },
    {
      "speakerLabel": "spk_1",
      "start": 381.68,
      "end": 385.76000000000005,
      "text": " org formation, which is an open source one. And you have some other options. You could look at"
    },
    {
      "speakerLabel": "spk_1",
      "start": 385.76000000000005,
      "end": 392.24,
      "text": " CDK. You could just look at using CloudFormation directly with stack sets and custom scripting or"
    },
    {
      "speakerLabel": "spk_1",
      "start": 392.24,
      "end": 397.36,
      "text": " orchestration to apply it to multiple accounts. You can't provision accounts with CloudFormation."
    },
    {
      "speakerLabel": "spk_1",
      "start": 397.36,
      "end": 401.20000000000005,
      "text": " You can set up individual accounts with CloudFormation, but there are some gaps you need"
    },
    {
      "speakerLabel": "spk_1",
      "start": 401.20000000000005,
      "end": 404.48,
      "text": " to address yourself, and then you have to orchestrate it all. So we're going to focus on"
    },
    {
      "speakerLabel": "spk_1",
      "start": 404.48,
      "end": 409.04,
      "text": " control tower, org formation, and terraform. And we might as well start with control tower,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 409.04,
      "end": 414.16,
      "text": " since this is the one that AWS is pushing and talking a lot about. It has been, I guess,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 414.16,
      "end": 418.40000000000003,
      "text": " built on over the years and is becoming more and more capable. I think people are beginning to take"
    },
    {
      "speakerLabel": "spk_1",
      "start": 418.40000000000003,
      "end": 423.20000000000005,
      "text": " it more and more seriously as a contender here. The main thing I would say about control tower"
    },
    {
      "speakerLabel": "spk_1",
      "start": 423.20000000000005,
      "end": 428.72,
      "text": " and that differentiates it from all the others is that it's all driven from the console. So while"
    },
    {
      "speakerLabel": "spk_1",
      "start": 428.72,
      "end": 434.72,
      "text": " you can have some customizations in source control, it's not really infrastructure as code get ups"
    },
    {
      "speakerLabel": "spk_1",
      "start": 434.72,
      "end": 439.76000000000005,
      "text": " from the beginning. The setup and the administration of it is all through the AWS Management"
    },
    {
      "speakerLabel": "spk_1",
      "start": 439.76000000000005,
      "end": 444.56,
      "text": " Console. Now, this is great for some people. I know a lot of people who think this is fine,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 444.56,
      "end": 448.72,
      "text": " but it's not for everyone, particularly if you want to have all that control and visibility"
    },
    {
      "speakerLabel": "spk_1",
      "start": 448.72,
      "end": 453.20000000000005,
      "text": " that goes with infrastructure as code. I think one of the good things about the control tower"
    },
    {
      "speakerLabel": "spk_1",
      "start": 453.20000000000005,
      "end": 457.76000000000005,
      "text": " approach is that it has an opinionated set of recommendations and best practices out of the box."
    },
    {
      "speakerLabel": "spk_1",
      "start": 457.76,
      "end": 462.15999999999997,
      "text": " So it can help you to kind of jumpstart setup without worrying about all the different decisions"
    },
    {
      "speakerLabel": "spk_1",
      "start": 462.15999999999997,
      "end": 467.12,
      "text": " you have to make. AWS are basically just giving you the recommendation. With other solutions,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 467.12,
      "end": 471.76,
      "text": " you tend to have to codify all of these practices yourself, although you can always take the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 471.76,
      "end": 477.12,
      "text": " approach, which I have seen plenty of people do, which is just to copy and replicate the control"
    },
    {
      "speakerLabel": "spk_1",
      "start": 477.12,
      "end": 481.44,
      "text": " tower best practices in one of the other tools. Cost wise, there's no additional cost for control"
    },
    {
      "speakerLabel": "spk_1",
      "start": 481.44,
      "end": 487.2,
      "text": " tower itself because it is essentially something that orchestrates a lot of other AWS services."
    },
    {
      "speakerLabel": "spk_1",
      "start": 487.2,
      "end": 492.4,
      "text": " And it's those services under the hood that you'll pay for things like AWS Config and Cloud Trail and"
    },
    {
      "speakerLabel": "spk_1",
      "start": 492.4,
      "end": 497.03999999999996,
      "text": " all the rest. When you go into the console and you set up control tower, it'll set up an"
    },
    {
      "speakerLabel": "spk_1",
      "start": 497.03999999999996,
      "end": 502.56,
      "text": " organizational unit structure for you with security OU, which is the one it has to create"
    },
    {
      "speakerLabel": "spk_1",
      "start": 502.56,
      "end": 507.28,
      "text": " from the start. It mandates that one. You can also create a sandbox OU for other accounts"
    },
    {
      "speakerLabel": "spk_1",
      "start": 507.28,
      "end": 511.52,
      "text": " at the start, and then it'll create your log archive account and your audit account."
    },
    {
      "speakerLabel": "spk_1",
      "start": 511.52,
      "end": 517.52,
      "text": " It will also create things like the identity center, SSO users, if you want that, and"
    },
    {
      "speakerLabel": "spk_1",
      "start": 518.24,
      "end": 522.16,
      "text": " create service control policies from the start. So it'll do things like ensuring that you can only"
    },
    {
      "speakerLabel": "spk_1",
      "start": 522.16,
      "end": 527.04,
      "text": " use the regions you want to use and other preventative and detective controls."
    },
    {
      "speakerLabel": "spk_1",
      "start": 527.84,
      "end": 533.76,
      "text": " So it's basically using things like AWS Config for the detective controls, AWS"
    },
    {
      "speakerLabel": "spk_1",
      "start": 534.48,
      "end": 539.12,
      "text": " service control policies for the preventative controls, and then it gives you a nice UI,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 539.12,
      "end": 543.92,
      "text": " a dashboard on top of all that, and it presents us all in pretty much one pane of glass."
    },
    {
      "speakerLabel": "spk_1",
      "start": 544.96,
      "end": 549.44,
      "text": " Now you can set it up with new accounts that don't even have an organization set up yet,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 549.44,
      "end": 555.76,
      "text": " or if you've already got an organization set up, you can kickstart control tower in there too."
    },
    {
      "speakerLabel": "spk_1",
      "start": 555.76,
      "end": 560.72,
      "text": " It'll basically just leave everything you have and set up new resources in parallel."
    },
    {
      "speakerLabel": "spk_1",
      "start": 560.72,
      "end": 565.2,
      "text": " So it doesn't migrate any existing stuff you have over to control tower or anything like that."
    },
    {
      "speakerLabel": "spk_1",
      "start": 565.2,
      "end": 567.92,
      "text": " It sounds pretty simple. It takes about half an hour to get it set up in an"
    },
    {
      "speakerLabel": "spk_1",
      "start": 567.92,
      "end": 572.9599999999999,
      "text": " account. But of course we know that there's a lot of services out there where they're quick to set"
    },
    {
      "speakerLabel": "spk_1",
      "start": 572.9599999999999,
      "end": 577.92,
      "text": " up, but can be painful to run in the long run. With control tower, it can be frustrating because"
    },
    {
      "speakerLabel": "spk_1",
      "start": 577.92,
      "end": 581.92,
      "text": " it does try to hide a lot of stuff from you. And when things go wrong, it can give you very vague"
    },
    {
      "speakerLabel": "spk_1",
      "start": 581.92,
      "end": 585.5999999999999,
      "text": " errors. Like I've seen errors that just say fail to set up landing zone, please try again."
    },
    {
      "speakerLabel": "spk_1",
      "start": 586.64,
      "end": 590.4,
      "text": " And you don't really know what to do with that. And I was actually just trying with this today"
    },
    {
      "speakerLabel": "spk_1",
      "start": 591.1999999999999,
      "end": 595.8399999999999,
      "text": " as preparation for the episode in one of my own accounts, I went through the control tower"
    },
    {
      "speakerLabel": "spk_1",
      "start": 595.84,
      "end": 601.44,
      "text": " process and it failed because it said there was some error saying, oh, we can't deploy the stack"
    },
    {
      "speakerLabel": "spk_1",
      "start": 601.44,
      "end": 606.5600000000001,
      "text": " because the bucket policy for the CloudTrail bucket has an invalid bucket policy. And I was"
    },
    {
      "speakerLabel": "spk_1",
      "start": 606.5600000000001,
      "end": 610.96,
      "text": " thinking, well, I didn't create the policy, control tower did, yet it failed. So it can have a few"
    },
    {
      "speakerLabel": "spk_1",
      "start": 610.96,
      "end": 616.32,
      "text": " rough edges. And I sometimes think that control tower is best if you've got somebody from AWS,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 616.32,
      "end": 620.1600000000001,
      "text": " like your technical account manager, your solutions architect, or a good support"
    },
    {
      "speakerLabel": "spk_1",
      "start": 620.16,
      "end": 624.56,
      "text": " or a good support agreement in place and they can guide you through the process."
    },
    {
      "speakerLabel": "spk_1",
      "start": 625.76,
      "end": 630,
      "text": " Now, there are some pretty cool features like the account factory. So we mentioned the ability to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 630,
      "end": 636.24,
      "text": " create new accounts in an automated way. Control tower has this account factory, which allows users"
    },
    {
      "speakerLabel": "spk_1",
      "start": 636.24,
      "end": 640.3199999999999,
      "text": " to come along and self provision accounts. And then you can deploy resources into them,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 640.3199999999999,
      "end": 645.04,
      "text": " like specific service catalog products. So you can ensure that people can self serve when they need"
    },
    {
      "speakerLabel": "spk_1",
      "start": 645.04,
      "end": 649.68,
      "text": " new accounts, but you can also have some guardrails around that. That's pretty nice. Another thing they"
    },
    {
      "speakerLabel": "spk_1",
      "start": 649.68,
      "end": 656.3199999999999,
      "text": " have is customizations. So control tower customizations are a means for you as an"
    },
    {
      "speakerLabel": "spk_1",
      "start": 656.9599999999999,
      "end": 661.1999999999999,
      "text": " administrator of an organization to say when people create new accounts, resources can be"
    },
    {
      "speakerLabel": "spk_1",
      "start": 661.1999999999999,
      "end": 666.4799999999999,
      "text": " automatically provisioned in them. So the way you work with control tower customizations is actually"
    },
    {
      "speakerLabel": "spk_1",
      "start": 666.4799999999999,
      "end": 671.04,
      "text": " a whole CloudFormation template you deploy once you've got your landings on set up. And that puts"
    },
    {
      "speakerLabel": "spk_1",
      "start": 671.04,
      "end": 676.0799999999999,
      "text": " a whole load of resources into your AWS account, like event bridge rules and step functions,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 676.08,
      "end": 680.64,
      "text": " a code commit repository, code pipeline, S3 buckets, CloudFormation, the whole lot."
    },
    {
      "speakerLabel": "spk_1",
      "start": 681.5200000000001,
      "end": 686.4000000000001,
      "text": " And it's basically this big machine that will listen for things like control tower accounts"
    },
    {
      "speakerLabel": "spk_1",
      "start": 686.4000000000001,
      "end": 690.96,
      "text": " being created. And then it responds to that event, kicks off Lambda functions, code pipeline,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 690.96,
      "end": 695.76,
      "text": " pulls templates from your code commit repository and deploys them to all the different accounts."
    },
    {
      "speakerLabel": "spk_1",
      "start": 695.76,
      "end": 700.8000000000001,
      "text": " So it works pretty well and it achieves the goal of having the ability to customize what happens"
    },
    {
      "speakerLabel": "spk_1",
      "start": 700.8000000000001,
      "end": 704.88,
      "text": " when an account is created. I have to say though, that the whole implementation scares me a lot."
    },
    {
      "speakerLabel": "spk_1",
      "start": 704.88,
      "end": 710.56,
      "text": " It's one of those features that it seems like a Rube Goldberg machine where you've got all these"
    },
    {
      "speakerLabel": "spk_1",
      "start": 710.56,
      "end": 716.24,
      "text": " AWS services and one thing happens, it kicks off another, kicks off another event. And there's,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 716.24,
      "end": 720.32,
      "text": " if you can look at the step function implementation, it's like got an amazing number"
    },
    {
      "speakerLabel": "spk_1",
      "start": 720.32,
      "end": 724.56,
      "text": " of states. And I just kind of worry a little bit about what will happen when this goes wrong and I"
    },
    {
      "speakerLabel": "spk_1",
      "start": 724.56,
      "end": 728.56,
      "text": " have to troubleshoot it because it's a bit of a leaky abstraction, if you know what I mean."
    },
    {
      "speakerLabel": "spk_1",
      "start": 729.6,
      "end": 732.88,
      "text": " So, but control tower is getting a lot of popularity and I think a lot of even bigger"
    },
    {
      "speakerLabel": "spk_1",
      "start": 732.88,
      "end": 738,
      "text": " companies now enterprises are starting to adopt it. So it's definitely worth checking out,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 738,
      "end": 742.96,
      "text": " especially if you're of the kind of letting AWS worry about it approach and don't want that"
    },
    {
      "speakerLabel": "spk_1",
      "start": 742.96,
      "end": 747.28,
      "text": " really tight control and customizability yourself. What other options should we talk about next?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 747.28,
      "end": 751.52,
      "text": " Let's talk about our information. It is definitely quite different from control tower."
    },
    {
      "speakerLabel": "spk_0",
      "start": 752.32,
      "end": 758.08,
      "text": " The main thing is that is a total open source project. So it's a community effort. And the good"
    },
    {
      "speakerLabel": "spk_0",
      "start": 758.08,
      "end": 762.56,
      "text": " news about that is that if anything feels like magic, you just go and get up, check out the code"
    },
    {
      "speakerLabel": "spk_0",
      "start": 762.56,
      "end": 769.1199999999999,
      "text": " and try to figure out exactly what's happening when the magic behavior is presented. It focuses"
    },
    {
      "speakerLabel": "spk_0",
      "start": 769.1199999999999,
      "end": 774.64,
      "text": " on simple extensions. So it's basically trying to enhance the capabilities of cloud formation"
    },
    {
      "speakerLabel": "spk_0",
      "start": 775.4399999999999,
      "end": 780.0799999999999,
      "text": " and then makes it a little bit simpler and more intuitive in a way, because if you know"
    },
    {
      "speakerLabel": "spk_0",
      "start": 780.0799999999999,
      "end": 784.8,
      "text": " cloud formation, you can understand what's missing and what org formation is giving you on top of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 784.8,
      "end": 791.1199999999999,
      "text": " cloud formation. And because it supports cloud formation, the idea is that they keep extending"
    },
    {
      "speakerLabel": "spk_0",
      "start": 791.12,
      "end": 796.4,
      "text": " on the idea of using YAML files. So it's all infrastructure as code. You have a special CLI"
    },
    {
      "speakerLabel": "spk_0",
      "start": 796.4,
      "end": 801.52,
      "text": " that you need to install from the repository. And at that point, you can use the CLI to give you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 801.52,
      "end": 806.88,
      "text": " kind of an initial structure where it can create all the, you can import all the existing AWS"
    },
    {
      "speakerLabel": "spk_0",
      "start": 806.88,
      "end": 810.88,
      "text": " account that you might already have. And it generates all the YAML files that contain the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 810.88,
      "end": 816.24,
      "text": " definition. And that could be a starting point for you. For instance, it's going to also figure out"
    },
    {
      "speakerLabel": "spk_0",
      "start": 816.24,
      "end": 823.12,
      "text": " if you have SCPs, it's going to import all of them into this definition. And again, this is a great"
    },
    {
      "speakerLabel": "spk_0",
      "start": 823.12,
      "end": 828,
      "text": " thing because at that point you can put all of this stuff in a repository and then you can manage"
    },
    {
      "speakerLabel": "spk_0",
      "start": 828,
      "end": 834.96,
      "text": " changes into your account structure using source control. When you want to deploy changes,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 834.96,
      "end": 839.92,
      "text": " it's basically running cloud formation, but it needs to orchestrate the execution of different"
    },
    {
      "speakerLabel": "spk_0",
      "start": 839.92,
      "end": 846.9599999999999,
      "text": " cloud formation stacks across multiple regions and accounts. And it can do that in parallel as well."
    },
    {
      "speakerLabel": "spk_0",
      "start": 846.9599999999999,
      "end": 851.68,
      "text": " It is interesting there because you might be wondering, okay, that's a fairly complicated"
    },
    {
      "speakerLabel": "spk_0",
      "start": 851.68,
      "end": 856.88,
      "text": " bit to execute correctly. And if there is an issue or in order to understand what's actually"
    },
    {
      "speakerLabel": "spk_0",
      "start": 856.88,
      "end": 862.0799999999999,
      "text": " changing or not, it needs to keep the state somewhere. And if you have been using Terraform,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 862.0799999999999,
      "end": 866.16,
      "text": " that concept should be very clear to you. How do you manage the state of changes?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 866.16,
      "end": 872.16,
      "text": " And it turns out that org formation uses the same idea, so it can manage its own state and it stores"
    },
    {
      "speakerLabel": "spk_0",
      "start": 872.16,
      "end": 877.28,
      "text": " it into an S3 bucket. So you can actually check it out how it is stored and how it keeps track of all"
    },
    {
      "speakerLabel": "spk_0",
      "start": 877.28,
      "end": 884.4,
      "text": " the changes. You can use it to manage the organization and accounts, but also you can deploy"
    },
    {
      "speakerLabel": "spk_0",
      "start": 884.4,
      "end": 889.92,
      "text": " stacks to multiple accounts. So in that way, it's similar to Control Tower because if you want to"
    },
    {
      "speakerLabel": "spk_0",
      "start": 889.92,
      "end": 894.24,
      "text": " provision a new account and deploy a set of resources, you can easily do that as well."
    },
    {
      "speakerLabel": "spk_0",
      "start": 894.24,
      "end": 899.04,
      "text": " And the way you do that is by just defining cloud formation code. So if you are familiar with cloud"
    },
    {
      "speakerLabel": "spk_0",
      "start": 899.04,
      "end": 903.52,
      "text": " formation, that shouldn't be anything surprising. You should be able to use it and learn how to do"
    },
    {
      "speakerLabel": "spk_0",
      "start": 903.52,
      "end": 907.6800000000001,
      "text": " that very, very quickly. There have been some interesting developments. For instance, you can"
    },
    {
      "speakerLabel": "spk_0",
      "start": 907.6800000000001,
      "end": 912.32,
      "text": " use CDK and Terraform as well, if that's something that you would prefer to use. So this is actually"
    },
    {
      "speakerLabel": "spk_0",
      "start": 912.32,
      "end": 917.04,
      "text": " a nice feature because it gives you still all that kind of orchestration, but then you can pick the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 917.04,
      "end": 921.2,
      "text": " tool of your choice to write the infrastructure as code for the things you want to provision in"
    },
    {
      "speakerLabel": "spk_0",
      "start": 921.2,
      "end": 926,
      "text": " every account. And another very cool feature, which is probably a little bit outside the scope,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 926,
      "end": 931.12,
      "text": " but still very closely related to the project, is that there are plenty of custom cloud formation"
    },
    {
      "speakerLabel": "spk_0",
      "start": 931.12,
      "end": 936.08,
      "text": " resources that you can use to basically fill the gaps where cloud formation is lacking a little"
    },
    {
      "speakerLabel": "spk_0",
      "start": 936.08,
      "end": 940.96,
      "text": " bit. For instance, SSO assignment groups, service quotas, and much more. There is a repository, we"
    },
    {
      "speakerLabel": "spk_0",
      "start": 940.96,
      "end": 945.6800000000001,
      "text": " will have the link in the show notes that you can check out to see all the additional resources that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 945.6800000000001,
      "end": 950.24,
      "text": " the project is providing to you to make this whole experience even more powerful. This is"
    },
    {
      "speakerLabel": "spk_0",
      "start": 950.24,
      "end": 955.6,
      "text": " powerful. There is one big limitation. I have to say I really like it, but we have to be fair"
    },
    {
      "speakerLabel": "spk_0",
      "start": 955.6,
      "end": 961.28,
      "text": " and mention the limitation as well. It is not simple to do a diff, for instance, when you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 961.28,
      "end": 966.8,
      "text": " have done a number of changes in your infrastructure as code definition and before you deploy,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 967.76,
      "end": 973.04,
      "text": " you want some kind of reassurance that the changes you are trying to apply are actually the ones that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 973.04,
      "end": 977.36,
      "text": " you want to see, like the effect is actually something you might want to see before applying"
    },
    {
      "speakerLabel": "spk_0",
      "start": 977.36,
      "end": 983.36,
      "text": " it. That feature is missing, so if you're doing something serious, it's not as simple as doing"
    },
    {
      "speakerLabel": "spk_0",
      "start": 983.36,
      "end": 988.5600000000001,
      "text": " a Terraform diff or a CDK diff if you have used these other tools. That feature is simply lacking,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 988.5600000000001,
      "end": 994.4,
      "text": " so you just run it and hope that everything goes well. Maybe something that can be fixed at some"
    },
    {
      "speakerLabel": "spk_0",
      "start": 994.4,
      "end": 1001.36,
      "text": " point in the future, but right now it's a pretty important lacking feature that is worth mentioning."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1002.16,
      "end": 1006.88,
      "text": " There are some very good examples which you can use as a starting point to create your own"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1006.88,
      "end": 1011.84,
      "text": " landing zone structure, and we will have a link to the specific part of the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1011.84,
      "end": 1016,
      "text": " repository that has the examples in the show notes. That's pretty much it. Should we talk"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1016,
      "end": 1021.28,
      "text": " about Terraform?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1021.28,
      "end": 1026.72,
      "text": " Terraform is one thing that's going to give you a good diff, which is probably a marked difference to OrgFormation. Although, I suppose, with OrgFormation, we have had the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1026.72,
      "end": 1031.28,
      "text": " ability here for theorem to work around it by just implementing our own diff on top of it,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1031.28,
      "end": 1037.04,
      "text": " but it would really be nice to have proper implementation. Now, if you're not excited by"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1037.04,
      "end": 1041.92,
      "text": " OrgFormation because of these disadvantages, they both have limitations when it comes to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1041.92,
      "end": 1047.28,
      "text": " either feature set or the level of control and visibility you get, but Terraform is a lot more"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1047.28,
      "end": 1051.6,
      "text": " mature than either of those solutions, I'd say. Now, it's not necessarily designed for multi-account"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1051.6,
      "end": 1056,
      "text": " deployment, especially across a large number of accounts, but it still has a lot of distinct"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1056,
      "end": 1061.68,
      "text": " advantages. You could provision AWS organizations and accounts just as Terraform resources,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1061.68,
      "end": 1066.24,
      "text": " and there's a lot of great community modules that make this whole setup easy as well."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1066.96,
      "end": 1070.64,
      "text": " You can also create your own modules for resources that you want to be deployed across multiple"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1070.64,
      "end": 1078.08,
      "text": " accounts to make it easy for teams to get onboarded quickly. I think the whole idea of"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1078.08,
      "end": 1083.04,
      "text": " using Terraform for this has improved with Terraform Cloud as well, which is just a really"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1083.04,
      "end": 1088.8799999999999,
      "text": " nice managed solution to manage your projects and your workspaces and integrates very well into"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1088.8799999999999,
      "end": 1093.12,
      "text": " GitHub and AWS. Previously, it was a little bit difficult when you had to manage your state"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1093.12,
      "end": 1100.24,
      "text": " yourself with S3 or DynamoDB. Terraform Cloud makes that a much more taken care of, robust"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1100.24,
      "end": 1106.1599999999999,
      "text": " solution. You can also provision non-AWS resources, another major advantage. So if you wanted to think"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1106.1599999999999,
      "end": 1112.32,
      "text": " about deploying Azure resources or GitHub repositories or even Terraform Cloud workspaces"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1112.32,
      "end": 1117.6799999999998,
      "text": " themselves, you can do that with Terraform modules and do it in the same projects as your AWS"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1117.6799999999998,
      "end": 1123.2,
      "text": " resources. When you do this, you get very nice deployment controls, so you can have really nice"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1123.2,
      "end": 1129.76,
      "text": " GitOps workflows, and you can see when you have pull requests with changes to your infrastructure"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1129.76,
      "end": 1133.84,
      "text": " and your organization, you'll get a very nice Terraform plan. It'll integrate well into your"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1133.84,
      "end": 1138.3999999999999,
      "text": " pull requests. You get a really good visibility of it in Terraform Cloud, and you can put in place"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1138.4,
      "end": 1144.96,
      "text": " manual approvals. So I think if you're a mature organization already familiar with Terraform,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1144.96,
      "end": 1151.1200000000001,
      "text": " this is going to really appeal to you. I think the only real disadvantage with Terraform is that"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1152.0800000000002,
      "end": 1159.1200000000001,
      "text": " it's not really that easy, I don't know the good way at least, to have a dynamic number of Terraform"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1159.1200000000001,
      "end": 1162.88,
      "text": " providers. And when you're deploying to multiple AWS accounts, which is essentially what we're"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1162.88,
      "end": 1167.92,
      "text": " talking about here, you have to pretty much declare each Terraform provider for each account."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1167.92,
      "end": 1172.96,
      "text": " So it doesn't really have a seamless kind of account factory way, or for every account,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1172.96,
      "end": 1178.48,
      "text": " deploy the same stack concept like you do with control data and information. The more idiomatic"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1178.48,
      "end": 1183.68,
      "text": " approach in Terraform is basically to copy paste the boilerplate at the start that says, okay,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1183.68,
      "end": 1190.24,
      "text": " here's my entry point, my main for a new account. And then within that, you just use modules to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1190.24,
      "end": 1194.0800000000002,
      "text": " compose everything else that goes underneath it. So you don't have to have a massive copy paste"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1194.08,
      "end": 1198.8799999999999,
      "text": " everywhere, but you do have to have a kind of copy paste the entry point. And once you do that,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1198.8799999999999,
      "end": 1205.52,
      "text": " then you can integrate it seamlessly into your deployment workflow and get your diffs. You can"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1205.52,
      "end": 1210.32,
      "text": " get Terraform plan, which is like a really nice feature every time you have a pull request. And"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1210.32,
      "end": 1216.3999999999999,
      "text": " then when you merge it, you can have your approval workflow. I'm not an expert in this area at all,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1216.3999999999999,
      "end": 1220.8,
      "text": " but luckily we have a colleague, Connor Marr, who has done a huge amount of work in this space. And"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1220.8,
      "end": 1225.76,
      "text": " he's also provided a nice demo repository showcasing a really nice mature landings on"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1225.76,
      "end": 1230.8,
      "text": " set up with Terraform cloud, AWS and GitHub, and it's well documented as well. So we'll have that"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1230.8,
      "end": 1236.48,
      "text": " link to Connor's Terraform demo in the show notes."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1236.48,
      "end": 1242.8,
      "text": " Yeah, let's close this episode with some honorable mentions. Another one is CDK. And there is a specific example that we will have"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1242.8,
      "end": 1248.56,
      "text": " again in the show notes that shows how to do landing zones using CDK. It's not necessarily"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1248.56,
      "end": 1254.48,
      "text": " the best solution for OptiMs or anyone will prefer a more declarative approach because CDK is more"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1254.48,
      "end": 1259.52,
      "text": " like use a programming language and you instantiate classes that represent resources and then combine"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1259.52,
      "end": 1263.36,
      "text": " them together. So it might be a little bit different from what you're used to if you do"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1263.36,
      "end": 1270.08,
      "text": " declarative stuff, but it's still very powerful and it's still a very good dynamic way of doing"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1270.08,
      "end": 1275.6799999999998,
      "text": " the provisioning of all the different accounts in your landing zone structure. And you can make it"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1275.68,
      "end": 1280.96,
      "text": " very modular by using this idea of constructs that are somewhat similar to Terraform modules,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1280.96,
      "end": 1286.24,
      "text": " but again more in the concept of a programming languages where you can import a library and that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1286.24,
      "end": 1290.8,
      "text": " gives you a class that you can just instantiate and represents like an entire stack where you can"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1290.8,
      "end": 1298,
      "text": " apply certain customizations very easily. So CDK is an option and you might want to consider it as"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1298,
      "end": 1303.2,
      "text": " well, especially if you have CDK experience. The other one is AWS Control Tower account factory for"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1303.2,
      "end": 1309.3600000000001,
      "text": " Terraform, also called AFT for short, and it's a way of using Terraform to customize accounts"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1309.3600000000001,
      "end": 1313.44,
      "text": " instead of cloud formation. And once you have Control Tower landing zone already set up,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1313.44,
      "end": 1318.0800000000002,
      "text": " you can enable that and then use Terraform if that's something that's more familiar to you."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1318.8,
      "end": 1324.0800000000002,
      "text": " We didn't try it yet, so we just heard people using it and being relatively happy with it, so"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1324.88,
      "end": 1329.68,
      "text": " check it out. It might be worth experimenting, especially if you like kind of this mix of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1329.68,
      "end": 1335.6000000000001,
      "text": " features that come from Control Tower, but you also like the Terraform more as a kind of language"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1335.6000000000001,
      "end": 1342,
      "text": " for writing resource definitions. Now to wrap things up, I'm gonna try to do a quick summary."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1342,
      "end": 1347.76,
      "text": " I think what we mentioned today is that the best option is really... it depends on your context. I"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1347.76,
      "end": 1353.28,
      "text": " know it's a bit of a cliche answer, but it really depends on the level of expertise in your company,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1353.28,
      "end": 1359.1200000000001,
      "text": " the kind of tools that you might have used already, and if you prefer a specific approach in terms of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1359.12,
      "end": 1364.56,
      "text": " maybe you prefer to go through the UI, then Control Tower might be a little bit more friendly to you."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1364.56,
      "end": 1369.36,
      "text": " You prefer to do infrastructure as code, so maybe Terraform or Orgo formation are a little bit more"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1369.36,
      "end": 1374.1599999999999,
      "text": " ideal in that sense, so definitely try to weight all the pros and cons of the different approaches"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1374.1599999999999,
      "end": 1381.52,
      "text": " and pick the one that might be most suitable for your organization. I think if Control Tower had"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1381.52,
      "end": 1386.9599999999998,
      "text": " some way of supporting infrastructure as code, it would come out much stronger, at least in our view"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1386.96,
      "end": 1391.68,
      "text": " in this comparison, but it's still a good tool if you don't really care too much about infrastructure"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1391.68,
      "end": 1397.8400000000001,
      "text": " as code. We will have more links in the show notes. We found some more additional deep dives"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1397.8400000000001,
      "end": 1401.6000000000001,
      "text": " and additional material that you might want to check out to understand even more about this topic."
    },
    {
      "speakerLabel": "spk_0",
      "start": 1402.32,
      "end": 1407.28,
      "text": " And again, there are probably many solutions out there. Let us know what works for you,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1407.28,
      "end": 1411.76,
      "text": " if you liked a specific tool, why, or if you didn't like some of them, what is the issue that is"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1411.76,
      "end": 1415.92,
      "text": " missing. I think if we can have an healthy conversation about these tools, especially on"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1415.92,
      "end": 1419.76,
      "text": " the open source ones, chances are that we can get the features that we are looking for, and we can"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1419.76,
      "end": 1424.64,
      "text": " even contribute to make these features happen. Now, one last thing that I have to say is that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1424.64,
      "end": 1431.6000000000001,
      "text": " we are approaching 100 videos and almost 2,000 subscribers on YouTube, so please help us reach"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1431.6000000000001,
      "end": 1436,
      "text": " out to that milestone by subscribing, and if you can please share this podcast with your colleagues"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1436,
      "end": 1441.1200000000001,
      "text": " and friends, we would greatly appreciate that. So thank you very much, and we'll see you in the next"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1441.12,
      "end": 1447.76,
      "text": " episode."
    }
  ]
}