{
  "speakers": {
    "spk_0": "Eoin",
    "spk_1": "Luciano"
  },
  "segments": [
    {
      "speakerLabel": "spk_0",
      "start": 0,
      "end": 3.84,
      "text": " If you're building a new workload on AWS or migrating an old one,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 3.84,
      "end": 8,
      "text": " it's always a good idea to start with a Minimal Viable Product or an MVP."
    },
    {
      "speakerLabel": "spk_0",
      "start": 8,
      "end": 13.44,
      "text": " But what is an MVP and how does it differ from a proof of concept or prototype?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 13.44,
      "end": 15.44,
      "text": " What is the minimum you should do?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 15.44,
      "end": 20.72,
      "text": " And how do you ensure that everyone has clear expectations around what the outcome should be?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 20.72,
      "end": 31.04,
      "text": " My name is Eoghan. I'm here with Luciano and this is AWS Bytes."
    },
    {
      "speakerLabel": "spk_1",
      "start": 31.04,
      "end": 36.56,
      "text": " Okay. I guess we can start this podcast by asking, why are we asking this question in the first"
    },
    {
      "speakerLabel": "spk_1",
      "start": 36.56,
      "end": 42.56,
      "text": " place? Why do we feel that there is a disconnect with how do we perceive what is an MVP and what"
    },
    {
      "speakerLabel": "spk_1",
      "start": 42.56,
      "end": 46.56,
      "text": " people actually say when they talk about MVPs? Yeah. I see this quite a lot and maybe it's a"
    },
    {
      "speakerLabel": "spk_0",
      "start": 46.56,
      "end": 51.36,
      "text": " bit of a bugbear of mine, but we see teams embarking on a new project and the term MVP"
    },
    {
      "speakerLabel": "spk_0",
      "start": 51.36,
      "end": 56.72,
      "text": " gets used a lot. So often this term means a lot of different things to different people."
    },
    {
      "speakerLabel": "spk_0",
      "start": 56.72,
      "end": 61.2,
      "text": " And the lines are kind of blurred between what's an MVP and what's a proof of concept and what's"
    },
    {
      "speakerLabel": "spk_0",
      "start": 61.2,
      "end": 67.6,
      "text": " a prototype. I think it's a good idea to break these terms down and just figure out what the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 67.6,
      "end": 71.28,
      "text": " different differences are between them before we talk about how to build an MVP and make sure you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 71.28,
      "end": 77.84,
      "text": " set it up for success. So a prototype is not a product. It's like a rough idea used to demonstrate"
    },
    {
      "speakerLabel": "spk_0",
      "start": 77.84,
      "end": 82.4,
      "text": " some capability and it's something really useful, but it's ultimately a communication tool that you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 82.4,
      "end": 87.92,
      "text": " can use to show others what a product might be like, or just to get buy-in or even to get funding."
    },
    {
      "speakerLabel": "spk_0",
      "start": 87.92,
      "end": 93.44,
      "text": " So it's like a decision-making tool. Then on the other hand, you have a proof of concept or a POC,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 93.44,
      "end": 98.48,
      "text": " and that's typically designed to validate some assumptions, to test a hypothesis,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 98.48,
      "end": 102.08,
      "text": " or to just evaluate whether a technology is going to work for what you want to do."
    },
    {
      "speakerLabel": "spk_0",
      "start": 103.04,
      "end": 106.48,
      "text": " So for a POC, you should have a clear question you're trying to answer,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 106.48,
      "end": 111.12,
      "text": " or like a risk you're trying to remove, and you should know at the end of it whether you"
    },
    {
      "speakerLabel": "spk_0",
      "start": 111.12,
      "end": 117.60000000000001,
      "text": " can proceed or not. So neither of those two things, prototype or POC, neither of them are"
    },
    {
      "speakerLabel": "spk_0",
      "start": 117.60000000000001,
      "end": 121.44,
      "text": " really a product and they don't even have to become the nucleus of a product or grow into"
    },
    {
      "speakerLabel": "spk_0",
      "start": 121.44,
      "end": 125.36,
      "text": " a product. They're just part of the assessment and discovery phase of a project that you might"
    },
    {
      "speakerLabel": "spk_0",
      "start": 125.36,
      "end": 129.28,
      "text": " do at the start. So you could even throw away the code when you're finished, right? That's kind of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 129.28,
      "end": 134.08,
      "text": " what you should expect with those things. So they might be minimal, but they're not a product and"
    },
    {
      "speakerLabel": "spk_0",
      "start": 134.08,
      "end": 139.28,
      "text": " they're not viable either. Yeah, I like when you say you should also be able to throw away the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 139.28,
      "end": 144.32,
      "text": " code, because I feel that a lot of companies and people in general gets very attached to their"
    },
    {
      "speakerLabel": "spk_1",
      "start": 144.32,
      "end": 150.24,
      "text": " code. It's like the value is the code itself. While that might be true in most cases, the reality"
    },
    {
      "speakerLabel": "spk_1",
      "start": 150.24,
      "end": 154.72,
      "text": " is that the value is in the discovery that you made, that the value is in the proof that you"
    },
    {
      "speakerLabel": "spk_1",
      "start": 154.72,
      "end": 159.52,
      "text": " have created, that your idea might be successful or the technology might work for use case."
    },
    {
      "speakerLabel": "spk_1",
      "start": 159.52,
      "end": 162.72,
      "text": " So you can actually rewrite the code and probably the second time you're going to rewrite it,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 162.72,
      "end": 167.2,
      "text": " it's going to be even better. So I definitely like what you said there with throw away the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 167.2,
      "end": 172.07999999999998,
      "text": " code if it needs to be, that's not the value, that's not the product, the value somewhere else."
    },
    {
      "speakerLabel": "spk_1",
      "start": 172.07999999999998,
      "end": 176.16,
      "text": " But I guess the next question is given that we define what a prototype is, what a proof of"
    },
    {
      "speakerLabel": "spk_1",
      "start": 176.16,
      "end": 183.76,
      "text": " concept is, what is an MVP then if it's not these two things? Okay, so literally the first thing,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 183.76,
      "end": 189.35999999999999,
      "text": " it's minimal. So that's like going back to like Eric Ries and the Lean Startup and then the Lean"
    },
    {
      "speakerLabel": "spk_0",
      "start": 189.35999999999999,
      "end": 193.92,
      "text": " Enterprise, all these books are really good at telling you how to focus on what is really minimal"
    },
    {
      "speakerLabel": "spk_0",
      "start": 194.64,
      "end": 198.48,
      "text": " and you want to deliver the smallest amount of functionality you can get away with."
    },
    {
      "speakerLabel": "spk_0",
      "start": 198.48,
      "end": 204.95999999999998,
      "text": " Just kickstart that product feedback life cycle. So that's the minimal part. But then probably the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 204.95999999999998,
      "end": 209.92,
      "text": " difficult one is the viable bit. So when we're talking about viable, we're saying can your team"
    },
    {
      "speakerLabel": "spk_0",
      "start": 209.92,
      "end": 216.16,
      "text": " sustainably evolve and support the ongoing development and operations starting with this MVP."
    },
    {
      "speakerLabel": "spk_0",
      "start": 217.11999999999998,
      "end": 223.51999999999998,
      "text": " So a prototype just kind of held together with sticky tape is probably not viable. So it's"
    },
    {
      "speakerLabel": "spk_0",
      "start": 223.51999999999998,
      "end": 227.76,
      "text": " important to think about what viable is. And then when we say product, that means that you're aiming"
    },
    {
      "speakerLabel": "spk_0",
      "start": 227.76,
      "end": 231.6,
      "text": " this at real users with real needs and they're trying to get something important done with it."
    },
    {
      "speakerLabel": "spk_0",
      "start": 231.6,
      "end": 239.28,
      "text": " It should be ready to sell. And it should support meaningful scenarios that users are using. So"
    },
    {
      "speakerLabel": "spk_0",
      "start": 239.28,
      "end": 243.92,
      "text": " sometimes you hear things, people say, oh, we're building an MVP and we've got our MVP ready to go."
    },
    {
      "speakerLabel": "spk_0",
      "start": 243.92,
      "end": 249.12,
      "text": " But you might see or hear them say sometimes we're still deploying manually or we're already"
    },
    {
      "speakerLabel": "spk_0",
      "start": 249.12,
      "end": 254.72,
      "text": " planning a complete rewrite of this. This is just the early version and it's running on a single"
    },
    {
      "speakerLabel": "spk_0",
      "start": 254.72,
      "end": 260.56,
      "text": " EC2 instance in a public subnet. So maybe what you have in those cases is more of a prototype"
    },
    {
      "speakerLabel": "spk_0",
      "start": 260.56,
      "end": 265.68,
      "text": " than an MVP, but it's not just about the technology. And it doesn't mean that when you're"
    },
    {
      "speakerLabel": "spk_0",
      "start": 265.68,
      "end": 269.6,
      "text": " building an MVP that you have to boil the ocean and all of a sudden you have to achieve perfection."
    },
    {
      "speakerLabel": "spk_0",
      "start": 269.6,
      "end": 275.68,
      "text": " It's just about like you can still have an MVP that doesn't have any code at all."
    },
    {
      "speakerLabel": "spk_0",
      "start": 275.68,
      "end": 280.96,
      "text": " It's a completely manual approach based on Excel sheets and human interaction and a documented"
    },
    {
      "speakerLabel": "spk_0",
      "start": 280.96,
      "end": 286.64,
      "text": " process that can tick all the boxes for an MVP as long as it's sustainable. So it's not about"
    },
    {
      "speakerLabel": "spk_0",
      "start": 286.64,
      "end": 290.08,
      "text": " whether you have tech or not. It's important thing is that you've got really good performance"
    },
    {
      "speakerLabel": "spk_0",
      "start": 290.08,
      "end": 294,
      "text": " that you've got rigor that can actually support the users no matter what happens."
    },
    {
      "speakerLabel": "spk_0",
      "start": 294.64,
      "end": 297.12,
      "text": " And it's something you can build on and evolve over time."
    },
    {
      "speakerLabel": "spk_1",
      "start": 298.56,
      "end": 304.64,
      "text": " Yeah, I really like this definition and I suppose it makes sense to... Yeah, I agree that basically"
    },
    {
      "speakerLabel": "spk_1",
      "start": 304.64,
      "end": 311.28,
      "text": " the viable part is the one that most often is the one that gets the least amount of attention. And"
    },
    {
      "speakerLabel": "spk_1",
      "start": 311.28,
      "end": 316.24,
      "text": " it's something we should be focusing a little bit more at least for when it comes to the technical"
    },
    {
      "speakerLabel": "spk_1",
      "start": 316.24,
      "end": 320.40000000000003,
      "text": " side of things. We always disregard it and say, oh, we're going to do that later. It doesn't"
    },
    {
      "speakerLabel": "spk_1",
      "start": 320.40000000000003,
      "end": 325.04,
      "text": " matter right now. We can do this manually or we don't need testing right now. And then eventually"
    },
    {
      "speakerLabel": "spk_1",
      "start": 326,
      "end": 330.56,
      "text": " if the business goes well, it's very hard to keep up and it's not sustainable anymore because you"
    },
    {
      "speakerLabel": "spk_1",
      "start": 330.56,
      "end": 337.36,
      "text": " miss all these foundational blocks. So I suppose what's your perspective on this? What do you think"
    },
    {
      "speakerLabel": "spk_1",
      "start": 337.36,
      "end": 342.40000000000003,
      "text": " you should be putting in place as the bare minimum? I suppose mostly from a technical"
    },
    {
      "speakerLabel": "spk_1",
      "start": 342.4,
      "end": 348.23999999999995,
      "text": " perspective to consider that the product is viable and therefore it's sustainable."
    },
    {
      "speakerLabel": "spk_0",
      "start": 349.67999999999995,
      "end": 354.23999999999995,
      "text": " Okay. Well, if we take the M and the P first, let's say you... Let's assume that you've got"
    },
    {
      "speakerLabel": "spk_0",
      "start": 354.23999999999995,
      "end": 357.91999999999996,
      "text": " the right minimal set of features from the beginning and then you've got at the product side"
    },
    {
      "speakerLabel": "spk_0",
      "start": 357.91999999999996,
      "end": 363.28,
      "text": " a system to gather feedback and iterate on the product. Then in the middle, I'd say if you're"
    },
    {
      "speakerLabel": "spk_0",
      "start": 363.28,
      "end": 367.84,
      "text": " building a technical solution on AWS, you should try and put in the minimal fundamentals to make"
    },
    {
      "speakerLabel": "spk_0",
      "start": 367.84,
      "end": 373.2,
      "text": " it viable. And those would be things that you and I have talked about on the show a lot over the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 373.2,
      "end": 378,
      "text": " past 50 or so episodes. So we're talking about infrastructure as code, unit tests,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 378,
      "end": 384.08,
      "text": " end-to-end tests, automated deployment, some level of observability with like centralized logs,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 384.08,
      "end": 388.64,
      "text": " metrics, alerting, traces, some security fundamentals, of course, because otherwise"
    },
    {
      "speakerLabel": "spk_0",
      "start": 388.64,
      "end": 392.96,
      "text": " you've got a business risk that might really compromise your viability. Having the right"
    },
    {
      "speakerLabel": "spk_0",
      "start": 392.96,
      "end": 398.56,
      "text": " skills within your team is also something that makes your thing viable. So maybe, especially"
    },
    {
      "speakerLabel": "spk_0",
      "start": 398.56,
      "end": 402.64,
      "text": " in a startup scenario or even in a migration scenario while you're adopting the cloud,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 403.35999999999996,
      "end": 407.52,
      "text": " there might be a huge risk to supporting these workloads if you just kind of completely wing it"
    },
    {
      "speakerLabel": "spk_0",
      "start": 407.52,
      "end": 412.79999999999995,
      "text": " and don't have the skills in place or at least a plan to address skills gaps. So even think about"
    },
    {
      "speakerLabel": "spk_0",
      "start": 412.79999999999995,
      "end": 417.59999999999997,
      "text": " stuff like that as part of your MVP early on. And then of course, like documentation for onboarding"
    },
    {
      "speakerLabel": "spk_0",
      "start": 417.6,
      "end": 422.96000000000004,
      "text": " and troubleshooting from the start, right? So you can bring people in, new people as the team grows,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 422.96000000000004,
      "end": 428.96000000000004,
      "text": " et cetera, and you don't have to kind of, I suppose, train everybody up manually or rely"
    },
    {
      "speakerLabel": "spk_0",
      "start": 428.96000000000004,
      "end": 434,
      "text": " on them to kind of somehow assimilate all of the ideas that are in the code base. It's a good idea"
    },
    {
      "speakerLabel": "spk_0",
      "start": 434,
      "end": 441.04,
      "text": " to have some documented principles and training in place for people too. Yeah, I like what you"
    },
    {
      "speakerLabel": "spk_1",
      "start": 441.04,
      "end": 445.6,
      "text": " said there. And I think that was one of our previous episodes where we mentioned that we were"
    },
    {
      "speakerLabel": "spk_1",
      "start": 445.6,
      "end": 450.96000000000004,
      "text": " building a particular solution and we opted for just plain EC2 instances where we could have"
    },
    {
      "speakerLabel": "spk_1",
      "start": 450.96000000000004,
      "end": 455.92,
      "text": " gone with serverless and Docker, but we made that conscious choice because we knew that the team"
    },
    {
      "speakerLabel": "spk_1",
      "start": 455.92,
      "end": 460.72,
      "text": " that was working on this solution and eventually would need to support this solution didn't have a"
    },
    {
      "speakerLabel": "spk_1",
      "start": 460.72,
      "end": 465.52000000000004,
      "text": " lot of expertise with either serverless or Docker. So we will still want to achieve all the benefits"
    },
    {
      "speakerLabel": "spk_1",
      "start": 465.52000000000004,
      "end": 469.92,
      "text": " of the cloud while allowing the team to be able to support the solution long-term. So there was"
    },
    {
      "speakerLabel": "spk_1",
      "start": 469.92,
      "end": 473.68,
      "text": " kind of an interesting trade off where from an architectural perspective, maybe we would have"
    },
    {
      "speakerLabel": "spk_1",
      "start": 473.68,
      "end": 477.6,
      "text": " wanted to use something else, something more innovative, more kind of less management,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 477.6,
      "end": 481.2,
      "text": " but at the other side, we didn't want to overload the team with new knowledge that they didn't have"
    },
    {
      "speakerLabel": "spk_1",
      "start": 481.2,
      "end": 487.04,
      "text": " the time to create on the team and make it sustainable that way. But at the same time,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 487.04,
      "end": 491.84000000000003,
      "text": " it's interesting because you might wonder, isn't this too much work for an MVP, right?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 492.64,
      "end": 498,
      "text": " My opinion is that yes and no, it might look like a lot of work, but at the same time,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 498,
      "end": 502.8,
      "text": " if you do it in advance at the very beginning of your project, it's work that you can actually do"
    },
    {
      "speakerLabel": "spk_1",
      "start": 502.8,
      "end": 507.12,
      "text": " in an environment that helps you to do it. And it doesn't go against you because you are not focused"
    },
    {
      "speakerLabel": "spk_1",
      "start": 507.12,
      "end": 510.8,
      "text": " on serving the customer, but you're actually focused on building this foundation that later"
    },
    {
      "speakerLabel": "spk_1",
      "start": 510.8,
      "end": 514.8,
      "text": " will allow you to serve the customer. So definitely cheaper to do it sooner rather than"
    },
    {
      "speakerLabel": "spk_1",
      "start": 514.8,
      "end": 520.24,
      "text": " later in a project. And again, there are different degrees. You don't have to do it perfectly. You"
    },
    {
      "speakerLabel": "spk_1",
      "start": 520.24,
      "end": 527.28,
      "text": " don't have to do to have perfect infrastructure as called 100% coverage unit test or observability"
    },
    {
      "speakerLabel": "spk_1",
      "start": 527.28,
      "end": 533.04,
      "text": " with hundreds of metrics and alarms. You can build all these things and improve them over time."
    },
    {
      "speakerLabel": "spk_1",
      "start": 533.04,
      "end": 538.88,
      "text": " I think what's important is to have a basic, to have an understanding and to have something that"
    },
    {
      "speakerLabel": "spk_1",
      "start": 538.88,
      "end": 543.36,
      "text": " gives you enough indication of what's happening right now. And then over time, as you build new"
    },
    {
      "speakerLabel": "spk_1",
      "start": 543.36,
      "end": 550.4,
      "text": " features, you can tweak and improve also these aspects. So yeah, I guess that's also important"
    },
    {
      "speakerLabel": "spk_1",
      "start": 550.4,
      "end": 555.68,
      "text": " to understand that when we talk about all these items, they don't have to be something like fully"
    },
    {
      "speakerLabel": "spk_1",
      "start": 555.68,
      "end": 560.2399999999999,
      "text": " fledged 100%. You can build the bare minimum there, make sure that it works and it's going"
    },
    {
      "speakerLabel": "spk_1",
      "start": 560.2399999999999,
      "end": 564.7199999999999,
      "text": " to support you and over time make it better as you're going to be making better the entire product"
    },
    {
      "speakerLabel": "spk_1",
      "start": 564.7199999999999,
      "end": 571.04,
      "text": " itself. Agreed. Yeah. Keep it, go for the simplest possible implementation of each of those things."
    },
    {
      "speakerLabel": "spk_0",
      "start": 571.04,
      "end": 575.12,
      "text": " And then you've got a good foundation. You can always iterate on it later, but you've got"
    },
    {
      "speakerLabel": "spk_0",
      "start": 575.12,
      "end": 581.1999999999999,
      "text": " something. So what do you think in terms of, you mentioned one of the cases before you say that"
    },
    {
      "speakerLabel": "spk_1",
      "start": 581.2,
      "end": 586,
      "text": " sometimes there are businesses that they don't even have tech at all. They just run, maybe they"
    },
    {
      "speakerLabel": "spk_1",
      "start": 586,
      "end": 590.6400000000001,
      "text": " have Excel. That's the best that they do from a technical perspective, but everything else is"
    },
    {
      "speakerLabel": "spk_1",
      "start": 590.6400000000001,
      "end": 595.12,
      "text": " pretty much manual and it's still, it's a pretty successful and viable business. What do you think"
    },
    {
      "speakerLabel": "spk_1",
      "start": 595.12,
      "end": 600.1600000000001,
      "text": " is the risk there when they start to do digital transformation and actually implement a lot more"
    },
    {
      "speakerLabel": "spk_1",
      "start": 600.1600000000001,
      "end": 605.9200000000001,
      "text": " tech in their workflow? How do they have to think about an MVP and starting to bootstrap all that"
    },
    {
      "speakerLabel": "spk_1",
      "start": 605.92,
      "end": 613.5999999999999,
      "text": " process? So I guess the main point there is that you can have a really well oiled machine that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 613.5999999999999,
      "end": 617.8399999999999,
      "text": " isn't a machine that's completely human based and people who know exactly what they're doing,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 617.8399999999999,
      "end": 621.52,
      "text": " they know what the process is, they know where all the data is, they know how to use their Excel"
    },
    {
      "speakerLabel": "spk_0",
      "start": 621.52,
      "end": 626.56,
      "text": " sheets and they're really good at interfacing with the customer. And then when you take that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 626.56,
      "end": 631.1999999999999,
      "text": " and you're trying to do a digital transformation on it, you've actually got pretty serious"
    },
    {
      "speakerLabel": "spk_0",
      "start": 631.1999999999999,
      "end": 634.8,
      "text": " obligation because you're trying to replicate the success of what that human"
    },
    {
      "speakerLabel": "spk_0",
      "start": 634.8,
      "end": 638.9599999999999,
      "text": " team has been able to do, but you've maybe you're trying to do it in a more scalable, automated way."
    },
    {
      "speakerLabel": "spk_0",
      "start": 639.5999999999999,
      "end": 645.1999999999999,
      "text": " So when you think about your minimal viable product, you've got a pretty high bar already"
    },
    {
      "speakerLabel": "spk_0",
      "start": 645.1999999999999,
      "end": 651.5999999999999,
      "text": " to meet because you have to make it really as viable as what came before. And so you're trying"
    },
    {
      "speakerLabel": "spk_0",
      "start": 651.5999999999999,
      "end": 657.92,
      "text": " to implement scalability without sacrificing the excellent capabilities of that team of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 657.92,
      "end": 663.52,
      "text": " people, which is very difficult thing to do. So I just think the main thing to say there is that"
    },
    {
      "speakerLabel": "spk_0",
      "start": 663.52,
      "end": 667.04,
      "text": " okay, yeah, you should tick all those boxes that we mentioned already in terms of having"
    },
    {
      "speakerLabel": "spk_0",
      "start": 667.04,
      "end": 673.1999999999999,
      "text": " infrastructures code and unit tests, but you should be aware that you actually have a risk"
    },
    {
      "speakerLabel": "spk_0",
      "start": 673.1999999999999,
      "end": 677.68,
      "text": " by building a technical MVP if you don't have the same rigor and foundations in place that your"
    },
    {
      "speakerLabel": "spk_0",
      "start": 677.68,
      "end": 682.56,
      "text": " manual process has. Yeah, I totally agree with that. I actually now want to make a little bit"
    },
    {
      "speakerLabel": "spk_1",
      "start": 682.56,
      "end": 686.3199999999999,
      "text": " of an experiment because if you have been following this podcast, you probably have"
    },
    {
      "speakerLabel": "spk_1",
      "start": 686.3199999999999,
      "end": 691.1999999999999,
      "text": " noticed that we have done a series of live streams where we built, let's call it a product, I don't"
    },
    {
      "speakerLabel": "spk_1",
      "start": 691.2,
      "end": 696.32,
      "text": " want to say an MVP or not. The experiment is actually to try to assess if that was an MVP or"
    },
    {
      "speakerLabel": "spk_1",
      "start": 696.32,
      "end": 701.2,
      "text": " not. And the product is something we call WeShare, which is like a, I don't know, a clone of WeTransfer"
    },
    {
      "speakerLabel": "spk_1",
      "start": 701.2,
      "end": 706.96,
      "text": " or Dropbox Transfer. So upload a file, get a URL, somebody else can download the file with that URL."
    },
    {
      "speakerLabel": "spk_1",
      "start": 707.6,
      "end": 712.4000000000001,
      "text": " So what we did is basically we put in place some of the things that we say that are needed for an"
    },
    {
      "speakerLabel": "spk_1",
      "start": 712.4000000000001,
      "end": 717.6800000000001,
      "text": " MVP, but maybe not all of them. So I'm going to try to do a mental exercise to try to list all of them"
    },
    {
      "speakerLabel": "spk_1",
      "start": 717.68,
      "end": 722.64,
      "text": " and say yes or no, whether we did a good job or not. So we did do infrastructure as code. We used"
    },
    {
      "speakerLabel": "spk_1",
      "start": 722.64,
      "end": 727.28,
      "text": " the serverless framework and everything was pretty much infrastructure as code, multiple stacks."
    },
    {
      "speakerLabel": "spk_1",
      "start": 727.28,
      "end": 732.64,
      "text": " So I feel pretty confident saying that we did a good job there. Unit test and end-to-end test,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 733.1999999999999,
      "end": 739.68,
      "text": " probably more than a no, than a yes. We have a few unit tests, mostly as an example of how you will"
    },
    {
      "speakerLabel": "spk_1",
      "start": 739.68,
      "end": 746.88,
      "text": " test specific APIs, but I wouldn't be comfortable saying that this unit test, that the ones we have"
    },
    {
      "speakerLabel": "spk_1",
      "start": 746.88,
      "end": 752.24,
      "text": " right now will serve customers well, assuming that there will be customers using this application."
    },
    {
      "speakerLabel": "spk_1",
      "start": 752.24,
      "end": 756.96,
      "text": " So probably more of a no than a yes. We should be doing more work there. Automated deployment,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 756.96,
      "end": 761.36,
      "text": " absolutely not. We were deploying manually. You might've seen the pain of SLS deploy,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 761.36,
      "end": 766.88,
      "text": " waiting three minutes and then trying again. And yeah, not committed code was deployed and all"
    },
    {
      "speakerLabel": "spk_1",
      "start": 766.88,
      "end": 773.76,
      "text": " this kind of stuff. So definitely a big no there. Observability, maybe a 50-50. We did show some"
    },
    {
      "speakerLabel": "spk_1",
      "start": 773.76,
      "end": 778.88,
      "text": " stuff. We did show how to do custom metrics. We did have structured logs in place, but we didn't"
    },
    {
      "speakerLabel": "spk_1",
      "start": 778.88,
      "end": 783.2,
      "text": " do anything useful in terms of actually operating on this data. We didn't have alerts. We didn't"
    },
    {
      "speakerLabel": "spk_1",
      "start": 783.2,
      "end": 788.08,
      "text": " have dashboards. We did try to set up tracing, but we kind of failed at the first attempt. And then"
    },
    {
      "speakerLabel": "spk_1",
      "start": 788.08,
      "end": 792.96,
      "text": " we said, okay, we're going to revisit this later and never got back to it. So again, observability"
    },
    {
      "speakerLabel": "spk_1",
      "start": 792.96,
      "end": 799.84,
      "text": " is probably 20%, but definitely not a yes. It's more of a no than a yes. Security fundamentals,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 799.84,
      "end": 806.4,
      "text": " probably we did a good job. I guess we covered the basics. We tried to write very restrictive"
    },
    {
      "speakerLabel": "spk_1",
      "start": 806.4,
      "end": 813.9200000000001,
      "text": " policies. So we have an authentication mechanism. We did try to do at least the minimum kind of"
    },
    {
      "speakerLabel": "spk_1",
      "start": 813.9200000000001,
      "end": 820.08,
      "text": " work there. So I'm confident on that one. Skills, I believe that if we consider ourselves the"
    },
    {
      "speakerLabel": "spk_1",
      "start": 820.08,
      "end": 826.1600000000001,
      "text": " operators of this product, we did rely on skills that I think we have. So probably yes."
    },
    {
      "speakerLabel": "spk_1",
      "start": 826.16,
      "end": 830.88,
      "text": " Documentation was probably a little bit more of a no than a yes, but recently we put a little bit"
    },
    {
      "speakerLabel": "spk_1",
      "start": 830.88,
      "end": 835.4399999999999,
      "text": " of effort in actually documenting the entire setup process and how does it work, what it does,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 835.4399999999999,
      "end": 839.6,
      "text": " what kind of infrastructure it creates. And people should be able to actually take all we have and"
    },
    {
      "speakerLabel": "spk_1",
      "start": 839.6,
      "end": 844.56,
      "text": " deploy in their own accounts. So probably more of a yes, but used to be a no a few days ago."
    },
    {
      "speakerLabel": "spk_1",
      "start": 845.6,
      "end": 846.16,
      "text": " Thank you for that."
    },
    {
      "speakerLabel": "spk_1",
      "start": 847.68,
      "end": 853.28,
      "text": " So one interesting thing before we try to assess whether this is an MVP or not is that I think"
    },
    {
      "speakerLabel": "spk_1",
      "start": 853.28,
      "end": 858.4,
      "text": " our goals are not entirely clear with this particular product. On one side, it was meant"
    },
    {
      "speakerLabel": "spk_1",
      "start": 858.4,
      "end": 864.4,
      "text": " to be more of an educational product. So the product itself is not the WISCHER thing, like"
    },
    {
      "speakerLabel": "spk_1",
      "start": 864.4,
      "end": 868.64,
      "text": " the actual product that allows you upload and download files, but more the whole experience,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 868.64,
      "end": 873.4399999999999,
      "text": " the showing people how to use serverless, how to use AWS and how do you build something from"
    },
    {
      "speakerLabel": "spk_1",
      "start": 873.4399999999999,
      "end": 879.12,
      "text": " scratch. Like what is the whole experience there? So that's maybe one aspect of the product. Then"
    },
    {
      "speakerLabel": "spk_1",
      "start": 879.12,
      "end": 884.88,
      "text": " if you want to consider the actual tech product as uploading and downloading files, that's an"
    },
    {
      "speakerLabel": "spk_1",
      "start": 884.88,
      "end": 889.84,
      "text": " entire other story and it would require to have users, which we don't have right now. So I'm not"
    },
    {
      "speakerLabel": "spk_1",
      "start": 889.84,
      "end": 894.48,
      "text": " really sure how we should consider that one. Do we consider a potential future product? Do we want to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 894.48,
      "end": 899.84,
      "text": " consider product because we use it ourselves? That's probably to be assessed. What do you think?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 899.84,
      "end": 904.64,
      "text": " Do you consider this a successful MVP or not? Or maybe it's more of a product."
    },
    {
      "speakerLabel": "spk_0",
      "start": 904.64,
      "end": 910.8,
      "text": " No, not as a product. As an educational product, I think, yes, it is viable as an education thing"
    },
    {
      "speakerLabel": "spk_0",
      "start": 910.8,
      "end": 915.36,
      "text": " and as a how to build stuff on AWS, for sure. I think there's plenty of lessons there for people."
    },
    {
      "speakerLabel": "spk_0",
      "start": 915.36,
      "end": 921.04,
      "text": " I'm satisfied with that part. But as a product within that, no, because you have to be serious"
    },
    {
      "speakerLabel": "spk_0",
      "start": 921.04,
      "end": 925.1999999999999,
      "text": " ultimately about supporting users if you're going to do a product and that's not what this is. But"
    },
    {
      "speakerLabel": "spk_0",
      "start": 925.84,
      "end": 930.64,
      "text": " maybe somebody out there will take it as inspiration and build our super successful startup"
    },
    {
      "speakerLabel": "spk_0",
      "start": 930.64,
      "end": 934.8,
      "text": " ahead of it and become a unicorn and we can say we were there at the start."
    },
    {
      "speakerLabel": "spk_0",
      "start": 934.8,
      "end": 937.1999999999999,
      "text": " Remember about us at that point."
    },
    {
      "speakerLabel": "spk_1",
      "start": 937.1999999999999,
      "end": 937.84,
      "text": " Yes."
    },
    {
      "speakerLabel": "spk_1",
      "start": 937.84,
      "end": 939.1999999999999,
      "text": " Send us a gift or something."
    },
    {
      "speakerLabel": "spk_1",
      "start": 939.1999999999999,
      "end": 946.64,
      "text": " Exactly. Buy us a coffee. So I think maybe let's just wrap it up with a couple of thoughts. So we"
    },
    {
      "speakerLabel": "spk_0",
      "start": 946.64,
      "end": 951.28,
      "text": " said that an MVP needs clearly defined minimal scope. You have to have a product part, real users"
    },
    {
      "speakerLabel": "spk_0",
      "start": 951.28,
      "end": 956.72,
      "text": " with a real need and you need on the tech part, rigorous foundation with deployments, operations,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 956.72,
      "end": 961.9200000000001,
      "text": " security, et cetera. So you might agree or disagree with the checklist of what it takes to have a real"
    },
    {
      "speakerLabel": "spk_0",
      "start": 961.9200000000001,
      "end": 967.12,
      "text": " MVP. The most important thing really is that when it comes to what it takes to have a real MVP,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 967.12,
      "end": 972.08,
      "text": " that should be defined within with you and your team so that everybody agrees what that is and"
    },
    {
      "speakerLabel": "spk_0",
      "start": 972.08,
      "end": 975.9200000000001,
      "text": " that you're not talking about different things and having completely different expectations"
    },
    {
      "speakerLabel": "spk_0",
      "start": 975.9200000000001,
      "end": 981.52,
      "text": " about the level of quality and the level of sustainability in that product. Because often"
    },
    {
      "speakerLabel": "spk_0",
      "start": 981.52,
      "end": 985.6,
      "text": " problems arise when people assume that, OK, it's an MVP, we can take shortcuts on loads of the"
    },
    {
      "speakerLabel": "spk_0",
      "start": 985.6,
      "end": 989.6800000000001,
      "text": " fundamentals here. And other people are thinking, OK, no, this is a really complete solid product,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 989.6800000000001,
      "end": 994.32,
      "text": " it's just a minimal set of features. So agree those expectations early on and you can avoid a"
    },
    {
      "speakerLabel": "spk_0",
      "start": 994.32,
      "end": 1002.88,
      "text": " lot of confusion and conflict later on. Do you think we can refer people back Luciano to some of"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1002.88,
      "end": 1008.08,
      "text": " the previous episodes? Maybe when it comes to the actual how-to of building an MVP, there's a couple"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1008.08,
      "end": 1009.76,
      "text": " of links in there. What do you think?"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1009.76,
      "end": 1014.64,
      "text": " Absolutely. I don't know if they are well-structured, but definitely if you listen to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1014.64,
      "end": 1020.48,
      "text": " them, you will extract some information that is definitely relevant for the topic today. It's"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1020.48,
      "end": 1024.32,
      "text": " definitely going to give you elements on how to build your own MVP and what kind of technical"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1024.32,
      "end": 1030.08,
      "text": " aspects you need to focus on and how to do those things in the context of AWS. So we have episode"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1030.08,
      "end": 1036,
      "text": " nine, which is how do you get started with AWS, which tries to cover all sorts of different things"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1036,
      "end": 1041.52,
      "text": " that maybe not obvious if you are approaching AWS as a newcomer. Like what are the main things you"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1041.52,
      "end": 1045.52,
      "text": " should do straight away? What are the main topics you should get yourself comfortable with?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1046.48,
      "end": 1051.84,
      "text": " Actually, I think AWS has a pretty high barrier to entry. It's not just get a server deployed."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1051.84,
      "end": 1056.4,
      "text": " There is just a lot more context that you need to get before you are in a position that you can"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1056.4,
      "end": 1060.24,
      "text": " actually put something into production. So I would recommend that episode to cover all of that."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1060.8799999999999,
      "end": 1065.36,
      "text": " Then we also have episode 15, which is is serverless good for startups? This is more of"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1065.36,
      "end": 1069.68,
      "text": " an opinion take and it's something that if you have been watching our live streams, you can"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1069.68,
      "end": 1074.8,
      "text": " kind of correlate more of an opinion. Would you use the same approach for your startup? Yes or no?"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1074.8,
      "end": 1080.3200000000002,
      "text": " Why? In which circumstances? Probably you're going to find an answer there. We have a few episodes on"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1080.3200000000002,
      "end": 1087.68,
      "text": " observability. We have 33, which talks about CloudWatch metrics, 34, CloudWatch alarms, and 35,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1087.68,
      "end": 1093.44,
      "text": " which is more about how do you query logs with CloudWatch. We have another one about"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1094.5600000000002,
      "end": 1099.3600000000001,
      "text": " infrastructure as code, which is episode 31, where we try to compare CloudFormation or Terraform."
    },
    {
      "speakerLabel": "spk_1",
      "start": 1099.36,
      "end": 1103.76,
      "text": " This is probably one of our most successful episodes, probably because it's a little bit"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1103.76,
      "end": 1108.9599999999998,
      "text": " of a flame war where I think I vouch a little bit more for Terraform and Owen vouches a little bit"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1108.9599999999998,
      "end": 1114.8799999999999,
      "text": " more for CloudFormation. Again, you might have opinions. The important part is to do something"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1114.8799999999999,
      "end": 1118.6399999999999,
      "text": " about it. Maybe you can use CDK. Maybe you can use Pulumi. Just do infrastructure as code in"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1118.6399999999999,
      "end": 1124,
      "text": " whatever way. It's more convenient to you, but just do it. Then finally we have episode 37,"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1124,
      "end": 1130.96,
      "text": " which is how do you migrate a monolith to AWS without the drama. If you want to watch our live"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1132,
      "end": 1136.56,
      "text": " series of live coding sessions, we have a playlist on YouTube. We are also going to have the link to"
    },
    {
      "speakerLabel": "spk_1",
      "start": 1136.56,
      "end": 1141.84,
      "text": " that playlist in the show notes. Luciano will try and make all that very accessible to people"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1141.84,
      "end": 1146.32,
      "text": " on YouTube and in the show notes as well. Thanks very much for listening, everybody,"
    },
    {
      "speakerLabel": "spk_0",
      "start": 1146.32,
      "end": 1155.36,
      "text": " and catching up on our latest AWS Bytes. We'll see you in the next episode."
    }
  ]
}